[
    {
        "title":"40 GW EU power faces cyberattack risk – IT specialists",
        "subtitle":"(Montel) Up to 40 GW of Europe’s wind and solar power sites are vulnerable to cyberattack amid a security flaw that could be easily fixed, a pair of IT specialists told Montel.",
        "body":"At issue was the use of remote devices provided by German company EFR to manage output from renewables units in Germany, Austria, the Czech Republic, Hungary and Slovakia, said Fabian Braeunlein and Luca Melette of Berlin-based IT firm Positive Security.\n“I was really surprised that there was this non-existent level of security,” said Melette, regarding the devices supplied by EFR, with similar units in the UK already being replaced.\nThe pair discovered the flaw by accident, while investigating the possibility of hacking streetlights to create a city-wide light show.\nDisrupt signalsMany wind turbines and solar power farms used the same remote systems, with it possible to hijack the signals by simply getting an off-the-shelf transmitter close enough to an individual site, they said.\nIt is not clear how many facilities use the EFR devices and the company would not comment when contacted by Montel, but Positive Security estimated up to 40 GW of wind and solar sites could be vulnerable.\nHackers would only need to disrupt around 3 GW to seriously unbalance Germany’s power grid, potentially leading to widespread blackouts, said Braeunlein, while Melette speculated it could take a dedicated hacker about six months to organise such an attack.\nGermany’s IT security regulator BSI told Montel it was aware of the potential risk but added the hurdles to launching such an attack were “very high”.\nCurrent German legislation does require facilities to make security upgrades but the full roll out was unlikely before 2030.\nLarge facilities vulnerableIt meant large facilities would remain vulnerable, when the priority should be with them, said Positive Security, with an upgrade “manageable in six months”. \nHowever, the current timetable was enshrined in law and any changes would require an amendment, which was unlikely in the near term given Germany was in political limbo with elections due at the end of next month.\nThere are fears around European energy infrastructure currently, with concerns Russia could target such facilities amid heightened tensions with the West over its war in Ukraine. Only last month, the undersea Estlink 2 power cable between Estonia and Finland was damaged in suspected sabotage by a Russian-linked ship.",
        "datestamp":"15-01-2025",
        "category":[
            "POLICY",
            "TRANSMISSION"
        ]
    }
]