[
    {
        "title":"AfD pledges to “tear down” German wind turbines, scrap CO2 price",
        "subtitle":"(Montel) Parties at both ends of Germany’s political spectrum pledged sweeping changes to the country’s energy policy at weekend presentations of their election platforms, including a return to Russian gas and removal of wind turbines.",
        "body":"Germany’s right-wing AfD would eliminate all funding programmes or priority access for renewable energy, said Alice Weidel, its candidate for chancellor, at a party conference in Riesa, Saxony at the weekend. \n“We will usher in the end of the energy transition and exit EU climate policy,” said Weidel. “When we are at the helm, we will tear down all wind turbines,” she added.\nShe said that the AfD would also eliminate carbon pricing, restart nuclear plants and resume gas purchases from Russia if elected to office after the elections, which are scheduled for 23 February.\nHer party would put the damaged Nord Stream gas pipeline with Russia – the 2022 sabotage of which remains unsolved – back into operation, she said.\nShe described carbon pricing as an unnecessary production cost that was putting German industry at a competitive disadvantage.\nGermany’s domestic intelligence services are monitoring the AfD on suspicions of far-right extremism. The party is currently Germany’s second most popular, polling at around 20%.\nNord StreamMeanwhile, the BSW, which was founded last year following a split from Germany’s Left party, has described the sanctions against Russia following its 2022 invasion of Ukraine as a “stimulus programme for the US economy and a killer of German and European companies”.  \nGermany’s federal government should “negotiate with Russia to obtain cheap natural gas via the remaining string of the Nord Stream pipeline”, the BSW said at a party event in Bonn.\nAs an export-oriented economy, Germany needed cheap energy and supply security, it said. Technologies such as solar and wind alone would not suffice, it added.   \nCarbon pricingIn addition, the party said that Europe’s emissions trading scheme was driving the relocation of European industry abroad.\n“We want to abolish the CO2 price, which makes everything more expensive without there being any alternatives for most people,” the party said.\nThe BSW is polling at just above the 5% threshold required to enter parliament. \nCentrist majorityThe centre-right CDU\/CSU, which is currently in opposition, is leading the polls on roughly 30%. \nChancellor Olaf Scholz’s SPD party is polling at roughly 16% and the Greens at almost 14%. The liberal Free Democrats, whose departure from the coalition collapsed the government late last year, are polling at around 4%.\nCentrist parties have all promised to lower energy costs, with the CDU\/CSU saying that it would close no more power stations until sufficient replacement assets were brought online.",
        "datestamp":"13-01-2025",
        "category":[
            "CARBON",
            "GAS",
            "POLICY",
            "WIND"
        ]
    }
]