[
    {
        "title":"Baltic TSOs launch balancing market to split from Russian grid",
        "subtitle":"(Montel) The TSOs in Estonia, Latvia and Lithuania have launched a joint balancing market that will help them keep stable grid frequency following the desynchronisation from the Russian power system scheduled for Saturday.",
        "body":"“We are closely working together to carry out Baltic synchronisation and to ensure system stability and reliability during the decoupling from [the Russian power grid], isolated operation and integration into the Continental Europe Synchronous Area,” said Donatas Matelionis, head the power system operations department of Lithuanian TSO Litgrid.\n“The successful launch of the Baltic balancing capacity market has enabled us to acquire balancing services necessary for the system operation,” he added in a statement on Wednesday.\nThe three Baltic states stopped trading electricity with Russia in 2022 but still rely on balancing services from the Russian grid. The three former Soviet countries will decouple from the Russian grid on Saturday and integrate with continental Europe through Poland on Sunday.\nFirst auction procures 1,257 MWThe Baltic balancing market currently consists of frequency containment reserves (FCRs) and manual frequency restoration reserves (mFRRs).\nThe first auction for balancing reserves, held on Tuesday, procured 29 MW of FCRs and 1,228 MW of mFRRs, with 730 MW being deemed as upward regulation and 498 MW downward regulation.\nAutomatic frequency restoration reserves (aFRRs) will initially not be procured by the TSOs due to delays in the accession to the joint European platform Picasso.\nThe total market demand for balancing capacity in the Baltic States will reach approximately 1,500 MW in 2025.\nLitgrid expects demand for balancing capacity will increase with the growth of renewable energy production and the increase in the number of generating consumers.",
        "datetime":"2025-02-05T10:40:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]