[
    {
        "title":"Baltic spot power jumps amid low import capacity – analysts",
        "subtitle":"(Montel) Spot power prices in the Baltic region have soared above neighbouring countries since the countries cut physical power ties to Russia on 8 February amid bullish weather and limited import capacity caused by the split, analysts told Montel.",
        "body":"Estonia, Latvia and Lithuania have seen spot prices average around EUR 170\/MWh since 8 February, when they split from the Russian system after 80 years of reliance before successfully synchronising their power system with the EU grid through Poland.\nThis compares with EUR 72\/MWh in Finland, EUR 115\/MWh in southern Sweden and EUR 139\/MWh in Poland, exchange data showed.\nThe Baltic spot prices have almost doubled from the EUR 100\/MWh average seen between 1 January and 8 February.\nLjubov Cherney, senior analyst at Montel Analytics, primarily pointed to cold weather and little wind as sparking the rise, but said the split also forced TSOs to cut capacity on cross-border links to other EU countries for system security reasons.\n“There is limited flexibility in the Baltic system, which means that only small changes to demand or supply could have a huge price impact,” she added.\nCapacity on the 500 MW LitPol link to Poland has been cut to zero during the first two weeks since the split, while capacity on the Nordbalt cable with Sweden was cut by 100 MW to 600 MW until today.\nWith the damaged Estlink 2 cable (650 MW) between Finland and Estonia remaining offline, the Baltic countries have only had just over 40% of their maximum import capacity available since the split.\nPoland issuesDue to the sync with Poland, capacity on the LitPol cable would be reduced to 150 MW from 24 February until further notice to provide system services, said independent Lithuanian energy market analyst Vija Pakalkaite.\nShe said the risk of price spikes in the Baltic states had increased since the region was now connected to the wider continental market only through one power line, while they previously had multiple connections to Russia and Belarus.\n“This may feel risky to market participants, especially with recent concerns over cable cuts in the Baltic Sea, which could fuel market jitters,” she said.\n“Technically, the Baltic system has already proven it can run in island mode [on 8 February], so the big part of the nervousness does not have grounds. But system stability doesn’t guarantee that peak demand will always be covered if there will be demand or supply shocks. System security will always take priority in such situations.”",
        "datetime":"2025-02-17T14:36:13",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]