[
    {
        "title":"Baltic states complete EU power system integration, oust Russia",
        "subtitle":"(Montel) Estonia, Latvia and Lithuania successfully synchronised their power system with the EU grid over the weekend, after 80 years of reliance on the Russia-based system.",
        "body":"The move was completed at 13:05 CET on Sunday, marking “a key milestone for the Baltic states and for Europe, strengthening the energy resilience and independence across the region,” said Lithuanian TSO Litgrid in a statement.\n“Synchronisation is a guarantee of our energy freedom. It allows us not only to manage the electricity system more securel but also to integrate renewable energy sources more efficiently. This is the foundation of our energy future,” said Ltigrid CEO Rokas Masiulis.\nThe disconnection of physical power lines to Russia, Belarus and the Russian exclave of Kaliningrad was completed on Saturday, leaving the Baltic states to take care of their own balancing for around 29 hours until they completed EU synchronisation yesterday.\nThe Baltic states had not traded any electricity with Russia since 2022, following the invasion of Ukraine but the countries had relied on the link for critical balancing of regional production and consumption.",
        "datetime":"2025-02-10T06:55:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]