[
    {
        "title":"Belgian TSO defends cost increase as 3.5 GW project delayed",
        "subtitle":"(Montel) Belgian TSO Elia has defended itself over the rising costs of the 3.5 GW Princess Elisabeth energy island project that had led to it being delayed by three years.",
        "body":"“The scale of the costs and benefits of the Princess Elisabeth Island project [were] largely in line with those of the Creg report,” it said late on Thursday, referring to accusations made in the report by the country’s Creg regulator that claimed the TSO was to blame for EUR 1.6bn of cost overruns.\nThe Belgian TSO cited “huge demand for electrical equipment” in recent years, which had created “an imbalance between supply and demand” and a “significant cost increase”.\nIt also added that the power transmission infrastructure costs had not yet been incurred.\nFurther analysis“We want to spend the next few days and weeks further analysing Creg’s comments and discussing them in depth. We aim to openly inform the government and the regulator about the technical configuration of the project,” Elia said.\nOverall, the cost of the project comprising 3.5 GW of offshore wind farms in Belgium’s North Sea, an interconnection with the UK and an interconnection with Denmark, had soared from EUR 2.2bn to over EUR 7.5bn, local media reports said yesterday, citing the Creg report.\nThe regulator said that EUR 1.6bn of the budget overrun was “directly linked to unilateral technical decisions made by Elia”, according to the reports.\nElia announced on Tuesday that it would postpone signing contracts for power transmission infrastructure due to increasing costs, which would cause the overall project to be delayed by around three years, with launch initially having been due in 2030.",
        "datetime":"2025-02-07T07:08:38",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]