[
    {
        "title":"Berlin could use parts of Nord Stream 2 to import H2 – report",
        "subtitle":"(Montel) Germany could use parts of the inoperable Nord Stream 2 pipeline to import green hydrogen from Finland, German daily Handelsblatt reported on Wednesday.",
        "body":"Three of four of the Nord Stream 1 and 2 pipelines that link Germany to Russia via the Baltic Sea were damaged by explosions in September 2022, with Western and Russian officials citing sabotage and denying any involvement. No group has taken responsibility.\nHowever, sections of the Nord Stream 2 pipeline in German waters could be used in the future to import renewable hydrogen from Finland to help increase the region’s energy security and meet climate targets, according to the Handelsblatt report.\nFor instance, the Baltic Sea Hydrogen Collector, a project that aims to transport green hydrogen, could avoid construction of a new pipeline by utilising parts of the existing Nord Stream 2 construction, the report said.\nThe companies behind the project are Copenhagen Infrastructure Partners, Nordion Energi, and Gasgrid Finland.\nNord Stream 2 AG is 51% owned by Russia’s Gazprom and is based in the Swiss city of Zug, where a cantonal court has postponed the decision on the bankruptcy of the company to 9 May. This gives time for a new government in Germany to form following the 23 February federal elections.\nA government spokesperson declined to comment to Handelsblatt about whether a new government would support utilising parts of the existing Nord Stream 2 pipeline to import renewable hydrogen.\nNord Stream 2 is a politically controversial extension of the Nord Stream 1, through which large quantities of gas were delivered before the start of the Russian invasion of Ukraine in February 2022. Nord Stream 2 was completed and filled with gas, but its launch was blocked by German authorities.",
        "datetime":"2025-02-05T07:50:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]