[
    {
        "title":"Bidder’s exit likely to drive up Slovenia nuclear project cost",
        "subtitle":"(Montel) The withdrawal of South Korea’s KHNP from the bidding to construct Slovenia’s JEK2 nuclear power plant is “bad news” and is likely to increase the cost of the project, a local economist told Montel.",
        "body":"Slovenian utility Gen, the project’s developer, announced last week that KHNP had dropped out, leaving just the US’s Westinghouse and France’s EDF competing for the construction contract for the 1-1.7 GW plant.\nNow we can only choose between two potential bidders, which means less competition and higher prices, economist Joze Damijan told Montel.\nAlternative construction companies should now be invited to participate, Damijan said.\nProject referendumSlovenia is yet to decide on whether to advance with JEK2, after a referendum scheduled for last year was postponed.\nThe country is set to vote on the proposed nuclear expansion once more information is available. A date for a new referendum is yet to be confirmed.\nSlovenia must first hold a referendum, and then we will know whether JEK2 will be built. \nI think that was the main reason for KHNP’s withdrawal, Croatian nuclear expert Tonci Tadic told Montel.\nSlovenia hopes to complete the plant by 2040.",
        "datetime":"2025-02-05T11:18:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]