[
    {
        "title":"Biden study unlikely to derail US LNG exports – analysts",
        "subtitle":"(Montel) The report of the outgoing US administration of president Joe Biden on LNG exports is unlikely to be strong enough to affect US shipments of the chilled fuel, industry analysts told Montel.",
        "body":"“If the Biden administration is looking for a compelling case against [LNG exports], they probably didn’t get it,” said Jason Feer, global head of business intelligence at consultancy Poten & Partners.\nThis was in response to a long-awaited US energy department report, published on Tuesday, on the economic, environmental and social effects of LNG exports from the US.\nThe Biden administration in January paused authorisation of new LNG export decisions as it awaited the results of the report.\n“They’ve tried to spin it the best they can,” Feer said, referencing a statement from energy secretary Jennifer Granholm that “unfettered exports of LNG would increase wholesale domestic natural gas prices by over 30%”.\nIn its most extreme scenario, the report said a 239.4m tonnes\/year increase in US LNG exports by 2050 would lead to a 31% jump in Henry Hub gas prices by 2050, to USD 4.62\/MMbtu.\nBut other scenarios projected domestic gas price increases of between just 3-7%.\n“This kind of supports the notion that additional exports aren’t going to cost Americans a tremendous amount of money,” Feer said.\nThe report also said cumulative carbon dioxide equivalent emissions could increase by between 21m tonnes and 1,452m tonnes, which Feer said was not “terribly meaningful”.\n“Poke holes”The study – which is now subject to a 60-day public comment period – had not caused Wood Mackenzie to change its view on US projects making final investment decisions, said Mark Bononi, analyst with the consultancy.\nAnd this consultancy period would leave room for opponents “to poke holes in the administrative record”, said Thomas Sharp, of consultancy Arbo.\nIf the opposition could “sow enough doubt with respect to the veracity of the study” during this period, justification for rescinding it and using previous studies to resume issuing export authorisations would be strengthened, he noted. \nNew Trump study?The incoming Trump administration in January could also commission a new study, he added.\n“In all likelihood, the report will be withdrawn by the next administration to remove any patina of authoritativeness it might have,” said Scott Segal, partner with energy law firm Bracewell.\n“There are ample grounds for withdrawal of the report,” he said, pointing to US budget office guidelines designed to ensure the quality, objectivity, utility and integrity of information disseminated by federal agencies.  \n“In light of its biases, it is arguable that the report does not meet the standards contemplated,” he said.\n“Environmentalists who think they’re going to use this in a legal fight are misguided,” echoed Frank Maisano, senior principal at Bracewell.",
        "datestamp":"19-12-2024",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]