[
    {
        "title":"British gas burn slumps to 20-year low amid renewables surge",
        "subtitle":"(Montel) British renewable energy output hit 118 TWh in 2024, boosted by record wind, helping to push gas generation in the country to its lowest level in 20 years, full-year data from Montel Analytics showed today.",
        "body":"Wind output rose by 4% on the year to a record-high 83 TWh, to account for 70% of Britain’s renewables generation, the firm added in a new report. Biomass production totalled 19 TWh (16% of renewables generation), while solar reached 13 TWh (11%).\nMeanwhile, gas-fired generation amounted to 73 TWh, down by 16% on the year, the data showed. Gas prices averaged GBP 29\/MWh in 2024, down from GBP 34\/MWh the year before, amid lower demand and despite bullish factors such as Norwegian outages and geopolitical tensions.\nBritain’s day-ahead power price averaged GBP 72.58\/MWh, down by almost a quarter on the year due to increased renewables output. In addition, the surge in renewables led to a total of 139 hours with negative prices, up from 86 hours in 2023.\nImports upElsewhere on the supply side, greater interconnector imports compounded the decline in gas-fired generation. Britain saw net imports via interconnectors rise by 40% on the year to average 3.8 GW, the highest in the last 10 years excluding 2022, when Britain became a net exporter amid nuclear outages in France.\nFrance and Norway were the main exporters to Britain via interconnectors last year, accounting for around 2.2 GW and 1.1 GW, respectively.\n“The importance of electricity transfer though the interconnectors has been accentuated following [regulator] Ofgem’s recent approval of five major new undersea energy links, which will further strengthen connections between Britain and Germany, Belgium, the Netherlands and Ireland,” said Phil Hewitt, director at Montel Analytics.",
        "datestamp":"15-01-2025",
        "category":[
            "GAS",
            "RENEWABLES",
            "WIND"
        ]
    }
]