[
    {
        "title":"Bulgaria finally joins Picasso power balancing mechanism",
        "subtitle":"(Montel) Bulgaria has successfully joined the EU’s cross-border power balancing mechanism Picasso – after a prior delay – and becomes the first nation in south-east Europe to do so, it said on Monday.",
        "body":"As the country was the first in the region to join, there would be no automatic frequency restoration reserve exchange between borders, it added in a statement.\n“For this objective reason, the formation of the marginal price for Bulgaria, used as a pricing factor in the methodology for determining the prices of balancing energy, will continue to be determined by the activated local sources of balancing services.”\nEncourage others?Bulgaria’s successful implementation of Picasso might encourage other major regional markets to join the platform earlier than indicated, said market participants.\n“Eso’s move will speed up Greek or Romanian entry set for middle of 2025 and end of 2026, respectively,” one trader said.\nThe Picasso platform was launched in 2022 with the aim of supporting balancing markets by sharing capacity between European countries, though last year a number of nations, including Bulgaria, delayed entry amid concerns the algorithm caused price spikes.",
        "datetime":"2025-02-10T12:20:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]