[
    {
        "title":"Cables benefit both Norway and Denmark – Danish minister",
        "subtitle":"(Montel) Current power links between Norway and Denmark are profitable despite the former’s opposition to renewing a deal for the operation of the two oldest interconnectors between the nations, Denmark’s energy minister Lars Aagaard told Montel.",
        "body":"“The figures indicate that there is an economic gain – also for Norwegian society – in the trade we have [over the Skagerak links],” he said late on Friday.\nHe was commenting on the growing opposition to upgrading the links, which reach the end of their technical lifetime later this decade, with Norway’s governing Labour party having said it would not approve construction of any new interconnectors before 2029 at the earliest.\nThe Centre party, that quit the Norwegian government last week over an EU energy policy dispute, was against renewing the cables, as do the right-wing Progress party, with the latter leading opinion polls ahead of the September general election.\nElevated pricesBoth blame increased power export capacity for having elevating power prices in southern Norway in recent years.\nBut Denmark’s energy minister said Norway should look beyond the immediate effect on wholesale power prices.\n“I think that [in Norway] they should also consider what makes the overall Norwegian society richer or poorer. And Norway’s trade with Denmark helps make Norway richer. I hope that is also remembered,” the minister added.\nNorway and Denmark also share the Skagerak 3 and 4 cables, with a combined capacity of 1,140 MW.\nNorwegian TSO Statnett said in a long-term market analysis, published today, that power trade with neighbouring countries brought economic gains domestically.",
        "datetime":"2025-02-03T12:13:30",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]