[
    {
        "title":"CBAM must preserve competitiveness of steel industry – lobby",
        "subtitle":"(Montel) Proposals to simplify the EU carbon border adjustment mechanism (CBAM) must go hand in hand with a “watertight” design to preserve the competitiveness of the steel industry, the European steel association Eurofer said on Thursday.",
        "body":"Improvements were “urgently needed” to pave the way for steel decarbonisation in the bloc, with a focus on addressing issues such as resource shuffling, exports and the inclusion of downstream products, added the Brussels-based lobby group.\nIts statement follows European Commission deliberations last week regarding the simplifying of the mechanism for 80% of eligible companies and on the back of a high-level conference on the instrument held in Paris yesterday.\nToo late?“Alarmingly, during the conference, the commission announced that legislative proposals on crucial aspects of the [CBAM], including exports provisions and coverage of downstream sectors, will only be presented at the beginning of next year,” the lobby group said.\n“Furthermore, a top priority for securing steel decarbonisation investments in Europe – which is tackling resource shuffling – is currently not [even] listed in the commission’s planning of upcoming legislative proposals,” Eurofer added.\nResource shuffling refers to incidents where a producer in a non-EU country would export less carbon-intensive goods to the EU, while keeping more carbon-intensive products for domestic markets, potentially avoiding CBAM charges.\nEurofer said it was concerned about the “differing timelines” allocated to the simplification and effectiveness of CBAM.\nDeep concerns“While the commission is fast-tracking simplification… the European steel industry remains deeply worried about the lack of urgency in ensuring CBAM’s effectiveness,” it said.\nThe group recommended introducing a legislative solution prevent resource shuffling, adding there should be a “structural solution” to preserve European exports, as well as extending CBAM’s scope to steel-intensive downstream products.\nLaunching the mechanism without the necessary improvements would “further erode” the competitiveness of the European steel industry, it added.\n“This is indispensable given that the EU carbon price has reached approximately [EUR] 80\/t, while over 25m tonnes of steel – equivalent to around 20% of EU production – are imported annually from third countries without any carbon cost.”\nThe benchmark Dec 25 EUA contract was last seen trading down EUR 2.09 at EUR 78.20\/t.",
        "datetime":"2025-02-13T13:51:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]