[
    {
        "title":"CBAM simplification “welcome” for EU importers – consultancy",
        "subtitle":"(Montel) A simplification of the EU carbon border adjustment mechanism (CBAM) through the raising of the threshold for inclusion is likely to be a “welcome” change for thousands of importers, according to UK consultancy Redshaw Advisors.",
        "body":"Over 80% of EU companies eligible for the CBAM will be exempted under reforms planned by the European Commission, EU commissioner Wopke Hoekstra was reported as saying in a Financial Times article on Thursday.\n“What we have found is that roughly 20% or less [of firms covered by CBAM] are responsible for 97% of all the emissions,” he told the European Parliament’s tax committee on Thursday.\nInclusion thresholdThe value threshold for CBAM inclusion is currently set at EUR 150 for imported and covered goods, which include electricity, iron and steel, aluminium, hydrogen, fertilisers and cement. \nCurrent rules foresee 200,000 importers being impacted by a large administrative burden, which many considered disproportionate to the carbon impact of relatively small quantities of goods, said Dan Maleski, senior environmental markets advisor at Redshaw Advisors.\n“The change will be a welcome development for thousands of importers considering the substantial administrative burden that the lower threshold placed on smaller importers amidst a struggling EU economy that is also in the crosshairs of Trump’s tariffs,” he said.\nRaising the de minimis threshold would be an “obvious and easy win for the EU” following recent calls by the European People’s Party (EPP) for a two-year delay in EU CBAM implementation, and later for a simplification, according to Maleski.\nThe EC’s latest plans “essentially [confirm] that the EPP’s calls for the… start date to be delayed will be rejected,” said Maleski.\nThe proposed change would bring the EU CBAM more into line with the UK equivalent, which is set to be launched in 2027 and has a significantly higher de minimis threshold of GBP 50,000.\nSimplificationCBAM simplification is inevitable, according to Simon Goess, co-founder and managing director at German consultancy Carboneer.\nThe question is whether they will address “the environmental and carbon leakage concerns associated with the end of free allocations in the EU ETS”, he said.\n“The most [sensible] metric to determine simplifications would be in terms of imported volume, as this is directly related to imported emissions.”\nThe EC plans to present its ideas for simplifying selected EU legislation, including CBAM, on 26 February, along with a clean industrial deal strategy and an affordable energy action plan.\nA separate review by the EC later this year will look at expanding CBAM’s scope to include more industrial sectors and downstream products, as well as possible measures on exports.",
        "datetime":"2025-02-07T12:47:06",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]