[
    {
        "title":"CCS more competitive than hydrogen for power – Icis",
        "subtitle":"(Montel) Natural gas coupled with carbon capture and storage (CCS) looks likely to prove cheaper than burning hydrogen for backup power generation in Europe, commodities consultancy Icis said on Tuesday.",
        "body":"The former was likely to require a power price of around EUR 85-130\/MWh, assuming CCS costs of anywhere between EUR 100-250\/t of CO2, said Sebastian Braun, Icis head of power and hydrogen analytics, at the E-World energy fair in Essen, Germany.\nBy contrast, hydrogen-fired generation was likely to require power prices of between EUR 140-350\/MWh, depending upon hydrogen production costs that ranged from EUR 2-5\/kg.\nBraun said EUR 5\/kg was more realistic than EUR 2\/kg for hydrogen that complied with the EU’s standards for what constitutes green hydrogen, made with renewable energy.\n“Very expensive”Using hydrogen for power was “very expensive” and Icis models showed it would play only a marginal role next to other uses of the gas, for example in fertilisers, chemicals or metals with few alternative ways to decarbonise, Braun said.\nBefore Germany’s governing coalition collapsed last November, Green economy minister Robert Habeck had planned to tender for around 10 GW of gas-fired power plants capable of switching to hydrogen in future as part of a long-delayed power plant strategy.\nThe strategy crumbled with the collapse. The main opposition CDU\/CSU union, which is leading polls in elections set for 23 February, would prefer to build gas plants that can deploy CCS in future.",
        "datetime":"2025-02-12T06:15:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]