[
    {
        "title":"CDU win set to usher in era of cheaper German power, gas plants",
        "subtitle":"\n              (Montel) The victory of the Christian Democrat alliance (CDU\/CSU) in Sunday’s German general election could usher in an era of cheaper power prices and much-needed new gas plants, if it lives up to its election pledges. \n            ",
        "body":"\nThe alliance, which won 28.5% of the vote, now has the foundations to form the next coalition government but already said it would not partner with the right-wing AFD, which came second with 20.8% but is more likely link up with the Social Democrats (SPD), outgoing chancellor Olaf Scholz’s party, which came third. The Greens achieved fourth place.\n“We are going to lower the electricity tax on transmission fees to provide relief of at least 5 cents per kWh (EUR 50\/MWh). Power has to become cheaper for everyone,” the CDU said in its election manifesto.\n“Must secure supply”The party – led by Friedrich Merz who is set to become chancellor – also backed the rapid construction of 50 new gas-fired power plants, which he said was necessary to secure power supply.\nIt has also committed to existing legislation that will phase out the use of coal for power generation by 2038 but added it must be matched with the introduction of other capacity.\n“While on this path, there cannot be any further final closure of coal-powered plants so long as they have not been replaced with new gas-powered plants or combined heat and power systems,” the party said in its pre-election literature.\nThe CDU has also said that the German single price zone should remain, despite calls from some to split the country into different sectors to better match supply and demand, with a review on the matter currently being undertaken by EU grid body Entso-E.\nGrid expansion plansIn terms of other measures, the party has called for a focus on grid expansion, deemed vital for the country’s green energy transition, along with a reform of transmission fees.\nEnergy policy, along with a raft of other vital legislation, has been in a limbo since the government of the SPD, Greens and Liberal Free Democrats collapsed last year in a row about budgetary issues.\nThe incoming administration must adhere to the country’s green transition plans and climate protection policies, Marcel Fratzscher, president of the economic research institute DIW, told Montel in a recent interview.\n",
        "datetime":"2025-02-24T05:01:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]