[
    {
        "title":"Centrica’s gas storage profit plummets 99% in 2024",
        "subtitle":"\n              (Montel) UK utility Centrica’s profit from its gas storage business collapsed last year with lower seasonal gas price spreads dragging on the result, it said on Thursday. \n            ",
        "body":"\nCentrica’s profit from its storage business, which includes the 1.5bcm Rough storage facility, dropped 99% on the year to GBP 2m in 2024, it said in its preliminary results for the year ending 31 December.\nAs such, Centrica’s profit from its trading and optimisation unit fell by around 60% on the year to GBP 307m, with reduced commodity prices and volatility weighing on the result.\n“Centrica Energy delivered a resilient performance in a more normalised operating environment… reflecting reduced market volatility, which impacted our gas and power trading and route-to-market businesses,” Centrica said.\nGas market volatility in Europe eased last year following the drastic price spikes triggered by Russia’s full-scale invasion of Ukraine in February 2022.\nBenchmark European TTF front-month gas prices averaged EUR 34.60\/MWh, compared with EUR 41.38\/MWh in 2023, according to Ice Endex data.\nOperating profit drops 44%Centrica’s total group adjusted operating profit fell 44% last year to GBP 1.55bn, compared with GBP 2.75bn in 2023.\nMeanwhile, Centrica said it will add around 9 TWh to its power generation volumes from 2026-2030 with the extension of four nuclear power stations in which it holds a 20% share.\nCentrica said its 1.2 GW units Heysham 1 and Hartlepool will generate electricity until March 2027, one year later than previously expected, while the 1.2 GW units Heysham 2 and Torness will generate until March 2030, two years later than expected.\nThe company had hedged 5.5 TWh of nuclear energy at an average price of GBP 89\/MWh for 2025 and 1.8 TWh at GBP 76\/MWh for 2026 by the end of last year, it said.\n",
        "datetime":"2025-02-20T08:10:44",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]