[
    {
        "title":"Clock is ticking to save industry from high gas prices – lobby",
        "subtitle":"(Montel) Europe’s industrial sector needs substantial near-term aid to weather current high gas prices, stemming from tight supply – with only five years left to save some industries, the head of metals industry lobby Eurometaux told Montel.",
        "body":"“If the price of gas remains at this high level of EUR 40-50\/MWh, we will need to have very specific support [for operating costs] or we won’t be able to remain competitive,” said James Watson, Eurometaux director general. \n“There’s no market fundamental or market analysis that says gas and power prices will return to a competitive level in Europe anytime soon. The European Commission knows that.\"\n“Whether we like it or not, we need to recognise this reality and support industries until the market eases.”\nHe stressed the need for harmonised aid to help industrials evenly across the bloc.  \n“We have probably about five years to save the majority of those industries that are really exposed to international competition and high energy prices,” he said.\nThe EC is expected to unveil its affordable energy action plan on 26 February to tackle high energy prices, along with its clean industrial deal intended to keep manufacturing in Europe while decarbonising it. \nEurope’s metals industry, represented by Eurometaux, uses electricity for 60% of its energy needs. However, electricity prices remain heavily influenced by the cost of gas.\nWatson said gas prices were unlikely to drop significantly before mid-2027, when new supply enters the market.\nUrgent support neededThe affordable energy action plan may propose more favourable taxes, levies and tariff methodologies, Watson said.\n“But a lot of that is left to the member states in the end. This takes time and it won’t be uniform across the EU,” he warned.\nThe only way the clean industrial deal could provide immediate help in keeping factories open would be through state aid to strategic industries under the Critical Raw Materials Act or the Net-Zero Industry Act, Watson said.",
        "datetime":"2025-02-18T11:25:27",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]