[
    {
        "title":"Corporate PPA volumes surge 22% to record 13 GW in 2024",
        "subtitle":"(Montel) Europe saw a record high number of corporate power purchase agreements (PPAs) agreed last year by volume, with 12.7 GW contracted, surpassing 2023’s record of 10.4 GW, PPA platform Re-Source said on Thursday.",
        "body":"The 22% surge was primarily driven by solar energy deals, which accounted for nearly 7 GW of last year’s contracted capacity, while wind power remained steady, added the platform’s director Annie Scanlan during a webinar, citing the firm’s data.\nThe information and communication technology sector, particularly big tech companies and data centres, continued to lead the charge in securing such deals, while heavy industry, including chemicals, steel and metals, also performed strongly.\nSpain emerged as the top market for corporate PPAs last year, signing 3.5 GW of contracts – primarily solar – cementing its position as the region’s leader, followed by Germany with more than 2 GW, with a balanced mix of solar and wind deals, said Simon Dupond, policy analyst at SolarPower Europe during the same webinar.\nThe UK secured the third spot with just under 1.5 GW. France and the Netherlands also performed strongly, achieving close to 1 GW of contracted capacity, while firms in Italy and Greece saw a doubling in the number of deals year on year.\nRecord-breaking trajectoryCorporate PPAs were expected to continue their record-breaking trajectory in the coming years, driven by increased participation from more countries and supportive legislative frameworks across Europe, such as government-backed guarantee schemes, said Dupond.\nHowever, challenges such as slow electrification, grid constraints and negative power prices could pose hurdles to growth, he added.\n“The potential for more PPAs will directly come from electrification but electrification is not going as fast as we wish.”",
        "datetime":"2025-02-05T18:21:59",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]