[
    {
        "title":"Cost of 6 new French reactors to top EUR 100bn – auditors",
        "subtitle":"(Montel) EDF’s plan to build six new reactors in France by 2050 will likely cost more than EUR 100bn, the head of France’s court of auditors said on Tuesday – urging it to wait until it secures financing.",
        "body":"Also, the utility should delay a final investment decision on its plan to build a European pressurised reactor (EPR) at the UK’s Sizewell nuclear power plant until it had “significantly reduced its financial exposure to the Hinkley Point C EPR project”, Pierre Moscovici added.\nPresenting a new report on the global EPR industry, Moscovici said costs for six French reactors would “likely exceed EUR 100bn” when financing costs, which represent on average 25-30% of the investment, were added.\nRising costsIn June 2023, EDF said it expected costs would reach EUR 67.4bn (in 2020 euros). In February 2022, after president Emmanuel Macron officially launched the plan, it said the builds would cost EUR 51.7bn.\nGiven the rising estimates, EDF should “withhold a final investment decision” on the French plans until financing had been “secured and the detailed design studies completed”, Moscovici said.\nEDF has said it expected to make a final investment decision late this year or early in 2026.\nThe nuclear industry was “today not in a position to meet the challenges” of France’s nuclear programme, Moscovici said.\nHe noted “worrying” and “major” uncertainties, in particular “delays in progress on the design of the French EPRs, the cost of the first three pairs of reactors and the lack of funding for the programme”. \nEstimated costs and construction timetables would have to be revised again once the detailed design of the reactors had been completed, Moscovici said.\nIn response to the report, EDF said the competitiveness of the French EPRs depended on the financing agreement between the French government and the European Commission.\nUK risksMeanwhile, delays at the Sizewell EPR project in the UK were “already accumulating, even before the investment decision has been taken, with initial negative consequences in terms of organisation and finances”, the report said, adding that EDF should prioritise French plans above those in other countries.\nThe financing model for Sizewell C meant the utility would benefit from “regulated income from the construction phase”, EDF said.\nThis model limited the firm’s “capital exposure” and allowed “investment decisions to be decoupled from the challenges of refinancing the Hinkley Point project”, it added.\nConstruction costs of Sizewell C, where EDF hopes to build two 1.6 GW reactors, could rise to EUR 40bn, almost double EDF’s initial estimate, the Financial Times reported earlier today.\nThe court of auditors also said the final investment cost of EDF’s new Flamanville 3 reactor would be EUR 1.1bn above the utility’s most recent estimate.",
        "datestamp":"15-01-2025",
        "category":[
            "ELECTRICITY",
            "NUCLEAR"
        ]
    }
]