[
    {
        "title":"Cyberattacks on Ukraine energy system gain momentum",
        "subtitle":"(Montel) Cyberattacks on Ukraine’s energy infrastructure – which includes nuclear power – have escalated as Russia’s invasion enters a third year, enabling European utilities to learn from Kyiv’s front-line experience, the head of cybersecurity at Ukrainian tech firm Modus X told Montel.",
        "body":"“These attacks have become an integral part of the hybrid war against Ukraine,” said Yurii Shatylo, whose Kyiv-based company is responsible for protecting Ukraine’s largest private energy firm, Dtek, from cyberattacks.\n“Each year, cyberattacks grow more sophisticated, frequent and destructive, posing serious challenges to the stability of the Ukrainian energy system,” he added.\nAs an example, Russia had been carrying out attacks on critical infrastructure in both the physical – such as missile strikes – and cyber domains, simultaneously, to inflict maximum damage, he said.\n“The energy sector has become the primary target for our adversaries,” he said, noting blackouts, or complete power outages, were part of Russia’s strategy to undermine economic stability and morale.\nIn late December, Dtek said its thermal power plants had endured over 200 missiles, drone and artillery strikes since Russia’s full-scale invasion in February 2022.\nSome of the main types of cyberattack in 2024-2025 have included ransomware attacks, denial of service (or Dos) attacks – which aim to overload systems to disrupt services – and data breaches, where sensitive information is stolen, Shatylo said.\nHe also cited incidences of phishing, where a scam email is sent containing links to malicious websites, and cyber espionage, which is state-sponsored hacking, targeting governments, armed forces and infrastructure.\nNot luck, but careful preparationWith energy firms across Europe experiencing increased occurrences of cyberattacks, and ramping up their own security and system resilience testing, Shatylo said they could learn from Ukraine’s experiences.\nMontel reported earlier this month that up to 40 GW of Europe’s wind and solar power sites were vulnerable to cyberattack, amid a security flaw, and UK TSO National Grid has started removing components from its grid supplied by a Chinese state-backed company, over cybersecurity fears.\n“Cyber resilience is not luck, but the result of careful preparation,” Shatylo said.\nUkraine’s energy infrastructure includes 15 operable Russian-made reactors at four plants that normally generate about half of its electricity. The Zaporizhzhia nuclear power plant, situated close to the front lines, was the first to come under armed attack in March 2022, and its six reactors are all in cold shutdown – where the fission reaction is slowed significantly or halted completely – for safety reasons.\n“Trust no one”“The lesson that other countries should learn from Ukraine’s experience is that strengthening cybersecurity is an important foundation of resilience for businesses and the state,” the cybersecurity expert said.\n“Firstly, you need to build multi-layered security [and then] you need to provide regular updates to your system, applications, tools and technologies.”\nAt the same time, companies need to implement a “zero-trust principle”.\n“Trust no one,” Shatylo said, also citing the importance of “cyber hygiene”, or the raising of awareness among employees of the possible threats. “Most attacks begin with the human factor.”\nMontel reported in May last year that Modus X had foiled millions of cyberattacks on Ukrainian energy infrastructure since the 2022 invasion.",
        "datetime":"2025-01-29T08:24:30",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]