[
    {
        "title":"Cyberattacks most urgent threat to EU energy system – Eurelectric",
        "subtitle":"(Montel) Cyberattacks are the most urgent threat to the EU energy system, said the president of European power association Eurelectric, Leonhard Birnbaum.",
        "body":"“As systems become more digitalised, the cyber threat is increasing,” he told reporters during the Munich security conference on Friday.\nRansomware attacks on companies’ commercial systems, such as billing for example, were already common and “dangerous” but did not directly impact the physical energy systems.\nBut eventually energy companies would be “just digital and being attacked will [impact the] entire company, with no differentiation between physical and commercial”, said Birnbaum, who is also CEO of German utility Eon.\nOperations disruptedHe was also aware of cyberattacks on companies in the supply chain that could disrupt power companies’ operations but declined to give more details.\nStaying with analogue systems was not an option as the future energy world would need to be more connected and digital to manage the increasing shares of intermittent and variable renewables, said Birnbaum.\nThe EU has committed to having net-zero emissions by 2050 and has 2030 targets for increasing the share of renewables in the energy mix as well as to improve energy efficiency.\nThe current EU rules intended to improve resilience to cyber threats were too focused on reporting on preparedness, said Birnbaum.\n“Providing a report does not mean that you have practised responses,” he said and took up time from working on them.\nFinnish modelFinland’s way of managing growing energy security threats could be a model for the rest of the EU, said Finnish utility Fortum’s CEO, Markus Rauramo.\nThe country faced cyberattacks, drones, satellites being disrupted, espionage, pipelines and cables being damaged, and this was all “business as usual”, he told reporters alongside Birnbaum during the Munich security conference. \nThe Finnish energy system was still working, however, with equipment available at the target levels of more than 90%, said Rauramo, who is also vice president of Eurelectric.\nThe lessons for the rest of Europe included educating citizens on what to look out for on energy security and reporting any potential issues to the authorities.\nIt was also important to practise responses to threats, with Fortum having done this dozens of times in recent years with authorities and other countries, he said.\nThere have been several incidents of energy infrastructure in the Baltic Sea being damaged in suspected sabotage in recent years, with concerns these assets were being targeted in the wake of the Ukraine war.\nSuspected sabotageFor example, in December Finnish authorities seized the oil tanker Eagle S, suspecting the crew had deliberately dragged an anchor to damage the 650 MW Estlink 2 power cable between Estonia and Finland, which has been offline ever since. \nRauramo said the authorities had learnt from these incidents and had increased their readiness to stop ships causing such damage.",
        "datestamp":"17-02-2025",
        "category":[
            "ELECTRICITY",
            "POLICY"
        ]
    }
]