[
    {
        "title":"Dual Italy trading system fragments traders’ power liquidity",
        "subtitle":"(Montel) Italy’s landmark power market reform, which has introduced parallel hourly and quarter-hourly trading books in the intraday market, risks fragmenting liquidity, energy industry leaders told Montel.",
        "body":"As part of the market reform known as Tide, Italy introduced a dual trading system on the country’s intraday market and its cross-border intraday system on 1 January, creating two separate products – one for hourly trading and the other for quarter-hourly bids. \nThe government intends Tide to align Italy with European market standards by revamping the country’s dispatching and balancing systems and to boost grid flexibility. Power market and grid operator members of Europe’s single day-ahead market coupling (SDAC) aim to launch 15-minute market time unit products in June.\nComplicating larger tradesPreviously, hourly trading was consolidated in a single market but volumes are now divided between hourly and quarter-hourly segments, traders said. This complicated larger trades and raised the risk of price swings, one trader noted.\n“This division between the two markets creates problems in moments of reduced participation or when there’s high volatility and more uncertainty about how to move within the markets,” said Diego Pellegrino, CEO of domestic energy company Eroga Energia. \n“In this situation, having two markets doesn’t help because one is faced with having to decide in which area to take action.”\nHourly market favoured“Fragmentation is unavoidable in the current situation, and indeed the trading desks are noticing some difficulties in trades and reduced volumes,” said Gabriele Franze, Italy country manager at Inxieme Energia. “As a result, it appears that at least for now the quarterly-hour market is going to be fairly deserted.” \nMost traders “are continuing to operate in the hourly market, so it’s a strange situation given that the benefits of combining hourly with quarter-hourly bids aren’t yet materialising”, which is making “the management of the process not particularly easy,” said Edoardo Volponi, COO of Inxieme Energia. \nQuarter-hourly products may help renewable plant owners receive more accurate prices as their output levels can fluctuate greatly within a single hour, a trader said.\nThe current situation may reflect initial teething problems, Franze said, as even Europe’s XBID platform had a slow start during one of its biggest reform overhauls in September 2021 when Greece and Slovakia joined the cross-border intraday trading system.\nMarket participants said traders should monitor both segments simultaneously to find the best prices and optimise positions.",
        "datestamp":"16-01-2025",
        "category":[
            "ELECTRICITY"
        ]
    }
]