[
    {
        "title":"Dutch TSO dismisses calls to renegotiate power flows to Norway",
        "subtitle":"(Montel) Dutch TSO Tennet has dismissed calls from politicians in Norway to renegotiate deals that regulate cross-border interconnector power flows between Norway and the rest of Europe.",
        "body":"“Actual power flows are not subject to bilateral contractual agreements between TSOs,” Tennet spokesman Peter Hofland told Montel. Tennet is the co-owner of the power links from Norway to the Netherlands (700 MW) and Germany (1,400 MW).\nSeveral opposition parties in Norway, including the Centre party that left government last week, have called for renegotiations that will allow the country to reduce export capacity in periods of high prices or low hydropower reservoir levels. \nHowever, such deals were outside the scope of the TSOs, said Hofland, noting that all three countries were part of the EU’s internal energy market where flows are decided by  the day-ahead and intraday markets.\n“These projects are based on multilateral agreements between TSOs and nominated electricity market operators in Europe,” said Hofland. “The power flows on specific interconnectors are not subject to negotiated agreements between selected parties.”\nDifficult to terminateNorwegian energy minister Terje Aasland told Montel that it was very difficult to terminate the deals that determine how interconnectors operate, as they were private law agreements between the TSOs.\n“I do not have any authority to terminate these cable contracts. But I have told Statnett that they had to make adjustments to the NSL cable [to the UK] at a time when there was asymmetry in the power capacity on each side,” Aasland told Montel.\nHe referred to an incident in March 2023, when Norway’s government ordered Statnett to cut available capacity on the NSL from 1.4 GW to 1.1 GW in both directions for an indefinite period, because National Grid was unable to provide full export capacity on the cable towards Norway.\nNational Grid told Montel that the company was working closely with Statnett, as well as with the governments of the UK and Norway.",
        "datetime":"2025-02-05T09:23:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]