[
    {
        "title":"EC approves EUR 3bn French aid for EU ETS decarbonisation",
        "subtitle":"(Montel) The European Commission has approved a French state aid scheme totalling EUR 3bn designed to support the decarbonisation of the industrial sector under the EU ETS.",
        "body":"The scheme – which will consist of annual grants over a 15-year period – aims to support the French industry tackle carbon dioxide emission reductions in its production processes, with the goal to cut 60m tonnes of CO2 equivalent.\nThis is to be achieved through technologies such as “electrification, carbon capture and storage, carbon capture and use and energy efficiency measures”, the EC said in a statement late on Wednesday.\n“The commission found that the scheme is designed to ensure that the aid delivers overall CO2 reductions and that it does not merely displace the emissions from one sector to another, through requiring that all applicant projects enable a decrease in both direct and indirect emissions,” it said.\n“Incentive effect”The projects to benefit from the aid will be selected through an open competitive bidding process and will be ranked based on the “lowest aid amount requested per tonne of CO2 emissions avoided”.\nBeneficiaries will receive each year a “payment based on the actual emissions avoided”, covering the extra costs associated with implementing and operating “more environmentally friendly production processes” compared with conventional methods.\n“The scheme has an ‘incentive effect’ as the beneficiaries would not carry out the investments in decarbonisation to the same extent without the public support,” the EC said.\nIt would also have a “limited impact” on competition and trade within the EU, it added.\nFrance’s industrial sector accounted for 17% of the country’s total CO2 emissions last year – 373m tonnes excluding land use, land use change, and forestry – with transportation accounting for the largest bulk at 34%, according to government figures.",
        "datestamp":"19-12-2024",
        "category":[
            "CARBON"
        ]
    }
]