[
    {
        "title":"EC grants EUR 250m to Moldova after Russia gas cut",
        "subtitle":"(Montel) The European Commission has agreed to provide EUR 250m to Moldova this year as part of a two-year support package to help it achieve greater energy independence from Russian energy supplies, it said on Tuesday.",
        "body":"Of the total, EUR 100m would be allocated by mid-April, the EC said, adding that it aimed to help Moldovan households to tackle higher electricity costs until the end of the year.\nIn addition, EUR 50m would be made available to invest in energy efficiency and sustainability projects.\nThe EC allocated EUR 60m to tackle the ongoing energy crisis in the separatist region of Transnistrian following the cut in Russian gas supplies through Ukraine last month. This follows a EUR 30m emergency grant announced by the EC last month to help Transnistria, which also forms part of the two-year scheme. \nA total of EUR 15m would also be granted to agri-food and manufacturing businesses, the EC added. \nPower link fundingSeparately, the Moldovan government said late on Monday that the European Bank for Reconstruction and Development (EBRD) would grant the state-owned Moldelectrica EUR 15.4m to build the 400 kV Balți-Suceava power interconnector with Romania and to revamp the 400 kV Balti substation.\nThe government said the project – with a total cost of EUR 77m – would enhance energy security and increase flexibility of the power system, allowing for additional renewables buildout.\nThe Moldovan parliament previously ratified a EUR 30.8m loan agreement with the EBRD, and EUR 30.8m with the European Investment Bank.",
        "datetime":"2025-02-04T11:47:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]