[
    {
        "title":"EC gas storage rule inflates demand, stokes prices – lobby",
        "subtitle":"(Montel) Lobby group Eurogas urged the European Commission to reassess its recent gas storage regulation, warning in a statement on Saturday that rigid targets could inflate seasonal demand, reduce market efficiency and keep energy prices high.",
        "body":"To mitigate these risks, the group representing the region’s gas sector, recommended lowering overall storage filling targets and removing the number of intermediary goals to improve market flexibility, it added.\nThe regulation should also be flexibly applied to individual nations, especially those with alternative supply sources such as LNG and biomethane, while market-based mechanisms must be prioritised to avoid distorting prices, said Eurogas.\n“Demand pressure”“The existing legislation requiring storage filling target at 90% puts further demand pressure into the market.”\nIts statement came ahead of a meeting amongst member states this week to discuss the mechanism, a person familiar with the situation told Montel.\nThe current regulation requires EU gas storage to be 90% full by 1 November each year, a measure introduced after Russia’s invasion of Ukraine to safeguard energy security. However, the legislation is due to expire at the end of 2025.\nLast week, a senior official at the Italian energy ministry told Montel, Italy was supporting efforts for a “reasonable” lowering of European gas storage filling targets as current requirements might be driving up costs unnecessarily. \nCurrently inverted winter-summer spreads – with summer prices significantly above next winter’s values – amid ongoing, short-term supply concerns had created unfavourable conditions for storing gas, it added.\nThe European TTF Summer contract settled at EUR 55.01\/MWh on Friday, while the Winter 25 contract stood at EUR 50.40\/MWh on Ice Endex.\nAdditional reporting by Fatima Sadouki",
        "datetime":"2025-02-10T07:35:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]