[
    {
        "title":"EC looks to simplify carbon border tax for 80% of users",
        "subtitle":"(Montel) The European Commission is looking to make it easier to comply with the EU’s carbon border adjustment mechanism (CBAM) for around 80% of those covered, said EU climate commissioner Wopke Hoekstra.",
        "body":"“What we have found is that roughly 20% or less [of those covered by CBAM] are responsible for 97% of all the emissions,” he told the European Parliament’s tax committee on Thursday.\nHe said it would make sense to reduce the administrative burden for the remaining 80%. Such changes would have to be well designed to capture any of these who started emitting more and became part of the 20%.\nFrom 2026 companies importing products from sectors covered by CBAM will have to buy allowances equivalent to their embedded carbon emissions at prices linked to the EU emissions trading system.\nThe goal is to ensure that EU companies can compete equally with rivals from regions with less strict carbon constraints.\nThe EC plans to present its ideas for simplifying selected EU legislation, including CBAM, on 26 February, along with a clean industrial deal strategy and an affordable energy action plan.\nCBAM currently covers imports of electricity, iron and steel, aluminium, hydrogen, fertilisers and cement. \nA separate, already planned, review by the EC later this year will look at expanding CBAM’s scope to include more industrial sectors and downstream products as well as possible measures on exports.",
        "datetime":"2025-02-06T13:45:58",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]