[
    {
        "title":"EC mulls more gas market oversight to help lower prices",
        "subtitle":"(Montel) The European Commission is considering improving supervision and competition in gas markets as part of short-term efforts to “ensure the best prices for consumers”, said EU energy commissioner Dan Jorgensen on Wednesday.",
        "body":"The idea could be included in the EU affordable energy action plan, which Jorgensen is due to present on 26 February, he told a Financial Times event in Brussels, without giving more details.\nThis plan could also include ideas for instruments to incentivise decoupling retail energy bills from high fossil fuel prices and to address the non-energy components of bills, he said.\nThe long-term solution, however, to the EU’s high energy prices relative to China and the US, for example, was to further integrate the bloc’s energy markets and stay on track with decarbonising them.\n“From 2021 to 2023, EU electricity users saved around EUR 100bn thanks to newly installed solar and wind capacity,” said Jorgensen.\nConsumers already benefit by EUR 34bn\/year from the current level of integration in the EU’s wholesale electricity markets and further integration could raise this to up to EUR 40bn\/year by 2030, he said.\nMore integration“Being brave and going deeper into market integration” was one of the key messages given by lobby Energy Traders Europe CEO Mark Copley earlier in the day.\nHe noted that the EU did not integrate its subsidies, retail markets or planning.\n“If you want to be more competitive, you’ve got to find genuine efficiency savings,” he told the event. “The efficiency savings can only come from working together.”\nEurope had not yet committed to building the integrated markets needed to have competitive energy prices.\n“If you are exposed to international markets, you must look at flexible demand, interconnection, large-scale wind and possibly nuclear,” he said.\nThis was a long-term project that had to be framed around integration.",
        "datetime":"2025-02-05T15:27:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]