[
    {
        "title":"EC seeks ways to make decarbonisation profitable",
        "subtitle":"(Montel) Cost-efficiency must be the main driver of the EU’s efforts to decarbonise by 2050 so that European industry can be profitable, according to a senior European Commission official.",
        "body":"“We need to ensure that businesses that invest in decarbonisation make a profit,” Kurt Vandenberghe, the EC’s director-general for climate action, told an event organised by French utility Engie in Brussels on Monday evening.\nThe EC was starting to focus more on low-carbon “clean” rather than specifically renewable “green” energies and look more at the economics of different policy choices, he said.\n“We will probably be less prescriptive” on how the EU achieves its climate goals, he said, for example by simplifying some of the bloc’s rules.  \nThe EC would have to be more like policy entrepreneurs, willing to tolerate some risk rather than trying to engineer the perfect solution, he said.\nSupporting industryThe EC’s clean industrial deal strategy planned for launch on 26 February would focus on those sectors that know how to decarbonise but do not have an incentive to do so in Europe, said Vandenberghe, without giving more details.\n“We are working to make such projects bankable,” he said.\nThe EC has previously said it would prioritise support for strategic sectors such as steel, aluminium and clean technologies, and for links to connect large-scale green hydrogen projects to end-users.\nA “big priority” for the EC, he said, was working to develop global carbon pricing to ensure a level playing field for European companies competing with global rivals facing less strict carbon constraints.\nThe EC would also find ways to de-risk private investment in decarbonisation projects and work to ensure a stable regulatory framework – not tweaking the rules every time situations became difficult, said Vandenberghe.\nThe clean industrial deal strategy will be accompanied by an action plan on affordable energy and proposals for simplifying certain EU regulations. \nThis includes some aspects of the bloc’s carbon border adjustment mechanism (CBAM) for small market players. CBAM will require companies importing products from certain sectors from 2026 to buy allowances equivalent to their embedded carbon emissions at prices linked to the EU emissions trading system.",
        "datetime":"2025-02-04T08:13:45",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]