[
    {
        "title":"EC to protect EU interests if US introduces tariffs",
        "subtitle":"(Montel) The European Commission will react to protect European interests if the US puts tariffs on EU goods such as aluminium and steel, it said on Monday.",
        "body":"Imposing such “unjustified” tariffs would be “unlawful and economically counterproductive”, it said in a short statement giving no details on what its reaction might be. \nThe European Commission said it had not received any official notification of new US tariffs on EU goods, and that it would “not respond to broad announcements without details or written clarification.”\nUS President Donald Trump was reported on Sunday as saying he planned to announce on Monday a 25% tariff on all aluminium and steel imports into the country.\nThe EC said that “tariffs are essentially taxes” and that imposing them would increase costs for US citizens and businesses, fuelling inflation.\nThey would also increase economic uncertainty and make global markets less efficient.\nSome analysts have said a US trade war with Europe could threaten the bloc’s transition to a net-zero economy by slowing economic growth.\nOthers think it could speed up the EU’s efforts to safeguard its supply chains for strategic clean energy technologies by encouraging a “made in Europe” approach. \nLast week Trump imposed a 10% tax on Chinese imports, to which China responded with a 15% tax on imports of US coal and LNG.",
        "datetime":"2025-02-10T10:01:17",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]