[
    {
        "title":"EC warns 14 countries over failure to adopt EU energy rules",
        "subtitle":"(Montel) The European Commission has given 14 EU member states two months to take steps to adopt the bloc’s energy rules or risk facing legal action, it said on Wednesday.",
        "body":"In its latest infringement decisions package, the EC warned Belgium, Estonia, Latvia and Romania for failing to turn all of the 2018 Renewable Energy Directive (RED) into national law. The original deadline for doing so was 30 June 2021.\nThe RED sets binding renewables targets for 2030 in the power, heating and transport sectors, and includes rules on guarantees of origin. \nAdditionally, the EC urged Hungary and Poland to adopt all of the EU’s rules on creation of an integrated internal electricity market detailed in a 2019 directive. The original deadline was 31 December 2020. \n2023 updateThe EC also warned Bulgaria, Spain, France, Italy, Cyprus, the Netherlands, Slovakia and Sweden to take measures towards adopting the bloc’s rules to make permitting procedures for renewable energy projects quicker and simpler.\nThese requirements were contained in a 2023 update of the RED. \nThey include measures to impose “clear time limits for permit-granting procedures targeted to specific technologies or types of projects”, the EC said.\nThe deadline for transposing the measures detailed in the 2023 update into national law was 1 July 2024, it added.",
        "datetime":"2025-02-12T13:45:07",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]