[
    {
        "title":"EC urges affordable, market-based industrial decarbonisation",
        "subtitle":"(Montel) The EU’s push to electrify industrial sectors to cut emissions must be affordable and largely driven by the market, according to a senior European Commission official.",
        "body":"“The road for electrification goes through affordable energy,” the EC’s director for green transition, Lukasz Kolinski, told an event on future power demand hosted by think tank Bruegel in Brussels on Wednesday.\nLowering energy prices and improving industrial competitiveness are key policy priorities for the EC over the next five years. It intends to unveil an EU affordable energy action plan on 26 February, along with a clean industrial deal strategy paper.\nKolinski would not reveal what would be in these but said that different elements of power prices influence how attractive it is for industrial sectors to switch from fossil fuels to low-carbon and renewable electricity.\nTaking the “right action” on taxes and grid charges in prices, for example, could carry the EU a “long way” towards market-based electrification, he said.\nThe EC saw electrification as the first option for decarbonising industry, and it was “not good” that the share of electricity in the EU’s final energy demand has been stagnant for years, said Kolinski.\nThis share has remained at 23% overall and around 33% in industry for almost the past decade, according to power lobby Eurelectric. It cited the reasons as including high upfront costs, long investment cycles, increased energy costs, unfair taxation and fossil fuel subsidies, in a paper released yesterday calling for an EU electrification bank.\nNegative price hoursAnother key issue was how flexible existing and future demand will be to balance markets with increasing shares of renewables, said Kolinski.\nThe EU saw a record number of negative price hours last year, and he said he expected this year to be the same.\nFrench utility EDF approved of new supply being slightly ahead of demand, but it would be a problem if it was too far ahead, its director of EU affairs, Marion Labatut, told the event.\n“If we keep adding generation that produces in the middle of the day, then we need to find demand or storage to take that, or next year we will get even more negative price hours,” she said.\n“Political consequences”The key challenge was synchronising new clean power generation with grid connections and upgrades, as well as new demand, said Kolinski.\nIf supply was too far behind new demand, it caused price spikes and they had “immediate political consequences”, he said.\nThe EU agreed on new electricity market design rules last year intended to make integrating large shares of renewables more efficient and to increase flexibility in demand. The focus now was on national governments implementing the rules, he said.",
        "datetime":"2025-02-13T10:28:01",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]