[
    {
        "title":"EDF set to halve 2025 new nuclear investment amid uncertainty",
        "subtitle":"(Montel) French utility EDF is almost halving next year’s investments in preparation work to build six nuclear reactors to EUR 1.1bn amid uncertainty for the sector, a source close to the matter told Montel late on Wednesday.",
        "body":"The state-owned company is waiting for financial support from the government to raise the billions of euros needed to build a nuclear programme that includes six new generation European pressurised reactors (EPR2s) in France.\nLast month, the official body responsible for a financing decision regarding the six reactors postponed approval from December until early next year amid political uncertainty and the collapse of the caretaker government earlier this month.\nHowever, the budget cut from the planned EUR 2bn for 2025 would not impact the programme schedule, the source added. “It just means investing less in 2025 and perhaps more afterwards.”\n“It’s more a question of redefining the speed to enable us to make progress on both the basic design [of the EPR2] and everything to do with compliance,” the source said, adding that engineering teams could not keep up with the current pace.\nCostsEarlier this year, EDF CEO Luc Remont said EDF’s expenditure on the EPR2 programme would reach EUR 3bn by the end of this year, with EUR 2bn already spent on the programme.\nEDF is due to submit an updated estimate of the cost of the work to the government by February, the source said. The latest estimate, excluding financing costs, is EUR 67.4bn.\nThe utility aims to build six and possibly 14 new reactors by 2050, with construction due to start at the Penly nuclear power plant on the Channel coast by 2027. \nHowever, its Flamanville EPR – due to launch on Friday, 12 years behind schedule – cost more than EUR 13bn.",
        "datestamp":"19-12-2024",
        "category":[
            "NUCLEAR",
            "POLICY"
        ]
    }
]