[
    {
        "title":"EDF mulls auctions for long-term 10 TWh nuclear supply deals",
        "subtitle":"(Montel) French utility EDF plans to start auctions in 2025 to sell up to 10 TWh per year of nuclear power to energy-intensive industry and rival suppliers – aiming for this to break the negotiation deadlock, sources told Montel.",
        "body":"The state-owned utility reached an agreement in November 2023 with the government to sell its nuclear output at an average of EUR 70\/MWh (in 2022 prices) over the period 2026-2040 to replace the Arenh system of EUR 42\/MWh for up to 100 TWh\/year, which expires in 2026.\nHowever, since the presentation of the deal, no long-term nuclear power supply contracts, called CAPNs, have been signed and negotiations are far from concluding, said lobbyists and others participating in the talks.\nOnly six letters of intent have been signed for a volume of 11 TWh\/year, EDF said.\nIndustrialists have urged EDF to lower the negotiated selling price as power prices have dropped but EDF said it needs prices to be high enough to finance its future fleet of at least six nuclear reactors (10 GW).\n“It’s true that we have letters of intent but no one knows their content and the strike price,” a source said, although industrial sources said discussions remained centred around EUR 70\/MWh.\n“The idea with the auctions is to be more transparent for the market on what would be the right price.”\nIf the auctions go ahead, they would start in the second half of 2025, he said.\nUncertaintiesEDF’s new plan would not alter the agreement with the government but simply change the commercial strategy, a second source close to the matter said.\nHowever, some aspects of the auction mechanism still need “to be worked on”, the first source said.\nHe said it was not yet clear whether the auctioned 10 TWh per year would be on top or subtracted from the 20-24 TWh per year offered under CAPN contracts.\nAn industrial energy buyer in talks with EDF feared auctions would have “a bullish effect” on the price of long-term nuclear supply contracts.\nA spokeswoman at EDF declined to comment but added that its priority remained long-term nuclear supply contracts with industry.",
        "datestamp":"19-12-2024",
        "category":[
            "NUCLEAR"
        ]
    }
]