[
    {
        "title":"EIB guarantees key in de-risking PPAs – lobby",
        "subtitle":"(Montel) European Investment Bank (EIB) guarantees have a key role in de-risking the long-term power purchasing agreements (PPAs) needed to ensure reliable supply to industrial offtakers as they decarbonise their processes, Eurelectric said on Wednesday.",
        "body":"“Adequate guarantee schemes can reduce the market barriers which prevent industrial consumers from signing PPAs, while ensuring effective price signals remain on the electricity market,” the power lobby said in a paper calling for an EU electrification bank.\nIt called on the EIB to give budget guarantees to underpin PPAs with industrial users, and to help national governments take similar measures.\nThe EIB is talking to the European Commission about a product designed to de-risk PPAs by protecting against credit default by offtakers, EIB principal energy economist Manuel Baritaud said last month, without giving further details.\nThe EC sees PPAs as one way to protect industrial consumers from the recent power price volatility driven by price-setting gas-fired power plants, while also giving renewable developers stable long-term cash flows that help new projects secure private capital financing.  \nElectrification bankEurelectric called for the EU to set up an electrification bank as a one-stop shop to help industry decarbonise, as the bloc pursues its goal of having a net-zero economy by 2050.\nThis should be “a central pillar” of the EU electrification action plan the EC intends to unveil early next year.\nThe aim of such a “bank” would be to bring existing and new EU and national funding opportunities to help industry switch from using fossil fuels to clean electricity together under a single, simplified access process managed by the EC.  \nProjects applying for support to decarbonise via electrification could commit to signing a PPA for part of their power supply, said Eurelectric.\nApplications from the entire European Economic Area – which includes Norway – should be eligible to avoid distorting the internal power market.\nEurelectric called for the EIB to be closely involved with the EC in vetting and monitoring such projects, and in designing funding and de-risking instruments. This could include equity investments or loans, as well as budget guarantees.\nETS revenuesThe EU’s emissions trading system (ETS) could be an important funding source to help industry decarbonise, said Eurelectric.\nIt called for “a significant portion” of the revenues national governments receive directly from auctioning EU ETS allowances to be used for this. In 2023, these revenues totalled EUR 33bn.",
        "datetime":"2025-02-12T11:54:24",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]