[
    {
        "title":"Engie dismisses Belgian plan to extend 2 GW reactor lifetimes",
        "subtitle":"(Montel) French utility Engie has no plans to extend the running lives of its Doel 4 (1 GW) and Tihange 3 (1 GW) reactors in Belgium by another 10 years to 2045 despite a government plan to do so, it said on Monday.",
        "body":"Such a move was “not currently under consideration”, an Engie Belgium spokesman told Montel.\nHis comments came after Belgium’s new coalition government unveiled its political programme at the weekend, including plans to extend the lives of the two reactors until at least 2045 to “guarantee [power] capacity basis without carbon”.\nThe government said in a statement it would take “all the necessary measures” to prolong the lives of all five of Belgium’s existing reactors, “which meet the safety standards”.\nIt said it would also build new reactors if necessary to maintain Belgian’s atomic capacity at 4 GW and repeal a 2003 law on phasing out nuclear power, without providing further details.\n“Unfeasible”However, it was “not part of Engie’s strategy” to extend its Tihange 1 (962 MW), Doel 1 and 2 (445 MW each) reactors, which are scheduled to close this year, the Engie spokesman added.\nIt was “unfeasible” as these units date from the 1970s and would need “excessive investments” to align with the latest safety requirements, he added.\nIn late 2023, Engie and the Belgian state agreed to extend the lifetimes of Doel 4 and Tihange 3 by 10 years until 2035.\nLast week, Belgian TSO Elia said it was shelving plans for a 1.4 GW offshore wind farm and a 1.4 GW power link with the UK for at least three years due to rising costs.",
        "datetime":"2025-02-03T12:53:25",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]