[
    {
        "title":"Entso-E set to recommend new power zones in Sweden – analysts",
        "subtitle":"(Montel) A power bidding zone review by European TSO association Entso-E due to be published later this month is likely to suggest changes to the current configuration in Sweden, market analysts have told Montel.",
        "body":"Some analysts expect the review to recommend that the SE3 bidding zone, which contains all of the country’s nuclear plants as well as major cities Stockholm and Gothenburg, be separated into eastern and western parts, with a smaller zone around the capital Stockholm that could see higher prices than the rest of Sweden.\nThe southern SE4 zone, which shares interconnectors with Germany, Lithuania and eastern Denmark, would then be incorporated into the western SE3 zone that borders Norway and western Denmark.\nSuch a proposal would be in line with previous suggestions by Swedish TSO Svenska Kraftnat and EU regulatory agency Acer.\n“We foresee a recommendation that proposes a merger between eastern SE3 and SE4, while SE1 and SE2 [in northern Sweden] will remain unchanged,” said John Stranne, senior analyst at Aurora Energy Research.\n“Outdated” configurationSweden was divided into four bidding zones in 2011 amid pressure from the EU, but Stranne said that much has changed since, making the current configuration “outdated”.\nThis leads to “significant grid constraints, especially between SE2-SE3 and SE3-SE4 and internally within SE3,” he said.\nJohan Bruce, CEO of industrial power user association SKGS, also believed a split of SE3 zone was the most likely change, although he said a lack of transparency in the process made it hard to predict what the recommendations would be.\nThe European bidding zone review has been ongoing for several years, and may also suggest splitting Germany into several bidding zones, something Sweden has officially called for. \nHowever, German energy regulator BNA said on Monday that it opposed any split in Germany, and did not expect it to happen.",
        "datestamp":"15-01-2025",
        "category":[
            "ELECTRICITY"
        ]
    }
]