[
    {
        "title":"Equinor threatens to shut LNG plant in 2030s amid political row",
        "subtitle":"(Montel) Equinor may have to close its LNG plant at Hammerfest, northern Norway, in the early 2030s if Parliament decides to retract its licence to use electricity from the onshore grid.",
        "body":"“Our conclusion is that carbon capture and storage [CCS] is not economically viable. If we have to bear the cost of such an effort, it will be very difficult considering the potential income from the facility,” Trond Bokn, senior vice-president responsible for project development at Equinor, told Norwegian news site E24.\nHammerfest LNG receives and processes gas from the Snohvit field in the Barents Sea. It delivers around 6.5bcm a year and is the only large-scale LNG plant in Europe.\nIn 2023 the Norwegian government permitted Equinor to replace its current power supply from gas turbines with electricity from the grid. This would reduce yearly CO2 emissions by around 850,000 tonnes, and require 3.6 TWh of power from the grid.\nObjectionsHowever, several opposition parties in Parliament, including the Centre party that left government last week, want to retract the 2023 decision and instead instruct Equinor to cut emissions through CCS from the existing gas-fired plant.\nThey fear electrification will create a local power shortage in Norway’s northern NO4 bidding zone and a potential surge in power prices.\nBokn said Equinor had estimated the cost of building a CCS facility at NOK 40-45bn (3.5bn-3.9bn), and that the company could not guarantee operations post 2030 if they are ordered to build a CCS site.\nNorwegian prime minister, Jonas Gahr Store of the Labour party, rejected the idea of retracting Equinor’s licence earlier this week.",
        "datetime":"2025-02-06T14:44:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]