[
    {
        "title":"Estonia confident of smooth split from Russian grid tomorrow",
        "subtitle":"(Montel) Baltic countries Estonia, Latvia and Lithuania are well-prepared for a smooth desynchronisation from the Russian power grid on Saturday, the CEO of Estonian TSO Elering told Montel.",
        "body":"“This project has been prepared by a lot of very smart engineers across the Baltic region and in central European countries. All kind of scenarios has been worked through, and we don’t see any unexpected things to happen,” said Kalle Kilk.\nThe three former Soviet countries stopped trading electricity with Russia in 2022 but still rely on balancing services from the Russian grid. Tomorrow they will switch off their connections to the Russian and Belarusian power grids and take responsibility for balancing supply and demand on their own.\nThen on Sunday, they will integrate with the wider continental European market through Poland as part of a EUR 1.6bn project that has been largely financed by the EU.\nPoland’s TSO PSE strengthened security measures for the Poland-Lithuania 4 GW link ahead of the weekend, it said earlier this week.\nKilk said the transition should not affect market prices, since the Baltic countries have not been trading electricity with Russia, but that it will impact the balancing of the system to keep the grid frequency stable.\nThe three countries’ TSOs launched a joint balancing market earlier this week to them keep stable grid frequency following the desynchronisation.\nIncreased tensionsThe split has been in the planning for two decades, but the execution comes at a time of heightened political tension in the region, caused by alleged Russian-backed sabotage of key energy and telecoms cables in the Baltic Sea.\nKilk did not rule out a link between recent damage to infrastructure and the desynchronisation, but said it showed the Baltic states had been right to prepare a disconnection from their eastern neighbour.\n“Many eastern European grids started to connect towards western systems already in the 1990s, and in the early 2000s we also saw it as strategically wise to move towards connecting ourselves to the western European grid,” he said.\n“The unfortunate thing is that we are geographically situated in a place where it’s not so easy to technically finalise this project. And this is the reason why it has taken quite a few years.”\nFor Montel News' video report on this issue please click here.",
        "datetime":"2025-02-07T13:19:33",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]