[
    {
        "title":"EU can cope with new US sanctions on Russian LNG – analysts",
        "subtitle":"(Montel) Fresh US sanctions on two small Russian LNG facilities would only have a small impact on European gas supply but raise some risks, analysts said on Monday.",
        "body":"The US Treasury Department late on Friday announced sanctions against Gazprom’s Portovaya LNG and Novatek’s Vysotsk LNG – which in 2024 exported 3.1bcm of LNG in total, almost all of it delivered to Europe and Turkey.\nSome LNG vessels were also sanctioned, although larger LNG facilities were spared, such as the Yamal LNG, with 23.7bcm\/year capacity and Sakhalin II LNG terminal, with 14.2bcm\/year capacity.\n“While the LNG sanctions don’t impact European markets for now, it’s a change in risk for Europe as now active LNG projects are being targeted,” said Florence Schmit, energy strategist at Rabobank.\nHowever, she said global supply could tighten if other facilities were a target in the future.\nTargeting the relatively small Russian LNG facilities appeared to be a “middle ground” and to not threaten European and Japanese supplies, said Anne-Sophie Corbeau, global research scholar at the Centre on Global Energy Policy at Columbia University.\n“No more Yamal LNG would have significant impact on gas prices, while the Japanese would be very upset about Sakhalin,” she said.\nAwaiting TrumpEuropean gas storage has declined in recent weeks amid a cold spell. EU gas storage was last seen at 66% full, almost 14 percentage points lower year on year, Gas Infrastructure Europe data showed.\nRussia earns billions every year from its LNG exports, which hit a historic record of 46bcm in 2024, according to Kpler data.\nThe EU already prohibits the import of coal and seaborne crude oil and refined oil products from Russia in retaliation for its war on Ukraine. However, Brussels has stopped short of imposing direct sanctions on natural gas and LNG imports from Russia due to the bloc’s reliance on the fuel.\nAnalysts are now awaiting what the US president-elect, Donald Trump, will do next.\nUS sanctions have so far partially disrupted LNG operations of Arctic LNG 2, a new LNG facility that will likely remain idled until next summer after failing to deliver a single cargo last year.\nAnalysts reckon that Trump could tighten the LNG noose on Russia to force Europe to buy more US LNG or he could use sanctions relief as a bargaining chip in any peace negotiations between Russia and Ukraine.\nThe fresh LNG sanctions are “a very shrewd move” by the outgoing Biden administration, said Tom Marzec-Manser, an independent gas analyst.\n“A decisive act, which Trump may have been planning himself to look strong [but] now a card Trump can’t play himself. And if Trump repeals early, will he not look soft on Russia?”\nNevertheless, Marzec-Manser said Trump could still use the new sanctions “in the bargaining in a war-end scenario – more taps that can be opened in return for peace, sort of thing”.\nTrump is also under pressure from US LNG producers to sanction existing Russian LNG output to increase their share of the global market, analyst say.\n“The only way Europe will buy more US gas in the short term is if sanctions on Russian LNG actually become tighter, so I think Trump might not as be as quick as to just rework some of these sanctions,” said Schmit.",
        "datestamp":"14-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]