[
    {
        "title":"EU could fund net zero with CO2 allowance sales – study",
        "subtitle":"(Montel) The EU should fund the net-zero transition by introducing new European climate bonds funded by expanding the EU ETS carbon allowance scheme, a new study by a US think tank has recommended.",
        "body":"Current EU tax revenues fall short of covering necessary investment in the transition, which could leave the bloc relying on loans or increased contributions from member states, said the study released by the Centre for Economic Policy Research (CEPR) through its VoxEU policy portal on Monday.\nThe EU’s climate investment needs range between EUR 550-912bn annually, mainly covering damage mitigation but investment in adaptation to climate change remained “largely neglected and imprecisely estimated”, the study said.\nCommon fiscal policy?Although the EU plans to use programmes like its European Green Deal and NextGenerationEU for funding, the resources budgeted by the EU and member states only cover less than half of the required investment, it added.\nHowever, the EU could instead set up a new funding scheme using the expanded sale of EU ETS allowances, it said, adding that this would create the “first form of EU common fiscal capacity”.\nGermany and the Netherlands have in recent years objected to the idea of a common fiscal capacity policy, fearing their economies would be disproportionately saddled with liabilities.\nClimate bonds – also known as green bonds – are loans issued specifically to finance green projects. Such bonds are usually issued by governments and international agencies, such as the European Bank of Reconstruction and Development.\nThe climate bonds CEPR recommends would differ from other bonds as they would be funded by the EU ETS. It recommended that access to the funds should depend on EU members implementing climate projects.\nNot at members’ mercyThe study recommended that EU ETS-funded climate bonds be managed by a European agency. It pointed to the European Commission and the European Stability Mechanism (ESM) as “potential candidates for this role”.\n“The proposed EU carbon pricing scheme is based on the extension of the [EU ETS] to all sectors and the sale of carbon emission allowances traded on the ETS,” said the study.\n“Compared to a system of national carbon taxes, this scheme would not be at the mercy of member states’ choices regarding the carbon tax rates and their transfers of the resulting tax revenue to the commission.”\nIt said these climate bonds would meet the EU’s demand for a safe, liquid and green asset to accelerate climate investment and increase EU resilience to potential crises.",
        "datetime":"2025-01-28T10:35:15",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]