[
    {
        "title":"EU faces struggle to hit 90% gas storage target – analysts",
        "subtitle":"(Montel) The EU faces an uphill battle to meet its gas storage target of 90% by 1 November amid tighter supply, increased LNG competition and dwindling inventories, analysts told Montel this week.",
        "body":"Some analysts predicted the bloc’s gas storage would reach only 70-80% by November, while others believed the 90% target is achievable, but at higher costs.\nLower end-of-winter storage levels, reduced pipeline flows – especially from the halt of 15bcm\/year Russian transit through Ukraine since 1 January – and rising global LNG demand could further strain Europe’s gas reserves, they warned.\nUnder mild winter conditions, EU gas storage levels could reach at least 78% by the end of September, allowing for further injections until 1 November, said Marina Tsygankova, director global gas and LNG research at LSEG.\nAsian competitionHowever, filling to 90% would be challenging amid competition with Asia, she said.\n“We’ll probably be starting from a lower storage base compared to last year,” a UK gas analyst said. “At the same time, we are facing a supply gap due to reduced Russian flows, while demand is increasing in key global markets such as China, India and Pakistan.”\nHe predicted storage to only reach 70% by 1 November, adding that he believed many market participants agreed that a 70-75% level was most likely.\n“The starting point when looking at storage balance is demand,” said Matteo Mazzoni, director of energy analytics at Icis, adding that he expected gas consumption throughout Europe to grow this year by 3% on the year, with the increase largely driven by the cold.\nGas reserves in central west Europe could end the winter season at just 37% by 31 March, down 21 percentage points year on year, he said, adding, however, that last winter was exceptionally mild and should not be considered a reference year.\nNot enough LNGHe forecast the EU’s LNG demand to rise by 13% on the year to 110m tonnes in 2025 amid lower pipeline flows.\nWhile LNG has helped fill the gap left by reduced Russian pipeline flows, competition for cargoes is intensifying, the UK analyst added.\n“Will there be enough LNG to supply all countries globally? Probably not,” Mazzoni said, adding that the EU would still be able to meet the 90% storage target by November. “The question, however, is at what price?”\nIn addition, gas for delivery this summer has been trading above the winter contract, making buying gas for storage uneconomic.\nLobby group Eurogas at the weekend urged the European Commission to reassess its gas storage regulation. \nStorage could fall below 40% by the end of March at current withdrawal levels, said Gergely Molnar, gas analyst at the International Energy Agency, on LinkedIn yesterday.",
        "datetime":"2025-02-11T10:06:11",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]