[
    {
        "title":"EU gas market to remain tight amid loss of supply, coal exit – Axpo",
        "subtitle":"(Montel) European gas supply is likely to remain tight this year as the region has reduced flexibility to balance the market with the loss of Russian supplies and an ongoing exit from coal generation, a senior manager at Axpo told Montel at the E-World energy fair in Essen.",
        "body":"“Europe lost a lot of flexibility in the last years,” said Marco Saalfrank, head of continental Europe merchant trading at Switzerland’s biggest utility, on Wednesday.\nHe highlighted the loss of Russian gas deliveries in the wake of the country’s invasion of Ukraine and the end of gas exploration at the Dutch Groningen field, Europe’s largest onshore facility.\nThe ongoing exit from coal-fired capacity due to the region’s green transition was also a factor, with gas-fired generation becoming more crucial in providing secure supply at times of low renewables output.\n“And this is the reason why we expect that the gas market will remain tight for this whole year,” Saalfrank said.\nEurope increased LNG imports in recent years to make up for lost pipeline gas supply but faces competition from other regions around the globe.\nStorage pressureSome pressure on the market could be alleviated by lowering European gas storage obligations, which currently require tanks to be filled to 90% capacity by 1 November, said the Axpo executive.\nThe current European level of 47% is well below the 67% seen at this point last year.\nA new plan by Germany’s THE gas market operator to top up rapidly depleting storage facilities via auctions has drawn criticism from market participants, on the basis that the expectation of an intervention would deter players from storing gas in the current price environment.\n“This is the main reason why we observe a negative winter\/summer spread,” Saalfrank said.\nThe THE summer contract last stood at EUR 56.27\/MWh, while the winter contract traded at EUR 53.67\/MWh on the EEX.\nChange in prospect?Italy has recently pushed for a lower gas storage target and the removal of intermediary targets to reduce pressure on the market and ease near-term prices.\nHowever, Saalfrank did not expect major alterations to the current set up, with the EU having brought in the targets to secure supply in the wake of the Ukraine war and the curtailment of Russian flows.\n“Clearly the EU Commission has an interest to achieve the defined storage targets at the beginning of the next winter. We do not expect a major change.”",
        "datetime":"2025-02-13T06:37:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]