[
    {
        "title":"EU in talks with Norway over energy markets",
        "subtitle":"(Montel) The EU is prioritising staying in regular contact with Norway on energy issues, and will not comment on domestic political matters, according to the European Commission press office.",
        "body":"Last week, Norway’s prime minister, Jonas Gahr Store, said his Labour party would not implement changes to the EU’s power market rules that the bloc agreed in 2019 until 2029, if Labour remained in power.\nNorway is not a member of the EU but is required to implement EU legislation that has been incorporated into the European Economic Area free-trade agreement. This covers the 27 EU countries and three European Free Trade Association (Efta) countries: Iceland, Liechtenstein and Norway.\nThe changes to power market rules were part of the EU’s so-called clean energy package, which set out measures and policies to help the bloc cut its greenhouse gas emissions by at least 40% from 1990 levels by 2030.\nThese included increasing the share of renewables and improving energy efficiency.\nThis package has not been incorporated yet into the EEA agreement and is still being debated in Norway. There are no specific deadlines for completing this process.\nIt involves the three Efta countries agreeing on their versions of EU legislation relevant to the EEA agreement and then sending it to the EC to be analysed. If there are substantial changes the Efta versions must be approved by the EU Council of ministers. If not, the EC approves it.\nAfter that the legislation is incorporated into the EEA agreement and the three Efta countries are required to implement it.\n“Let’s let the Norwegian politicians complete their discussion,” the EC’s press office said on Friday. “We do expect all EEA countries to implement legislation as has been agreed.”\nStore said that it would not be in Norway’s interest to reject the whole package as that could potentially damage the EEA agreement.\nPower market changesThe package included changes to power market rules intended to help integrate larger shares of renewables and boost flexibility. These included requiring grid operators to report on their redispatching actions and follow regulators' recommendations to avoid curtailing renewables. \nIt also required grid operators to offer at least 70% of cross-zonal capacity for trading by the end of 2025 at the latest.  \nThe package also included more powers for EU energy regulatory agency Acer, and new EU rules to improve risk preparedness for potential electricity crises.\nThe EU updated most of this legislation in 2023 after it increased its 2030 target to cut emissions to at least 55% below 1990 levels. The updates also reflected its new goal to wean itself of Russian energy imports by 2027, after Russia invaded Ukraine in 2022.",
        "datetime":"2025-02-03T14:19:05",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]