[
    {
        "title":"EU LNG price hits 2-year high on cold spell, tariff spat",
        "subtitle":"(Montel) Northwest Europe’s front-month LNG price closed at a two-year high on Thursday on colder forecasts and falling stocks, while Chinese competition for the liquid fuel emerged in Asia amid the tariff spat with the US.",
        "body":"The landing price for LNG delivered ex-ship to northwest Europe in March gained USD 0.22 to settle at USD 16.01\/MMbtu (EUR 52.73\/MWh), its highest since 2 February 2023, according to Spark Commodities data.\nThat is 20% higher than the year-to-date low reached on 10 January, but prices have been on an upward trend for around a year.\nEuropean LNG prices track the continent’s benchmark front-month TTF gas contract, which also closed at a two-year high yesterday of EUR 54.50\/MWh (USD 16.55\/MMbtu), amid colder forecasts and falling storage, participants said.\n“European gas prices rose as the uncertain supply outlook meets with a looming cold snap expected in the northwest in coming days that will lift heating demand and draw on fuel stockpiles,” said a note from analysts at Australian bank ANZ.\nCompetition for supplySpot competition is also emerging in Asia, despite low demand, especially as Chinese buyers seek to replace US LNG cargoes, which had a 15% import tax attached to them this week.\n“The 15% tariff that China placed on US LNG imports has prompted Chinese buyers to enquire about selling US shipments. Those same buyers are also looking at how they can replace those LNG cargoes from other parts of Asia,” wrote ANZ.\nColder weather forecasts in Asia are also driving up spot demand, while there are ongoing small disruptions to supply, participants said.\nEuropean buyers will also have to compete with Egypt, which is seeking more LNG this year on top of recent supply deals with Shell and TotalEnergies, said ANZ.\nMeanwhile, Asia’s LNG price for March in the JKM was last seen up USD 0.09 to almost USD 14.52\/MMbtu, its highest in almost two months.\nAs such, the TTF premium on the JKM equivalent for March remains at around USD 2, easily allowing Europe to attract available spot LNG.",
        "datetime":"2025-02-07T09:17:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]