[
    {
        "title":"EU mulls temporary gas price cap for competitiveness – report",
        "subtitle":"(Montel) Brussels is weighing new powers to temporarily cap EU gas prices, which hit two-year highs this week, to protect business competitiveness against the US, where prices are lower, the Financial Times reported on Wednesday.",
        "body":"The European Commission is considering a cap as part of discussions about its clean industrial deal policy document to be presented later this month, said three people with knowledge of the talks, according to the UK business daily.\nThe strategy paper is expected to outline ways to shore up the EU’s heavy industries as businesses grapple with multiple challenges including US president Donald Trump’s aggressive trade measures and the EU’s ambitious green targets.\nEurope’s benchmark front-month gas contract on the Dutch TTF hub on Tuesday hit its highest point since 3 February 2023 at EUR 59.39\/MWh and was last seen at EUR 56.30\/MWh.\nHowever, talks around mechanisms to cap prices, though still at an early stage, have drawn a backlash from industry groups that warned against damaging “trust” in the European market.\nThe FT said it had seen a letter sent to EC president Ursula von der Leyen yesterday from 11 groups including Europex, the association of European energy exchanges, and AFME, the financial markets lobby group.\nThe letter said: “We believe this measure, if announced, could have far-reaching negative consequences for the stability of European energy markets and the security of supply across the continent.”\n“Harm the trust”A gas price cap would “harm the trust” in Europe’s benchmark TTF gas hub, the letter said. It would also “prompt the global gas community to shift towards other, unrestrained and therefore more representative reference prices, which are primarily located outside of the EU”.\nLast month, the EC said it would not propose extending a gas price cap mechanism introduced in 2022 and which expired on 31 January.\nThe EC declined to comment to the FT.\nIt comes after Italian energy minister Gilberto Pichetto Fratin said last week the country had asked the EC to cap gas prices on European markets.",
        "datetime":"2025-02-12T07:11:16",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]