[
    {
        "title":"EU must revamp capacity markets to keep lights on – Polish TSO",
        "subtitle":"(Montel) The EU should remodel existing capacity market mechanisms to spur investment in dispatchable baseload power generation, amid the bloc’s growing reliance on intermittent renewable capacity, the head of Poland’s TSO, PSE, told Montel.",
        "body":"“Poland is in talks about a new market design with the European Commission,” Grzegorz Onichimowski said in an interview.\nCurrent capacity market schemes need remodelling across the bloc, as they have failed to trigger sufficient investment in dispatchable power plants, which can be brought online to cover short-term supply shortages, he said.\nCapacity as commodityThe EU should allow the creation of a marketplace whereby dispatchable plants could sell their capacity not only to system operators, but also directly to heavy power consumers, such as data centres and steel mills, said Onichimowski.\nUnlike the current system, this new capacity marketplace would not rely on the time-limited EC approvals for state aid, thus would be a stable and permanent solution, he said.\nOnichimowski said capacity should be considered as a commodity, like power or gas, as there is demand from other parties, not only system operators.\n“Data centres and factories need baseload power in the long term and systems dominated by renewables will not deliver if we do not build enough dispatchable plants,” he said.\nFocus on PolandRegarding Poland specifically, the country must ramp up its gas-fired power capacity by at least 18 GW by 2040 to support a renewables-dominated system, according to the TSO’s estimates.\nIt faces a surge in peak demand from 29 GW at present to more than 40 GW by 2034 from data centres, electric heating, electric vehicles and the decarbonisation of the industrial sector, but its ageing 24 GW coal-fired fleet will have largely been decommissioned by then.\nAs such, the TSO head also urged the introduction of different rules for power plants located abroad that provide Polish system back-up.\n“If we call on a power plant abroad to export electricity to the Polish system, it won’t happen when Polish prices are lower than [theirs], as market coupling algorithm won’t allow it,” he said.\n“Major flaw”“It’s a major flaw that should be fixed by creating a rule that such emergency exports are excluded from market coupling.”\nAdditionally, Poland cannot match German prices, when there is low renewables output simultaneously in both countries, Onichimowski said.\nIn such incidences, the market coupling mechanism would direct output from, for example, Czech plants – which have been booked as a Polish system reserve – to Germany instead, he said.\nA fifth of the 8 GW of back-up power capacity booked by Poland in the latest system reserve auction is in Sweden, the Czech Republic and Slovakia.\nOnichimowski said Poland was in talks with the Czech Republic on extending its high-voltage direct current (HDVC) cable, planned to come online in 2032, to its southern neighbour.\nThe link, set to send nuclear and offshore wind power, would need to be excluded from the market allocation mechanism to avoid electricity diversion to more expensive markets, he said.",
        "datestamp":"22-01-2025",
        "category":[
            "BATTERIES\/STORAGE",
            "ELECTRICITY"
        ]
    }
]