[
    {
        "title":"EU power market dysfunctional – Norway finance minister",
        "subtitle":"(Montel) Norway should reject further integration with the “dysfunctional” European electricity market, finance minister Trygve Slagsvold Vedum said on Monday, while not ruling out a government collapse over the issue.",
        "body":"“Everyone who has followed the Norwegian power price debate in recent years has seen how dysfunctional the Norwegian power market has become when we integrated with the EU power market,” Vedum, who is also Centre party leader, told media representatives.\nHe added, after a meeting of the Centre party’s leadership, that new power links to the UK and Germany had inflated local power prices.\nThe Centre party discussed how it should handle the current crisis affecting Norway’s centre-left government, where prime minister and Labour leader Jonas Gahr Store have insisted on implementing three of the eight directives in the EU’s clean energy package from 2019, despite strong resistance from his coalition partner.\nMarginal impact?Analysts generally agree that these directives – the renewables directive, energy efficiency directive and buildings directive – will only have a marginal impact on power prices in Norway.\nBut Vedum said it was important to stop any transfer of Norwegian power over energy policy from Oslo to Brussels.\n“Our basic position is that giving more power to the EU is wrong,” said Vedum, adding he aimed to maintain national control over energy policies to facilitate low and competitive prices for Norwegian consumers.\nHe did not rule out the possibility of a government collapse if the Centre party’s coalition partner Labour insisted on implementing the directives.\n“We will now see if we can find solutions that both parties can support,” he said.\nThe prime minister told local media on Friday that the government needed to implement the directives to create stability for Norwegian businesses and maintain good relations with the EU at a time of increased political uncertainty.\nNorway is not member of the bloc but is part of the internal EU energy market through a free trade agreement.",
        "datetime":"2025-01-27T16:47:36",
        "category":[

        ]
    }
]