[
    {
        "title":"EU power demand won’t reach pre-war levels until 2027 – IEA",
        "subtitle":"(Montel) EU power demand is set to grow annually by just 1.7% on average over the next three years, only returning to pre-2022 levels by 2027 at the earliest, the International Energy Agency (IEA) said on Friday.",
        "body":"The bloc’s power demand was forecast to grow from 2,613 TWh last year to 2,752 TWh in 2027, it added in its Electricity 2025 report.\nRenewables were expected to “more than cover additional electricity demand”, with green power capacity likely rising annually by 7.2% on average, albeit at a “slightly lower” rate than in 2024 when it grew 8.4%.\nIn Germany, Europe’s largest power market, the agency saw demand rising by 1.2% annually until 2027, with the rise being met in full by renewables.\nGerman green transitionThe country’s solar and wind power output would see 20% and 9% growth rates, respectively, over the period, which would “more than offset” declines of 16% in coal-fired output and 8% in gas-fired generation.\nLast year, German solar capacity “surged” by 17 GW to 99 GW, while onshore wind saw a more muted 3 GW growth to 63 GW.\nMeanwhile, French wind and solar output were equally expected to see strong growth over the next three years, with their combined share of total power supply rising from 15% in 2023 to 20% by 2027.\nWind was set to surpass hydropower as “the [nation’s] single largest source of renewable electricity” in three years’ time.\nLast year, the country’s hydropower plants produced 74.7 TWh, while wind assets generated 50.9 TWh, TSO data showed.\nFrench export growthFrance’s “strong net export trend [was] set to continue in the short term as nuclear recovery continues”, the IEA said, amid total power output continuing to grow at around 1% annually and demand recovering “at moderately higher rates”.\nLast year, the country’s net exports hit a record high 89 TWh.\nPower demand was also seen rising in smaller markets, by 1.9% annually on average in Spain, 1.1% in Poland, 3.5% in Denmark and 3.3% in Ireland.\nIn Italy, meanwhile, the phase-out of coal was “on track” to be completed by 2028 as key interconnections between the mainland and Sardinia are expected to be brought online, the IEA said.\nEurope’s power demand has been dented in the wake of the Ukraine war due to surging energy prices, which have been followed by an economic slowdown.",
        "datetime":"2025-02-14T06:00:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]