[
    {
        "title":"EU still dependent on Russian nuclear fuel – expert",
        "subtitle":"(Montel) Around 20% of the EU’s nuclear reactors remain dependent on Russia for their fuel supplies, independent nuclear expert Mycle Schneider said on Thursday.",
        "body":"Of the EU’s 101 reactors, 19 are Soviet-designed VVER pressurized water reactors that still depend on fuels and services provided by Russian-owned businesses, Schneider said in a presentation of the latest edition of the World Nuclear Industry Status Report, which is produced by a group of independent experts.\nWhile this only amounted to a fifth of the bloc’s reactors, “their dependence level is fairly high”, he told Montel, noting that there was lack of transparency over Russian fuel dependency. \nSchneider said that 23% of the uranium imported into the EU in 2023 came from Russia, up from 20% in 2021, despite the outbreak of the war in Ukraine. \nThis was “very much linked to stockpiling because the operators feared there might be sanctions on the nuclear sector,” he said. \nSchneider said that countries such as Slovakia and Hungary had a “double dependency”.\n“They have a high dependency on nuclear and nuclear has a high dependency on Russian fuel,” he added.\nRoadmapEnergy commissioner Dan Jorgensen is expected to present a roadmap on 26 March on how to phase out Russian fossil fuels. Jorgensen said in December that nuclear fuels would also be covered by the roadmap. \nThe nuclear industry has so far been almost completely untouched by the previous 15 rounds of sanction packages introduced by the EU on Russia. \nThe only exception was in February 2023, when the bloc – along with the US, the UK and Canada – targeted Atomflot, which maintains Russia’s nuclear icebreaker fleet.\nThe EU has been considering duties instead of sanctions on nuclear products, according to the report. “Applying duties does not require a unanimous decision [by all member states],” it said, noting that duties would not solve the EU’s underlying dependency on Russian supply.",
        "datetime":"2025-02-06T15:56:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]