[
    {
        "title":"EU sanctions on Russian LNG may risk supply – analysts",
        "subtitle":"(Montel) The prospect of EU sanctions this year on Russian LNG imports could prove risky for supply, given LNG project delays, high gas prices and uncertainty regarding US president Donald Trump’s stance on Russia, analysts told Montel.",
        "body":"European gas supply remained “tight”, warned Anne-Sophie Corbeau, global research scholar at the Columbia University’s Center on Global Energy Policy. \n“Gas stocks are within the five-year average, but we are not in the same situation as last year,” she said, pointing to the loss of 15bcm of gas since the expiry of the transit deal through Ukraine at the start of January.\nLast week, a group of 10 EU nations said, as reported by Bloomberg, that they wanted a full ban on Russian gas and LNG imports. The EU is working on its 16th sanctions package ahead of the third anniversary of Moscow’s invasion of Ukraine in February 2022.\nUnanimous vote“There are ongoing conversations” among member states on how to extend sanctions to Russian LNG, a spokesman for the Spanish energy ministry told Montel.\nBut a European Commission spokeswoman declined to comment on whether sanctions would form part of a roadmap – to be presented by energy commissioner Dan Jorgensen next month – on phasing out Russian fuels. Sanctions would be taken unanimously by member states in the EU Council, she said.\nUnder the RePowerEU plan in 2022, the EU set a goal to end imports of Russian gas by 2027.\nThe EU already prohibits the import of coal and seaborne crude oil and refined oil products from Russia in retaliation for its war on Ukraine. However, Brussels has stopped short of imposing direct sanctions on natural gas and LNG imports from Russia due to the bloc’s reliance on the fuel.\n“The problem is that new sources of LNG supply arrive slowly,” Corbeau said, citing delays at LNG projects like the 18m tonnes (24.6bcm) US Golden Pass and Mexico’s 3.25m tonnes\/year Costa Azul, as well as in Mozambique.\n“We might be able to get rid of the 20bcm of Russian LNG by 2026 or 2027 in a phased manner,” she said, stressing the EU should wait for 2027 to impose full-scale sanctions, once global LNG supplies increase.\nTrump policy“From an economic standpoint, it’s very realistic to consider sanctions on Russian gas,” said Ben McWilliams, research fellow at Bruegel think tank, as supply security had vastly improved since the 2022 energy crisis.\nHowever, politically, the EU Council would need to decide on sanctions based on “how much they want to hurt the Kremlin versus the impact you will have on European consumers”, he said.\nCorbeau also saw risks from how Trump would deal with Russian president Vladimir Putin in Ukraine peace talks and whether Putin would seek the lifting of US sanctions or the revival of exports via Ukraine, citing Slovakia and Hungary as potential buyers.\nHowever, the EU’s plans to phase out Russian gas could be used as clout in future trade talks to buy US LNG amid Trump’s plans to boost exports of the fuel, McWilliams said.",
        "datestamp":"22-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]