[
    {
        "title":"EU too “slow” on green H2 to reach 2030 goal – industry",
        "subtitle":"(Montel) The deployment of renewable hydrogen in the EU is too slow, with only five years to reach its target of 10m tonnes of production by 2030, industry leaders said on Wednesday.",
        "body":"“2030 is not that far away, we are in 2025 and the progress that has been made so far is quite modest,” Jose Manuel Perez, co-chairman of the Renewable Hydrogen Coalition lobby, told a storage and hydrogen conference hosted by Spanish solar association Unef.\nThe bloc would need to install around 80-100 GW of electrolysis capacity to reach its 2030 hydrogen goal, he said.\nHowever, final investment decisions on electrolysers totalled 2 GW of capacity throughout Europe last year, Perez added.\nEuropean countries had been “slower than initially expected” on developing green hydrogen, he noted.\nDemand would only reach 2m tonnes by 2030 if the EU achieved its target of 42% of industrial hydrogen consumption from renewable sources, Perez added, in reference to BNEF forecasts.\n“Not a scam”The hydrogen sector “has lost a little bit of interest” amid some “incredulous” participants’ predictions that the technology would fail to advance at the speed initially envisaged, Pablo Gomez, CEO of engineering firm Coagener, said at the same event.\nEurope has seen a wave of clean hydrogen project cancellations in recent months.\nHowever, delays in hydrogen deployment did not make developers “failures”, said Brais Armino Franco, a partner at engineering firm atlantHy. “It does not make us a scam, as many would make the hydrogen sector seem.”\nFinal investment decisions in hydrogen projects in Spain could reach 1 GW of capacity this year, with development expected in the next 3-4 years, he added.",
        "datetime":"2025-02-12T14:11:58",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]