[
    {
        "title":"Eurelectric urges major revamp of EU energy security rules",
        "subtitle":"(Montel) The EU’s energy security rules need a major revamp as the bloc faces new risks from both physical and cyberattacks, energy mix changes and disrupted supply chains, according to a study commissioned by power industry association Eurelectric.",
        "body":"The publication on Friday comes as the European Commission is reviewing the bloc’s electricity, gas and oil security rules to see if they need to be updated.\nThe EU would need more flexible demand and supply, as well as efficient, integrated and liquid markets, and more coordinated energy system planning to safeguard supplies as fossil fuel imports drop and the renewable energy share increases, said the study authors from consultancy Compass Lexecon.\nFuture energy security rules would need to ensure the availability of renewable and low-carbon power supplies to help decarbonise the economy and reduce fossil fuel import dependencies, the study said.\nThey would also need to ensure the physical resilience of the power system to guarantee supplies as more economic sectors relied on it, it said, and economic security by ensuring power was affordable to maintain industrial competitiveness.\nForward hedgingThe study’s more detailed recommendations included developing more and longer-duration power hedging options for trading more than three years out.\nThis would help increase forward market liquidity which is currently limited across the EU, it said. \nOptions include easing trading collateral requirements and organising more frequent auctions for long-term transmission rights with durations of more than a year.\nIf this was not enough to boost cross-border hedging, including through cross-border power purchasing agreements (PPAs), then more direct, ad-hoc measures may be needed, said the study.\nThis could include exploring voluntary market making mechanisms to stimulate liquidity up to ten years ahead, for example.\nPrice cap warningThe study warned against governments intervening directly in spot markets or introducing price caps, even during price shocks, as this tended to distort markets and deter the long-term investments needed by creating regulatory uncertainty and reducing returns.\nIt recommended governments focus on implementing the EU’s electricity market design rules agreed last year. These aim to boost system and demand flexibility while integrating large shares of renewables.\nThe EC intends to present an EU affordable energy action plan looking at how to lower prices on 26 February, along with a clean industrial deal strategy looking at how industry can decarbonise while remaining competitive.\nIt plans to publish its analysis of the EU’s energy security rules by July.\nEurelectric unveiled its study at the Munich security conference in Germany, which brings together politicians, diplomats and officials to discuss international threats and policy options. \nThe EU is facing geopolitical tensions with other regions, more extreme weather events and concerns about EU industry’s global competitiveness. It has also decided to phase out Russian energy imports by 2027 in response to the war in Ukraine.",
        "datetime":"2025-02-14T08:22:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]