[
    {
        "title":"Europe’s gas storage targets likely to be maintained – Equinor",
        "subtitle":"(Montel) Strict gas storage requirements for the coming winter are unlikely to be relaxed, thereby keeping summer contracts unusually at a premium over winter prices, Equinor’s head of power and gas trading told Montel.",
        "body":"“We see that gas prices for the summer are very high, and above the prices for the coming winter, which is not normal,” said Helge Haugane, at the E-World energy fair in Essen, Germany.\nThe Dutch TTF summer contract traded last at EUR 54.71\/MWh, while the winter contract was at EUR 50.70\/MWh.\nThis largely reflected expectations that EU-wide requirements for gas storage facilities to be 90% full by 1 November would be maintained, he added.\nThe EU will struggle to meet this target, amid increased competition with Asia for LNG supplies and existing inventories well below the same period last year, analysts told Montel this week.\nEU-wide gas inventories were seen last at 48.5% of capacity, which was well below the 67% level recorded a year ago.\nAs such, lobby group Eurogas this week urged the European Commission to reassess its gas storage regulation, calling for an overall lowering of the targets.\nTwo-year high pricesThe front-month TTF contract – a European benchmark – hit a two-year high of EUR 59.39\/MWh on Tuesday, which Haugane attributed to unusually cold weather, coupled with relatively low LNG imports over the past 12 months and the halt of Russian supplies – amounting around 15bcm\/year – through Ukraine from 1 January.\nTo compensate for the lower Russian flows, Europe would need to import around 250 more LNG cargoes this year (equating to some 250 TWh), compared with 2024, he noted.\n“In an extreme case, you may need up to 350 TWh, which corresponds to around 350 shiploads,” he said, adding there could be competition for these cargoes with Asia.\n“Suddenly the question of how hot it will be in Asia in the summer will affect how much you have to pay in Europe to attract these LNG cargoes,” he said.\n“But I don’t think we’re going to return to the extreme price levels we saw a couple of years ago.”",
        "datetime":"2025-02-12T14:48:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]