[
    {
        "title":"Europe needs extra CO2 levies to protect industry – study",
        "subtitle":"(Montel) Europe may need to introduce an extra levy on carbon-intensive materials on top of other planned mechanisms to ensure the resilience of its industrial sector, a new study by the London School of Economics university said on Wednesday.",
        "body":"The EU’s carbon border adjustment mechanism (CBAM) in particular may not be sufficient to provide a level playing field if other countries do not pursue comparable carbon pricing strategies, said the UK university’s report, carried out in partnership with the German Institute for Economic Research (DIW).\nAs such, a “straightforward” charge in the form of a climate contribution would “complement, rather than replace” the existing European climate policy framework, particularly the EU and UK emissions trading systems (ETS), free allocation of allowances and carbon contracts for difference.\n“It would be levied on domestically produced and imported carbon-intensive basic materials like steel, cement and plastic, and be based on standardised values equal to the value of free allowance allocation to conventional production,” the report said.\nIt recommended introducing the climate contribution as a “bridging instrument” to complement emissions trading and ensure investment stability and incentives for green industry during the CBAM transition period, set to end in December. \nThe EU’s CBAM, set to launch in 2026, will require companies to buy certificates covering the carbon content of their imported products from certain sectors, with the goal of enabling EU producers of similar products to compete more equally with producers from countries with less restrictive carbon constraints.\nThe UK CBAM will launch in 2027 without a transition period.\n“An uncomfortable dilemma”The report highlighted limitations of the EU CBAM in its current proposed form, such as a lack of export rebates for carbon costs and limited coverage of the value chain.\nAs a result, European policymakers may soon face an “uncomfortable dilemma”, it said, such as accepting an incomplete carbon leakage protection with the current CBAM design. This would risk loss of competitiveness and production shifting outside the region.\nIt advised the EU to make carbon leakage measures resilient to “a fragmented global climate policy landscape” while modernising and greening industry.\n“If large carbon price differences persist globally, the EU’s success in leading the industrial transition to carbon neutrality will depend on its ability to navigate these complex trade-offs effectively,” the study added.",
        "datestamp":"23-01-2025",
        "category":[
            "CARBON"
        ]
    }
]