[
    {
        "title":"Euronext to buy Nasdaq’s Nordic power futures business",
        "subtitle":"(Montel) The Euronext exchange announced on Tuesday a deal to acquire Nasdaq’s Nordic Power futures business for an undisclosed price.",
        "body":"The agreement entails the transfer of existing open positions in Nasdaq’s Nordic power derivatives, currently held in Nasdaq Clearing, to Euronext Clearing, with approval of the members, the exchange said in a statement.\nTrading of power futures will be operated from Euronext Amsterdam and will be cleared through Euronext Clearing.\nNasdaq Clearing in Sweden, Nasdaq Oslo, and their respective infrastructure are not included in the sale.\nNasdaq will continue to operate its European Markets Services business and multi-asset clearinghouse.\n“Euronext, with its strong presence in the Nordics and efficient integrated trading and clearing set-up, is in an excellent position to deliver a long-standing and liquid power futures market for the Nordic and Baltic region,” said Camille Beudin, head of Euronext’s diversified services unit.\n“Major accelerator”“The acquisition of Nasdaq’s Nordic power futures is a major accelerator for our power futures ambition and positions Euronext as a leading player for trading and hedging of power in Europe,” he added in the statement.\nEuronext and Nasdaq intend to work closely together to ensure a smooth migration of Nasdaq’s Nordic power futures in the first half of 2026, it said. Until the migration is completed, Nasdaq will continue to operate its Nordic power futures business as usual.\nThe transaction is pending regulatory approval.\nRival exchange EEX pulled out of a deal to buy Nasdaq’s power derivatives business in June 2024 amid EU competition concerns, while Euronext owns spot exchange Nord Pool.\nLast August, Euronext and Nord Pool announced their plan to launch a Nordic and Baltic power futures market product.\nClient testing will begin in March, Euronext said, before the project launches in June to support the existing Nasdaq Nordic power futures business.",
        "datetime":"2025-01-28T07:16:04",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]