[
    {
        "title":"Europe to import 16% more LNG in 2025 – IEA",
        "subtitle":"(Montel) Europe is expected to import 16% – or 21bcm – more LNG this year than in 2024, assuming a continued cessation of Russian pipeline exports through Ukraine, the International Energy Agency (IEA) said on Tuesday.",
        "body":"Data provided by vessel-tracking firm Kpler showed that total LNG imports into Europe and Turkey in 2024 fell to their lowest since 2021, at 135bcm, Montel reported.\nAs such, the halt in Russian exports through Ukraine would not pose an “immediate supply risk” to EU member states, given the region’s ample storage capacity and access to the global LNG market, the IEA said in its latest quarterly gas market report.\nEU storage levels were likely to remain “adequate” to help balance volatility during the rest of the winter, although a low level of stocks by the end of March could tighten the European balance for the rest of 2025, it said.\nAt the same time, European gas demand would remain close to 2024 levels, as lower power sector gas burn was expected to offset stronger gas use in the residential, commercial and industrial sectors, it said.\nSupply growthMeanwhile, global LNG supply was set to increase by 5%, or just over 25bcm, this year, mainly in North America, amid the launch of new liquefaction projects, such as the first phase of the 27bcm\/year Plaquemines LNG, as well as project expansions.\nHowever, reduced Russian gas deliveries to Europe, amounting to around 15bcm\/year, combined with higher storage injection needs could lead to higher European LNG imports this year and “tighten market fundamentals, especially in the first half of the year”.\nOverall, global natural gas markets were set to remain “fragile” and still see “significant tightness” in 2025, “due to rising demand and muted growth in LNG capacity”, said the IEA’s director of energy markets and security, Keisuke Sadamori, noting that geopolitical uncertainty added to the risks.\nAsian LNG imports were forecast to grow by 2.5%, or 9bcm, which would “revive strong competition” with Europe, as the global market remained “somewhat constrained”.\nLast year, European LNG imports declined by 18%, or close to 30bcm, due to demand declining in the first half of the year, lower storage injection over the summer and stronger piped gas deliveries, which kept European prices below Asian spot LNG prices.",
        "datestamp":"21-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]