[
    {
        "title":"Fixed retail price will include incentive to cut demand – Norway PM",
        "subtitle":"(Montel) Norway’s plan for a voluntary fixed retail price of NOK 400\/MWh (EUR 34.32\/MWh) will include elements that will incentivise consumers to curb demand, prime minister Jonas Gahr Store told Montel on Wednesday.",
        "body":"“What I can say is that we have 1 October as our goal. We will have a system that works unbureaucratically and smoothly and that will continue to maintain the incentive that it is wise to think about how you use electricity,” he said on the sidelines of the Oslo Energy Forum conference, without going into specifics.\n“There will be enough incentives built in for consumption during the right hours of the day,” Store told the conference earlier, with the plan made in a surprise announcement last week aimed at reducing energy bills for consumers when it is launched at the beginning of October.\nHis comments came as market observers were concerned, given the cheap electricity tariffs, there would be no incentive to temper consumption or shift it from peak demand hours, key planks of EU decarbonisation plans.\nThe policy has been much critcised, with Finnish energy minister Sari Multala telling Montel earlier today that the plan was an exceptional measure that would change the nature of the Nordic power market.\n(EUR 1 = NOK 11.67)",
        "datetime":"2025-02-12T15:05:30",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]