[
    {
        "title":"France launches consultation on subsidy cut for rooftop solar",
        "subtitle":"(Montel) France has launched a consultation on controversial plans to cut subsidies for rooftop solar panels, the energy ministry said late on Wednesday.",
        "body":"It aimed to publish a decree carrying the move at an unspecified date, the ministry added, without giving further details.\nRenewables lobby SER said the plans amounted to a “moratorium” on the roll-out of rooftop panels, which France installed 800,000 of last year.\nIndustry and energy minister Marc Ferracci told France’s upper house last month that state funding for small rooftop photovoltaic installations should be cut by EUR 214m, and that their contribution to security of supply was “modest”. \nHowever, cutting public support would be a mistake and send the wrong signal to the sector, SER’s head of solar Xavier Daval said at the time.\nFerracci’s comments were “designed to please the right-wing electorate”, Daval added.\nFrance had 3-4 GW of rooftop capacity at the end of 2024, out of total solar capacity of 22 GW.\nIn 2023, renewables generated EUR 13.7bn in state revenue thanks to high electricity prices. However, with prices falling in 2024, they are expected to have cost the state EUR 6bn last year, according to France’s energy regulator.\nThe energy ministry did not respond to Montel’s requests for comment.",
        "datetime":"2025-02-13T11:03:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]