[
    {
        "title":"France could handle data centre demand surge – minister",
        "subtitle":"(Montel) Low French power demand means the country could “comfortably accommodate” a surge in domestic demand from data centres, ecological transition minister Agnes Pannier-Runacher said on Tuesday.",
        "body":"“If we consume more [power] in France, yes, exports are likely to fall, but the idea is to create value in France,” Pannier-Runacher told journalists on the sidelines of the AI Action Summit in Paris.\nPresident Emmanuel Macron has encouraged companies to set up data centres in the country to power AI usage.\nFrance could currently “comfortably accommodate” strong data centre growth as the country had “reduced [its] electricity consumption to a historically low level”, Pannier-Runacher said, responding to Montel questions.\n“We are back to 2005 [consumption] levels and we have increased our electricity production by around 30% compared to 2022. As a result, France exports around 25% of its power output,” the minister said.\nFrance’s net power exports hit a 22-year high in 2024, amid buoyant nuclear and hydropower supply, TSO data showed.\nPannier-Runacher also expected data centres to increase flexibility in the French power system.\n“When you have production capacities that produce continuously and abundantly, you can supply data centres 98% of the time, and make them lower consumption during demand spikes,” she said.\n“In the near term, we do expect the energy consumed by AI applications to increase… but there is very rapid innovation happening that is driving efficiency and optimisation around AI,” Joshua Parker, head of sustainability at AI chip company Nvidia told Montel.\nGrid concernsHowever, grid infrastructure was increasingly a concern, the IEA’s chief energy economist Tim Gould told the conference.\n“Grids are becoming a bottleneck… [some] renewable projects at advanced stages of development cannot access the grid,” he said, adding that there were shortages of cables and transformers.\nA spokeswoman said that TSO RTE currently had grid connection requests totalling 4 GW, equivalent to around 3% of France’s total generation capacity.\nState-owned utility EDF would offer four sites on its property for the construction of data centres, totalling 2 GW, it said late on Monday. It aims to provide two more sites by 2026.\nClimate advocacy group Beyond Fossil Fuels has estimated that European data centre power demand could surge to as high as 287 TWh by 2030, while consultancy McKinsey sees demand rising to over 150 TWh by then, from around 62 TWh today.",
        "datetime":"2025-02-11T11:54:26",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]