[
    {
        "title":"France’s floating offshore wind farms aim to use EU-made turbines",
        "subtitle":"(Montel) France's three floating offshore wind farm projects are expected to use giant wind turbines, with two projects aiming to source them in the EU, rather than China, developers told Montel.",
        "body":"“We are fully confident in our ability to complete this project using European manufacturers based on the initial cost estimates we have received,” said Angelique Logodin, deputy project director of Pennavel, which was selected to build a 250 MW floating wind farm off the coast of Brittany.\n“Europe has already lost its leadership to China in the solar sector, we hope to avoid that outcome in the wind sector,” she noted, although the company was “not ruling out discussions with Chinese turbine manufacturers”.\nThis comes amid growing EU concerns of an overreliance on Chinese-made parts in the renewables supply chain.\nPennavel won France’s first tender for a floating offshore wind farm last May, while a consortium owned by EDF’s renewables arm and Maple Power and a separate joint company owned by Ocean Winds and Eolien en Mer Participation were both awarded 250 MW floating projects last December.\nAll three projects plan to use turbines of around 21 MW, almost four times the size of the 6 MW turbines used for France’s first offshore wind farm, although no manufacturers are currently producing turbines of this size.\nOcean Winds would select a manufacturer “based on market conditions and supplier competitiveness”, a spokeswoman said, adding that the company was “confident in the ability of the European supply chain to meet the project’s requirements”.\nChinese price impact?In January, French energy regulator CRE noted that bidders in offshore wind tenders were increasingly referencing Asian manufacturers in their bids, including Dongfang, Mingyang, Goldwind and CSSC.\nYet European manufacturers, such as GE Vernova, Siemens Gamesa Renewable Energy and Vestas were also mentioned, it said.\nThe emergence of new manufacturers, including Chinese suppliers, could result in lower prices, Ocean Winds said, and European manufacturers would be “expected to adapt their strategies in response to market developments”.\nMeanwhile, EDF Renewables gave no indication of favouring European turbines. “We will select the most efficient turbines that are best suited to the wind conditions on site,” a press officer said.\nOn Monday, French industry and energy minister Marc Ferracci confirmed that the government would introduce “resilience” criteria in the country’s ninth offshore wind tender to promote the use of turbines manufactured in France or Europe.\nThe winners of the tender would be announced by the end of the year, he said, while France’s tenth offshore wind tender, covering 8-10 GW, would be launched by mid-year.",
        "datetime":"2025-02-17T13:43:59",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]