[
    {
        "title":"French regulator launches plan to shift 7 GW of demand",
        "subtitle":"(Montel) France’s CRE energy regulator has announced moves aimed at boosting household power consumption at times when solar power is abundant and reducing it when demand threatens to outstrip supply.",
        "body":"The regulator reckons that around 11m households could shift 7 GW of power demand during off-peak hours, with household demand accounting for about a third of national consumption, according to an official with CRE.\nFurthermore, changing consumption patterns should help reduce the number of negative price hours in the market, CRE head Emmanuelle Wargon told Montel on Thursday, but declined to say to what extent.\nFrance saw a record number of hours with negative prices last year, although it still faces price spikes during winter demand peaks.\nThe country’s power system is designed to accommodate a constant flow of nuclear output, which accounts for around 70% of total power production. However, France has seen a growing capacity of intermittent renewable energy, notably solar power.\n1 November rolloutCRE would start rolling out the plan from 1 November and was mulling boosting the number of off-peak hours by the end of 2027, Wargon said.\nThe regulator’s plan is to gradually shift so-called “off-peak hours”, during which electricity is cheapest for households to summer afternoons when there is plenty of solar and winter nights, and away from mornings and evenings when demand can spike, she added.\nAndreas Rudinger, analyst at French think tank IDDRI, said the plan could also help reduce pressure on France’s fleet of ageing nuclear reactors.\nShifting demand to off-peak hours at times of robust renewables output would reduce the need for modulation or the ramping up and down of nuclear reactors, he said.\nFrance’s ASNR nuclear safety body is currently probing a possible link between the modulation of reactors and the corrosion phenomenon which forced state-run utility EDF to stop reactors in unplanned outages in recent years.",
        "datetime":"2025-02-07T12:22:56",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CONSUMPTION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]