[
    {
        "title":"French utility Engie sees 59% surge in PPA deals in 2024",
        "subtitle":"(Montel)French utility Engie saw a 59% year-on-year surge in the number of power purchase agreements (PPAs) for its supply of renewable power in 2024, including deals with tech giants Meta and Google, it said late on Monday.",
        "body":"The company signed 4.3 GW of PPAs last year, up from 2.7 GW in 2023 and bringing its total contracted amount of PPAs to 14 GW, it added in a statement.\nThe 85 deals signed last year for the supply of wind, solar and hydropower output represented 136 TWh, equivalent to about a third of France’s annual power output, it added.\nThese included 1.5 GW in the US, “reflecting the high demand for renewable electricity in this region”.\nAs well as tech companies, it had signed PPAs with utilities, chemical companies, as well as those “in the medical field”.\nThe PPA market was driven in recent years by the “growing need for decarbonised electricity in all sectors, particularly in the technology and digital sectors where new energy-intensive uses such as AI have emerged”, it said.",
        "datetime":"2025-02-04T07:44:08",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]