[
    {
        "title":"French spot power hits 2-year high but downside looms",
        "subtitle":"(Montel) France’s day-ahead power price cleared at a two-year high of EUR 196.71\/MWh for delivery on Monday but looks set to drop steadily this week amid improving wind output, LSEG told Montel on Monday.",
        "body":"The country could expect average wholesale power prices to clear between EUR 140-160\/MWh on Tuesday and Wednesday, around EUR 110\/MWh on Thursday and below EUR 100\/MWh on Friday, said Gabriele Martinelli, LSEG head of European power research.\nThe situation was expected to ease mainly due to French wind output “steadily increasing” from below 2 GW today to 4.3 GW on Tuesday, 6.5 GW on Wednesday, 9.5 GW on Thursday and 13 GW on Friday, he said.\nMeanwhile, German day-ahead prices were also set to retreat, to EUR 160-170\/MWh on average on Tuesday, EUR 150\/MWh on Wednesday and EUR 100\/MWh on Thursday.\nHourly price spikeHourly French power prices for delivery today surged to an almost two-year high of EUR 473.28\/MWh, while the German counterpart soared above EUR 500\/MWh, due to a lack of renewable generation.\n“It’s not really temperature-related, the combination of low wind in France and Germany is really hitting hard,” Martinelli said, adding that thermal power generators in both countries were “bidding high to maximise their profits”.\n“It’s uncommon to have lower than 10 GW of wind in both countries combined, but when it happens prices are likely to spike,” he said. France needed “all the other power sources it could take” other than nuclear, which meant that gas, coal and run-of-river hydropower were running at maximum capacity.\n“There really is a lack of flexibility on days like these, as soon as the situation is a bit tight this is the outcome,” he noted.",
        "datestamp":"21-01-2025",
        "category":[
            "ELECTRICITY",
            "WIND"
        ]
    }
]