[
    {
        "title":"French gas lobby warns of double taxation with EU ETS2",
        "subtitle":"(Montel) The French gas industry lobby urged the government on Tuesday not to double tax carbon emissions from gas when the EU ETS emissions trading system is extended to new sectors in 2027.",
        "body":"Gas consumers in France already paid EUR 45\/MWh for carbon under an existing tax, and “if this were combined with the upcoming EU ETS2, it would be unworkable”, said Frederic Martin, president of France Gaz, at a press conference in Paris.\nFrance should replace the carbon component of its tax with the ETS2 allowances to moderate costs and maintain the competitiveness of its industry, he added.\nUnlike the existing EU ETS, the ETS2 scheme will cover emissions from upstream fuels, such as petrol and natural gas, when it becomes fully operational in two years’ time. This means fuel suppliers will be required to monitor and report their emissions, with a requirement to surrender sufficient allowances to cover their emissions.\nThe CLEEE lobby of large energy consumers recently said that the gas bill for industries currently not subject to the EU ETS could jump by 40-50% and that of households and businesses by 50-60% by 2027, including the ETS2 and French taxes on carbon, green gas and transport.\n“We will thus be the European country that pays the most for its gas [which] will become unbearable for most users\" and would threaten the sustainability of the country’s industry despite its efforts to decarbonise, the CLEEE added.",
        "datetime":"2025-01-28T13:15:06",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]