[
    {
        "title":"Gas storage targets an EU decision – German regulator",
        "subtitle":"(Montel) Germany is prepared to intervene to fill gas storage this year if needed, the head of German regulator BNA told Montel, but he emphasised the importance of discussions at a European level on whether storage targets should be amended.",
        "body":"Klaus Mueller said the currently inverted summer-winter gas price spread was “strange” from an economist’s perspective and raised the question as to “whether the storage level requirements might be sending a signal that prevents the market from filling the storage facilities”.\n“Therefore, it is an important discussion at a European level whether the storage level requirements are still up to date as they are. This is something that politics will have to decide,” he added during an interview at E-World in Essen, Germany.\nWinter contracts are usually more expensive than summer contracts due to higher demand during the heating season, which incentivises summer stock filling, but lately spreads have been reversed.\nLower inventoriesOn Tuesday, the head of a lobby said this was because the market was betting on state intervention, while Italy called on the EU to revise member states’ gas storage requirements.\nSummer 2025 on the benchmark TTF hub last traded at EUR 50.91\/MWh, while the winter equivalent last changed hands at EUR 48.67\/MWh.\nThe EU’s mandatory refilling target to 90% of capacity by 1 November, brought in after Russia’s 2022 invasion of Ukraine, faces challenges this year from increased competition with Asia for LNG supplies and much lower inventories than last year.\nGerman gas storage facilities were last seen at 47% full compared with 72.3% this time last year, data from Gas Infrastructure Europe showed.\nIn January, German gas market operator THE outlined a new plan to meet national gas storage targets in the absence of market-based incentives by resorting to auctions.\nCostly and complexMueller said the plan, developed in collaboration with the economy ministry and BNA, “would be capable of filling the gas storage facilities cost-efficiently”.\nHowever, he added: “The instrument is almost ready, but that does not necessarily mean it has to be used. No decision has been made yet.”\nMarket participants at E-World on Wednesday criticised the plan as being too complex and costly but THE said it was still subject to change.\nEurope’s benchmark front-month TTF contract hit a two-year high on Tuesday amid storage and supply concerns but has since dropped and was last seen at EUR 51.07\/MWh.",
        "datetime":"2025-02-13T14:43:39",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]