[
    {
        "title":"Gas will be “key” amid Spain’s nuclear shutdown – Enagas",
        "subtitle":"(Montel) Gas and the related infrastructure will continue to play “a key role” in Spain’s energy system as the nation prepares to close its nuclear fleet and expects an increase in power demand from data centres, the CEO of Enagas said.",
        "body":"Spain’s gas-fired power plants are “essential” as a backup to the intermittency of renewables and the “nuclear switch-off” from 2027, said Arturo Gonzalo when presenting the TSO’s 2024 financial results.\nAdditionally, these plants will also help cover the added demand coming from new data centres, which will reach 2,500 MW by 2030, Gonzalo said, citing the Spanish government’s artificial intelligence strategy.\nSpain’s utilities agreed in 2019 to gradually close the country’s seven nuclear reactors between 2027 and 2035, although experts have warned of risks to security of supply and higher prices.\nGreen hydrogen at EUR 2.6\/kg?Spain will also rely on renewable hydrogen to help supply a growing demand for energy and reach its climate goals.\nThe Enagas CEO said the Iberian Peninsula will produce the “most competitive” green hydrogen in Europe.\nHe reckoned the price of green hydrogen could range from EUR 2.6-3.8\/kg by 2030 as power costs fall and electrolysers will also become more efficient. This compares with EUR 5.85\/kg in the latest green hydrogen index launched by Mibgas at the end of last year.\nThe firm estimated that European green hydrogen demand will rise to 3-4.5m tonnes by 2030, while Spain’s will stand at 0.8m\/t by that date, it said.\nMeanwhile, the Spanish government’s ambition was to cover 20% of the EU’s renewable hydrogen production target of 10m tonnes by 2030. \nThe firm will invest a total of EUR 4bn over the next five years, of which EUR 3.1bn will go towards green hydrogen, the CEO added. The company expected to make a final investment decision on hydrogen pipeline between Iberia and France, called H2Med, by 2027, he said.",
        "datetime":"2025-02-18T11:10:24",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]