[
    {
        "title":"German gas operator auction plan too complex, pricey – traders",
        "subtitle":"(Montel) Plans by Germany’s THE gas market operator to resort to auctions to incentivise gas storage, if mandated targets are not met, are too complex and could incur costs of more than EUR 1bn, market participants said this week.",
        "body":"The new product was risky for traders to hedge and would lead to a higher premium for storage gas, they added at an event hosted by the THE at the E-World trade fair in Essen to discuss its plans, first announced in January.\n“This [the plan] creates volatility and drives the summer-winter spread,” said one trader.\n“From a trader’s perspective, I could say: “This is great. But the taxpayer has to pay for it”.”\nThe THE, came up with the proposals, along with the BNA energy regular and the economy ministry, amid fears Germany may not meet its mandated target fill target of 90% by next November.\nUnfavourable storage conditionsCurrently inverted winter-summer spreads – with summer prices significantly above next winter’s values – amid ongoing, short-term supply concerns had created unfavourable conditions for storing gas, said market participants.\nThe THE was compounding the problem in terms of atypically high summer prices, as traders were betting on the state intervening to top up storage this year in the wake of the proposals, the head of a German lobby group said yesterday.\n\"Market actors are betting that the market will not get the storage filled and that a state actor will have to enter the market in the second half of the summer and then get gas on the market at very high prices,” added Timm Kehler, chairman of the Gas and Hydrogen Industry.\nThe market itself would probably fill the required storage to 75-80%, with the remaining 10-15% having to come via intervention, said another trader, referring to the THE’s plans, which are still at the consultation stage.\nOngoing discussionsThe product design, which tied the proposed auctions to the summer-winter spread, merely represented the state of discussion with the BNA and the economy ministry, said Markus Sammut, head of regulation at the THE, at the same event.\nThe costs of possible storage auctions would be added onto Germany’s storage levy, which is paid by end-consumers.\nHowever, there was a “good chance that based on today’s discussion, the product could change”, with the ultimate decision for a tender up to the ministry, he added in front of representatives from more than 150 companies.\nEuropean gas prices hit a fresh two-year high yesterday amid storage and supply concerns, with regional inventories last seen at 48.5%, having slid below 50% full for the first time since June 2022.\nThe mandatory storage targets were brought in amid the fallout from the Ukraine war and the curtailment of Russian gas flows to Europe.",
        "datetime":"2025-02-12T10:44:25",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]