[
    {
        "title":"German green energy marketers eye storage opportunities – poll",
        "subtitle":"(Montel) German green energy marketing portfolios grew last year, with Quadra Energy replacing ENBW as the market leader, while companies were eyeing further growth opportunities in the field with the rise of battery storage, Montel’s annual survey found.",
        "body":"Quadra Energy, which was acquired by French energy company TotalEnergies in 2023, saw its portfolio increase by 900 MW to 10,400 MW last year, while utility ENBW’s portfolio shrank by 207 MW to 9,350 MW.\nAs of 1 January, the third largest portfolio was held by renewable energy marketer Next Kraftwerke with 8,475 MW.\nUtility Engie Germany, meanwhile, recorded the largest growth in capacity volume year on year – growing 2,300 MW to 5,288 MW – and ranked eighth amongst the country’s green power marketers in 2024.\n“Pleasing growth”“We are seeing pleasing growth in our portfolio. It is the strongest increase in our seven-year history of direct marketing in Germany,” said Tobias Heyen, head of origination at Engie Germany.\nThe boost came, with many survey respondents pointing to the potential of battery storage and other flexibility options to complement the growth of intermittent renewables output.\n“The marketing of BESS [battery energy storage systems] and other controllable plants such as biogas and CHP [combined heat and power] plants and electrolysers is a growth area for us,” said Nicole Teschauer of green firm BaywaRe.\n“Biogas plants, conventional plants and batteries have the ability to produce or store electricity flexibly. Therefore, the expansion plays a central role in our business in the coming years,” said Anne Walter of Leipzig-based direct marketer Energy to Market.\nChallenging conditionsHowever, despite the overall positive trend in marketing volumes, participants faced challenging market conditions last year, particularly in the power purchase agreement (PPA) sector, said those surveyed.\n“Last year was mainly characterised by a sharp increase in negative prices. Here, the good controllability of PV [photovoltaic] systems is a key factor in addressing this phenomenon, which will intensify with further expansion,” said Lotte Lehmbruck, head of communication and market research at Next Kraftwerke.\nNegative prices are a growing phenomenon, particularly at times of low demand and high renewables output.\n“Systems that are not well controllable will increasingly struggle to find marketing under acceptable conditions,” added Lehmbruck.\n“Electricity prices have now fallen back to a level that makes concluding PPAs with electricity prices above common subsidy rates for PV and onshore wind almost impossible,” said Thomas Krings, managing director of Quadra Energy, noting off-takers did not want to be locked into PPAs amid lower wholesale power prices.\nThe expansion of solar capacity by around 30 GW in the past two years had also drastically reduced the value of such units, he added.\nSwitch of focus“Driven mainly by this expansion, we have already seen almost 500 hours with negative prices this year [2024] alone. That’s more than 5% of all delivery hours,” Krings said, with Quadra now switching its focus to wind energy plants in the PPA segment\nIn terms of a wishlist for the next government ahead of next month’s general election, survey respondents were largely in agreement on the need for simpler regulation governing direct marketing.\n“Further deregulation by reducing regulatory requirements and processes… would be desirable,” said Regina Wolter, spokeswoman from utility RWE.\nGermany’s direct marketing scheme grants renewables operators a premium on top of the wholesale price of power if they sell their production directly to market instead of through TSOs, which are otherwise obliged to pay fixed tariffs. Marketers can also manage portfolios on behalf of other green producers.\nDirect marketing portfolios January 2025 (MW):\n\n\n\n\nCompany\nDM portfolio\nChange y-o-y\nPPA portfolio\n\n\nQuadra Energy\n10,400 MW\n900\n500 MW\n\n\nENBW\n9,350 MW\n-207\n1,360 MW\n\n\nNext Kraftwerke\n8,475 MW\n617\n630 MW\n\n\nStatkraft\n6,600 MW\n-400\n1,900 MW\n\n\nDanske Commodities\n5,850 MW\n50\nyes\n\n\nMVV\n5,500 MW\n-200\n600 MW\n\n\nGEWI GmbH\n5,300 MW\n1,000\n800 MW\n\n\nEngie\n5,288 MW\n2,288\n44%\n\n\nBKW\n4,800 MW\n900\n1,300 MW\n\n\nBaywa Re\n4,690 MW\n-1,660\n645 MW\n\n\nAlpiq\n4,350 MW\n350\n< 5%\n\n\nEon\n4,207 MW\n943\nnot specified\n\n\nVattenfall\n4,175 MW\n110\nnot specified\n\n\nSunnic Lighthouse\n4,166 MW\n316\n1,979 MW\n\n\nRWE\n3,100 MW\n510\n~ 1,000 MW\n\n\nPure Energy\n3,020 MW\n620\n1,400 MW\n\n\nEWE Trading\n2,745 MW\n-210\nnot specified\n\n\nCentrica Energy\n2,700 MW\n200\nnot specified\n\n\nEnergy2market\n2,606 MW\n120\nyes\n\n\nTrianel\n2,600 MW\n200\nnot specified\n\n\nStadtwerke München\n2,415 MW\n-155\n20 MW\n\n\nAne Energy\n1,595 MW\n545\n435 MW\n\n\nImpuls Energy\n1,374 MW\n554\nno\n\n\nEsforin\n> 1,100 MW\n600\nno\n\n\nEnercity\n1,088 MW\n53\nnot specified\n\n\nNaturstrom\n1,071 MW\n410\n70 MW\n\n\nLEW\n800 MW\n0\nyes\n\n\nN-ERGIE\n777 MW\n-63\nnot specified\n\n\nVerbund\n735 MW\n-223\n74 MW\n\n\nMark-E (Enervie)\n687 MW\n24\n92 MW\n\n\nStadtwerke Rosenheim\n601 MW\n148\n61 MW\n\n\nUniper\n545 MW\n0\nnot specified\n\n\nSyneco\n462 MW\n-28\n40 MW\n\n\nIqony\n457 MW\n193\n29 MW\n\n\nRheinenergie\n456 MW\n109\n< 5%\n\n\nE.VITA\n291 MW\n23\n164 MW\n\n\nQuantum\n216 MW\n80\n173,4 MW\n\n\nLUOX Energy\n200 MW\n48\nno",
        "datetime":"2025-01-27T08:27:08",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]