[
    {
        "title":"German hydrogen sector in limbo as it awaits election clarity",
        "subtitle":"(Montel) German elections on 23 February could decide the extent to which hydrogen is used to decarbonise the country’s economy in the coming decades, attendees at the E-World energy fair in Essen said this week.",
        "body":"“We are a bit in a void waiting for the new government,” said Sebastian Braun, head of power and hydrogen analytics at commodities consultancy Icis.\nThe outgoing coalition government deemed hydrogen a key plank of its plan to become carbon neutral by 2045.  \nYet a slew of hydrogen project cancellations across Europe last year has thrown into question the viability of many of its suggested applications – whether as a substitute for fossil fuels in industrial processes or to burn in place of gas in power plants that back up renewable generation.\nIcis has pushed back its projections for hydrogen uptake by around five years. It now only sees European hydrogen demand surpassing 350 TWh in 2031, almost a fifth below its prior expectations. It was until recently forecasting that demand would hit 350 TWh next year.\nReality check“We are starting to come a little to terms with reality,” saidAndreas Fischer, an energy specialist at the German Economic Institute. “Everything is taking longer. But that doesn’t mean the topic of hydrogen is dead or fundamentally the wrong path.”\nChancellor Olaf Scholz’s Social Democrats are trailing third in the polls, and are only likely to serve as junior coalition partners following the elections. \nFriedrich Merz’s centre right Christian Union (CDU\/CSU) has promised to prioritise bringing down energy costs. The CDU\/CSU is polling first, but with only around 30% of the vote, meaning it is also likely to need partners to form a government.\nThe CDU\/CSU is more sceptical of the government’s drive to boost hydrogen, and has emphasised carbon capture and storage (CCS) in conjunction with existing fossil fuels as an alternative, especially for backup power generation for renewables.\nHydrogen still crucial“I’m actually not so sure if it’s more cost-efficient to build up a whole CO2 infrastructure all over Germany,” said Philipp Heusser, head of hydrogen at energy consultancy E-bridge.\n“To account for the political and social [resistance to] underground CO2 storage – in my opinion, that’s the way bigger obstacle to surmount in the future.”\nHydrogen would be essential for German industrial processes with high temperatures that cannot be electrified, he added.\n“What we can’t afford are the next years without a clear roadmap, a clear plan, for hydrogen production in Germany,” said Heusser.\nThe low energy density of natural gas and hydrogen meant imports of these would always make their applications less competitive – irrespective of whether a company opts for CCS or hydrogen to decarbonise, said Alfred Hoffmann, head of energy strategy at German steelmaker Salzgitter.   \nImports no substitute“It is illusory to think we can ever become more competitive on energy costs than the US, China or India,” Hoffmann said.\nHis company is set to cut its emissions by 30% from next year as a steelmaking project using hydrogen enters large-scale production. Salzgitter hopes to convert its steel mills fully to a process with hydrogen by 2033, cutting emissions by 95%.\nHowever, this will depend on the availability of hydrogen supply and the willingness of customers to pay a premium for green steel, Hoffmann said.\n“Our only chance is to expand generation capacity for power. We need power to produce hydrogen in Germany and Europe. It is the only sustainable way forward, and one that will also happen to make us more competitive again,” he said.",
        "datetime":"2025-02-12T15:41:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]