[
    {
        "title":"Germany and France to reveal nuclear power’s European fate",
        "subtitle":"(Montel) Berlin and Paris have notoriously different views on nuclear energy – and their competing approaches to meeting Europe’s climate objectives will likely settle the fate of the technology on the continent. In their own ways, their visions of a decarbonised future recall the Irish joke: If you want to get there, I wouldn’t start from here.",
        "body":"Germany, where nuclear energy still accounted for almost a quarter of the power mix in 2010, phased out its last reactors two years ago. Yet, as its plans to acquire a fleet of new gas-fired power plants demonstrate, its focus on renewable energy is struggling to shed a dependence on fossil fuels for backup.\nFrance, meanwhile, is banking on a new generation of nuclear reactors to replenish its ageing fleet and to meet the EU’s goal of carbon neutrality, or net-zero emissions, by mid-century. Yet massive cost overruns and delays put the feasibility of this in question: Western Europe’s latest reactors, the 1.6 GW Olkiluoto unit 3 in Finland and the 1.6 GW Flamanville unit 3 in France, each came in billions of euros over budget and more than a decade behind schedule.\nThe two countries provide telling lessons for other European countries looking to develop their first nuclear reactor, like Poland, to expand existing capacity, like the Czech Republic, or to rethink an atomic comeback, like Italy.\nAccording to the International Energy Agency, public funding alone will not suffice to build a new era of large-scale reactors. Private financing is needed to scale up investments.\n“However, the long timelines for permitting and construction make nuclear a tough proposition for commercial lenders, as they can push the breakeven point for a new large reactor to 20-30 years after the project start. These factors also limit the use of project finance structures, which are often used to support other large infrastructure projects,” the Paris-based IEA says in its latest special report on nuclear energy, published in January.\nGermany pulls the plug“Germany’s biggest mistake, in my opinion, was it never solved the question of final storage for nuclear waste,” says Jochen Winkler, the independent mayor of Neckarwestheim, a town in southwest Germany home to one of the country’s last reactors to close in 2023. Winkler does not receive too many reporters these days. But his eight years in the job have honed his responses on the subject all the same. “A decision was constantly deferred between generations, that charged the mood on this topic, and when the accident happened at Fukushima, things tipped,” Winkler says.\nThe Fukushima nuclear disaster in 2011 prompted then chancellor Angela Merkel to reverse her controversial nuclear lifecycle extensions and largely return to the nuclear exit of opposition parties agreed a decade earlier. On 30 June 2011, the German Bundestag, based on a broad, cross-party majority, agreed to phase out the commercial use of nuclear power. The last three reactors shut down in April 2023.\nGermany now aims to secure 80% of its power from renewables by 2030 and to make its economy carbon neutral by 2045. The commitment to make renewable energy the backbone of the country’s electricity system extends beyond the Greens – a majority in the Bundestag agrees with the goal, if not the means.\nYet a system built around renewable energy implies a need for a lot of flexibility: it needs to be able to ramp up output when the sun or wind is absent, and it also needs to absorb vast volumes of both when they are there.\n“We know that renewables and nuclear is not a good pairing,” RWE boss Markus Krebber told a recent conference call with financial market analysts when pressed on the prospects of restarting his decommissioned reactors. He is well-placed to know. As the head of Germany’s largest power producer, he has presided over the operation of substantial volumes of both nuclear and renewable energy.\n“Nuclear power is not a flexibility provider,” says Karsten Neuhoff, an energy economist with the German Institute for Economic Research. “You will not build a nuclear power station... only to produce in some hours.”\nSharp declines in the cost of solar cells and wind turbines over the past couple of decades have made these technologies “unbeatable” – at least in the hours when they produce, Neuhoff says. The more open question for him is the cost of the flexibility to transfer renewable energy when it is abundant to periods when it is scarce.\n“There’s a lot more potential for flexibility, like for heat storage… that is even cheaper than battery storage,” Neuhoff says. “I would see a large advantage of these technologies, on top of the ability to really scale them up quickly, compared to the experience we’ve had over the last decade or so with attempts to build nuclear power stations in Europe.”\nScalability favours solar and batteries rather than nuclear power, says Sam Wilkinson, director of clean energy technology at S&P Global. He points out that in 2008, Spain, one of Europe’s sunniest places, had installed roughly 2.5 GW of solar capacity, a record that exceeded all expectations. Fast forward to December 2023, when China installed 53 GW in one month. “But you know what? There’s an awful lot more to come,” Wilkinson says.\nOnly a handful of nuclear reactors were built around the world in 2023. That compares with perhaps hundreds of gas turbines, 20,000 wind installations and billions of lithium-ion and photovoltaic cells, by S&P estimates. “When you are making billions of something, you only need a tiny bit of improvement [to deliver] a massive… gain in performance,” Wilkinson says.\nThe increasing volatility of power markets – itself a consequence of greater solar and wind penetration – is luring the attention of both battery investors and battery makers. Wilkinson expects the world to have 900 GW of utility-scale battery storage by 2030, up from practically nothing in 2015. Europe and China are two places Wilkinson expects to exceed their share of a UN target to install 1,500 GW of energy storage by 2030.\nPower lines on an overcast day in Germany. Photo: Christian Driessen\/Montel\nDealing with DunkelflauteMartin Hjelmeland is not convinced. He investigates nuclear energy’s role in renewable energy systems for the Norwegian University of Science and Technology and rejects the idea these technologies cannot coexist.\nExtended periods of low renewable energy generation – often called a Dunkelflaute in Germany – imply huge volumes of potential storage capacity in a system intended to depend 100% on renewable energy, he says. “It’s those longer periods that become more, and increasingly, difficult to manage without fossil fuels.”\nHjelmeland points to 2021, a year of especially low wind in Europe when a stretch of 41 days saw wind turbines average just 15% of their capacity in the UK. To fill the gap, natural gas kicked in, providing around 12 TWh of power during the period, he says. “The largest hydro reservoir in Norway is 8 TWh, and it takes three years to fill,” he says. Trying to picture 12 TWh of storage with Tesla Powerwalls is more mind-boggling still. “You could pack them around the equator a couple of times because the amount of energy storage needed is so high.”\nThe researcher contrasts his native Norway with the United Arab Emirates, a country with comparable energy demand. The latter embraced a plan early this century to develop nuclear energy around the time Norway ruled it out in favour of growing wind and solar. While it took the UAE over a decade to develop its first nuclear plant, its four reactors now produce vastly more power than Norwegian wind and solar in the same space of time. The UAE also managed to slash the construction costs of its second two units by half relative to the first two.\n“I am not against renewables, I am for a low-carbon energy system that benefits humankind,” Hjelmeland says. “The technology mix that gets us there is not all renewables. It also contains a significant amount of nuclear, with hydro and geothermal for those who are geographically fortunate.”\nYet nuclear energy’s uneasy relationship with renewables is not a “purely German” phenomenon, says Hanns Koenig, managing director for central Europe at Aurora Energy Research. “All markets that have nuclear will have to grapple with the integration of intermittent renewables.” The relatively low cost of solar and wind assures they will make up growing shares of countries’ power mixes – even in France, which has historically sourced up to 80% of its power from nuclear energy, Koenig says.\nPenly nuclear power plant in France. Photo: Vincent Isore\/Imago\/NTB\nFrance’s prolongation of nuclearThe challenge for nuclear plants is less so much the issue of flexibility – France has demonstrated its reactors can modulate their output in response to swings in renewable generation, Koenig adds. The real challenge is the hit to nuclear plants’ expected running hours, he says. Nuclear plants come with high capital expenditure. Their business case usually assumes high operating hours – historically 7,500-8,000 hours per year over lifespans extending decades.\n“In the future, they might only get 5,000 hours because there’s an excess of renewables in the remaining hours. It might even go down to 4,000 hours,” Koenig says. “So either it makes it more difficult to repay your [capital expense], or you need to realise higher prices in those hours, which you may not be able to get,” he says. “I predominantly look at it as a profitability problem.”\nFrench officials point to the relative costs of flexibility to justify the U-turn on nuclear power by the president, Emmanuel Macron. In the spring of 2022, amid much fanfare, Macron declared that instead of closing almost a quarter of France’s entire reactor fleet by 2035, as planned, he wanted to extend reactor running lives for as long as possible. And yes, France would launch a new reactor programme, he confirmed, ending years of speculation.\n“At the time, it was indeed the least expensive scenario. And, by and large, it performed better on all counts,” says a source formerly with a French ministry. “So, it was very hard for politicians to say that we wouldn’t take this scenario.”\nResearchers at French TSO RTE had drawn up six scenarios for the French power mix in 2050. They calculated that production costs across all the scenarios to 2050 were roughly the same, with or without nuclear. However, “flexibility requirements” had a “decisive impact” on the total costs of each scenario, TSO head Xavier Plechazyck told reporters at the time. France would save more than EUR 10bn\/year in a scenario where nuclear accounted for 50% of the mix, compared to the path leading to a 100% renewable energy mix.\nBut these projected savings would only come about if financing costs were kept down, the TSO head said. The cost of financing new nuclear had to align with those of other “low carbon technologies” and the TSO’s researchers had assumed a rate of 4%.\nFinance rates could be as low as 4% for some public-funded renewable projects and as high as 8% for private investment in nuclear, notably the UK’s nuclear build at Hinkley Point, according to Yves Marignac, a spokesman for NegaWatt, a think tank. The TSO’s nuclear power scenarios “therefore appear less costly only if their associated financial risks are passed on to the community,” he adds.\nWorks around the Penly nuclear power plant in Normandy, France. Photo: Muriel Boselli\/Montel\nAtomic financingTo pay the estimated EUR 67.4bn cost to build six European pressurised reactors by 2050, EDF, the French state-owned utility, may receive an interest-free loan coupled with contracts for difference (CFDs) for the power sold by the plants, according to an economy ministry source. This means the “state effectively guarantees you are covering your costs,” says Jacques Percebois, emeritus professor at the University of Montpellier’s Creden energy research centre.\nPoland envisions CFDs to help finance its first reactor, as does the Czech Republic for its 1.2 GW nuclear power plant in Dukovany. However, the French government will not finance EDF’s entire investment “as it is much bigger”, says Percebois. “The balance will either be financed by EDF’s own funds or by borrowing on the financial market.” \nThe European Commission has approved the Czech plan, leaving the door potentially open for France and others to move ahead with new large-scale reactors. “The advantage of subsidies from European public bodies is that it sends a signal to private financiers. From the moment the EC gives its approval and possibly a subsidy, it’s a sort of guarantee to the financier,” says Percebois.\nHowever, the French ministry source believes that any EC approval for France’s plan would come with conditions and perhaps a demand to unravel the state-run utility EDF. “New nuclear costs about EUR 70bn and EDF’s debt is EUR 60-70bn,” he says. “Do we believe for a moment that the EC will allow a zero-interest loan to be granted to EDF to finance new nuclear plants, thereby cancelling its existing debt? It will never let that happen… The new and old will have to be separated.”\nFrance’s highest state auditors have warned that the costs to build the six reactors will top EUR 100bn when financing costs are added. EDF should “withhold a final investment decision”, due next year, until financing has been “secured and the detailed design studies completed”, auditor chief Pierre Moscovici recently said.\nParis-based independent energy consultant Mycle Schneider criticises EDF for the billions of euros in cost overruns at its Flamanville EPR plant, and he believes the company is making a similar mistake at the Penly nuclear plant on the Channel coast where EDF hopes to build two new reactors. Planning site preparations “without even having the design” was one of the reasons “why costs at Flamanville exploded”, he says. “They started too early. The design development required many changes to activities that had already taken place.”\nAs France struggles to finance its nuclear plans, the German municipality of Neckarwestheim will struggle to finance itself. The next 15 years will be tough for the community after decades of taxes from a local nuclear plant, Winkler says. Compensation for the provision of a temporary nuclear waste site could provide something of a bridge in the future, he adds.\nWinkler expects Germany to need up to a century to complete transferring waste from temporary sites to a permanent one when it is finally accepted. Though he would welcome a return to the good old days for his community, he dismisses this prospect for Germany more broadly.\n“Technically, it would probably be feasible, but only with a lot of financial support,” Winkler says. “Dismantling has already progressed too far – one would need to spend a lot of money to reverse it. I don’t see anyone in politics willing to spend the sums needed… it is a bit of a false discussion.”",
        "datetime":"2025-01-29T08:00:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]