[
    {
        "title":"Germany’s Sefe agrees green H2 delivery deal with Saudis",
        "subtitle":"(Montel) German gas importer Sefe and Saudi Arabia’s ACWA Power have signed a memorandum of understanding for deliveries of 0.2m tonnes of green hydrogen to Germany and Europe, the companies said on Monday.",
        "body":"The deliveries should start by 2030, with Sefe acting as co-investor and prime off-taker from ACWA Power production assets in Saudi Arabia, they added in a statement.\nThe deal combined ACWA Power’s expertise in green hydrogen with Sefe’s market knowledge, said ACWA Power CEO Marco Arcelli.\nSefe CEO Egbert Laege said the deal supported its supply security goals while driving the energy transition.\nSefe said it was also engaged in other hydrogen projects, such as converting parts of its 4,100km gas pipeline network in Germany, operated by the Sefe subsidiary Gascade, into a hydrogen grid, as well as a hydrogen storage project in the north of the country.\nThe EU has set itself the goal of producing 10m tonnes of green hydrogen, made with renewable energy, and importing another 10m tonnes by 2030 as part of its goal to reach climate neutrality by 2050.\nHowever, several hydrogen projects have recently been cancelled or postponed due to a gloomy economic outlook. Last Friday, Denmark scaled down a hydrogen pipeline project to Germany.",
        "datetime":"2025-02-03T10:15:36",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]