[
    {
        "title":"German solar installations hit record high 100 GW – regulator",
        "subtitle":"(Montel) German solar photovoltaic capacity surpassed the 100 GW mark for the first time in January, data from German energy regulator BNA showed on Tuesday.",
        "body":"Net additions of solar installations reached around 1.1 GW in January to bring the overall installed capacity rose to 100.8 GW, according to the BNA’s monthly statistics on the expansion of renewable energy sources in Germany.\nThe record was reached despite the additions in January being below the monthly average of 1.6 GW needed to achieve Germany’s target of 215 GW by 2030, as well as 700 MW below those added in December and around 500 MW below additions in January 2024.\nSince the end of 2023, solar installations have increased by around 18 GW, according to the data.\nNo offshore wind additionsMeanwhile, onshore wind capacity grew by 194 MW in January to a total of 63.8 GW, the data showed. This was roughly a 200 MW decrease from capacity added in December, but a slight increase compared with January 2024.\nHowever, the net additions in January were 528 MW below the 722 MW needed to achieve the 2030 onshore wind capacity target of 115 GW. Since the end of 2023, onshore wind installations have grown by 3.8 GW.\nIn contrast, there was no addition of offshore wind installations. The installed capacity of offshore wind remained unchanged at 9.2 GW in January, according to the BNA analysis. To meet the 2030 offshore wind target of 30 GW, a monthly addition of 293 MW is required.\nBiomass capacity increased slightly by 6 MW in January from the previous month to around 9.2 GW in total. Biomass has already exceeded the 2030 target of 8.4 GW of installed capacity.",
        "datetime":"2025-02-18T10:35:28",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        BIOMASS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]