[
    {
        "title":"German CDU pledges to cut power costs by EUR 50",
        "subtitle":"(Montel) The German Christian Democract party (CDU) has pledged to cut electricity costs by at least EUR 50 by reducing the power tax and grid fees, it said on Monday, three weeks ahead of national elections.",
        "body":"“Electricity needs to be cheaper for everyone,” said the alliance in a document seen by Montel that contains a list of measures the party would implement if it were successful in the 23 February vote.\nSeveral parties have promised to reduce energy bills for companies and households during the election campaign, with the governing Social Democrats (SPD) having promised to reduce the power tax from the current EUR 20.50\/MWh to EUR 0.50\/MWh, and transmission grid fees from EUR 66.50\/MWh to EUR 30\/MWh.\nCoalition?The two parties may need to form a new government coalition after the election if the alliance wants to keep the far-right AFD – currently polling at 20-22% – away from power as promised. The CDU\/CSU is polling at 30% and the SPD at 15-17%.\nGerman household electricity prices averaged EUR 409.20\/MWh in 2024, while small and medium-sized industrial companies paid EUR 169.90\/MWh and larger companies just under EUR 140\/MWh, according to analysis from the BDEW energy lobby.\nWhile prices were lower than in 2023, they were still elevated compared to levels before Russia’s invasion of Ukraine.\nMeanwhile, in Norway, the government last week promised to introduce fixed-fee contracts at EUR 34\/MWh for households, 12 times below Germany’s current household level, amid public discontent over energy prices. \nGermany’s day-ahead price on the wholesale market has averaged EUR 117.37\/MWh so far this year, and southern Norway’s EUR 70.12\/MWh.",
        "datetime":"2025-02-03T12:57:08",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]