[
    {
        "title":"Hafslund Celsio to build “milestone” CCS plant in Oslo",
        "subtitle":"(Montel) Norwegian district heat supplier Hafslund Celsio will proceed to build the world’s first large-scale facility for carbon capture from a waste incineration plant, despite investment costs nearly doubling to around EUR 800m, it said on Monday.",
        "body":"The facility at Klemetrsud, in the capital of Oslo, will capture 350,000t of CO2 a year annually when completed in 2029, three years behind the initial plan.\nThe carbon will be then shipped to the North Sea to be buried below the seabed as part of the wider Northern Lights CCS project.\n“This is a huge milestone. I am very proud that we are now ready to resume the implementation of one of Norway’s largest and most important climate and industrial projects,” said Martin Lundby, CEO of Hafslund Celsio.\nThe company, majority owned by the city of Oslo, said it will proceed to invest in the project despite the costs rising from an initial budget of NOK 4.8bn (EUR 408m) to NOK 8.3bn. The start date has also been postponed by three years compared to the original plan.\nThe Norwegian state has agreed to cover NOK 2.5bn of the costs, while the City of Oslo will cover NOK 2.6bn, with the plant being central to its 2030 climate reduction targets.\nEUR 1 = NOK 11.77",
        "datetime":"2025-01-27T08:14:53",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]