[
    {
        "title":"IEA chief slams Europe for strategic energy errors",
        "subtitle":"(Montel) Europe’s strategic errors on natural gas, nuclear and solar policies have left its industry facing a major energy cost gap compared with global rivals, said International Energy Agency executive director Fatih Birol on Wednesday.",
        "body":"“Over-reliance on gas from a single country, dropping the ball on solar energy and turning our back on nuclear power in Europe were key strategic mistakes,” he told a Financial Times event in Brussels.\nThe EU used to import nearly half its gas from Russia before supply dwindled after Moscow’s 2022 invasion of Ukraine and the Nord Stream explosions in September that year, pushing EU energy prices to record highs and the bloc to turn to other energy sources, mainly US LNG.\nThe mistake was relying so much on a single source, not Russia specifically, said Birol. “It could have been any country.”\nNuclear challengeHe also berated Europe for losing its global leadership in solar energy manufacturing to China. It was too late to regain it in solar, but he saw potential for Europe to be a global industrial leader in areas such as batteries, wind and grid development.\nBirol noted that EU governments’ decisions – particularly in Germany – to move away from nuclear power was before the bloc realised it would need more low-carbon, affordable, reliable baseload power to meet its climate and industrial competitiveness goals.\nAt the same time, Europe’s few new nuclear projects in the UK, France and Finland had on average taken up to 10 years longer to complete and been more than twice as expensive than planned, he added.\nHe said he saw renewables as the major element in the EU’s future energy mix, but nuclear still had a role, particularly through lifetime extensions for existing plants.\nNew nuclear plants, however, would likely need government support via some kind of long-term revenue guarantees to be viable, and a “more disciplined” nuclear industry, he said.\nThe European Commission has pledged to lower energy prices for industry to help it remain competitive in the global market as the EU continues to decarbonise.",
        "datetime":"2025-02-05T11:39:42",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]