[
    {
        "title":"IEA nudges up global oil demand outlook on improving economy",
        "subtitle":"(Montel) The International Energy Agency has upwardly revised its world oil demand outlook for this year, thanks to an improving world economy, with enough supply to meet the growth.",
        "body":"World oil demand would grow from around 102.9m bbl\/day on average last year to almost 104m bbl\/day in 2025, up 0.1m bbl\/day from its forecast a month ago, the Paris-based intergovernmental body said on Wednesday.\nIt mainly attributed the annual demand growth of 1.05m bbl\/day to “a gradually improving economic outlook for developed countries”.\nChina, Brazil and India, meanwhile, will account for around half of the global gains in demand growth in 2024-25, compared to over two-thirds for China alone in 2023, according to the IEA. \nThe contribution from developed nations “will remain minimal, with minor increases in the United States and South Korea counterbalanced by stagnation or declines elsewhere”.\nSufficient supplyThe IEA reckoned the world would have enough oil supply to meet demand, notwithstanding the current voluntary production cuts by the Opec+ alliance, fresh US sanctions on Russia’s oil sector and weather-related disruptions.\nIt forecast global oil supply to rise from 102.9m bbl\/day last year to a record 104.7m bbl\/day this year, driven mainly by robust production from non-Opec nations, such as the US and Brazil.\n“If decreases in supply from weather impacts, sanctions or other developments become substantial, oil stocks can quickly be drawn to meet operational requirements in the near term,” the IEA said.\nNon-Opec+ producers would add another 1.5m bbl\/day of supply in 2025, the same as in 2024, led by the US, Brazil, Guyana, Canada and Argentina.\nMeanwhile, Opec+ members planned to “unwind extra voluntary production cuts and could ramp up if needed”, the IEA said. “Those additions should cover both potential supply disruptions and expected demand growth.”\nIn oil trading, the front-month contract for Brent crude North Sea oil last changed hands up USD 0.28 at USD 80.20\/bbl on Ice Futures, while the WTI equivalent stood USD 0.35 higher on the day at USD 77.85\/bbl.",
        "datestamp":"15-01-2025",
        "category":[
            "OIL"
        ]
    }
]