[
    {
        "title":"IEA head blames “insane” regulations for EU nuclear setbacks",
        "subtitle":"(Montel) “Insane” nuclear safety regulations are in part to blame for the delays and cost overruns that have plagued Europe’s recent nuclear projects, the head of the International Energy Agency (IEA), Fatih Birol, said on Wednesday.",
        "body":"Whilst European regulators were “doing a good job”, some “insane” regulations were delaying the construction of reactors and increasing costs, compared to countries outside the EU, he told a nuclear conference in Paris.\n“It may be good, in light of recent technological developments, to have a fresh look at the regulations we have,” he said.\nWestern Europe’s latest new-generation reactors, the 1.6 GW Olkiluoto unit 3 in Finland and the 1.6 GW Flamanville unit 3 in France, each came in billions of euros over budget and more than a decade behind schedule. \nNuclear safety levels were bolstered in the wake of the accident at Japan’s Fukushima nuclear power plant in 2011 raising costs of maintaining reactors. This led some governments to reverse plans to extend units and build new reactors.\nGas substitute neededNow, in the wake of the energy crisis and spurred by the war in Ukraine that led to a curtailment of gas flows from Russia, utilities in Europe are touting ambitious plans to build new nuclear power plants.\nTo get plans off the ground, governments had to provide mechanisms to reduce the risk for investors, Birol said. \n“In some cases, [the states should] at least partially guarantee the flow of revenues … to support and remunerate nuclear’s secure and clean electricity supply.”\nHe also warned European nations against overreliance on Russian fuel, as despite EU attempts to diversify, the country was responsible for 40% of the world’s uranium enrichment capacity, he added.\nFrance’s nuclear safety authority, the ASNR, did not immediately reply to Montel’s request for comment, regarding the IEA chief’s comments.",
        "datetime":"2025-02-12T16:07:07",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]