[
    {
        "title":"Italy mulls comprehensive discounted gas price measures",
        "subtitle":"(Montel) Italy is considering expanding its discounted gas price mechanism beyond hard-to-abate industry to also mitigate the impact of soaring bills on households, the energy minister said on Monday.",
        "body":"“We may need temporary measures similar to those introduced for major electricity users with the ‘energy release’ [programme] that benefitted some 4,000 industrial users across the nation,” Gilberto Pichetto Fratin said in a radio interview. \n“We now need to think about energy-intensive gas users, though if prices don’t decrease, we must also intervene on overall gas prices which affect everyone, including residential users.”\nThe Italian government introduced a “gas release” programme to support energy-intensive industries, such as chemicals, paper, ceramics and cement, by allocating domestically produced gas at regulated prices.\nPichetto Fratin also said he had asked the European Commission to cap gas prices on European markets.\n“If the EU even just threatens a price cap, it would limit speculation,” he said, without providing information on levels at which the cap should be introduced, or if the EC was considering the measure.\nLast month, the European Commission said it would not propose extending a gas price cap mechanism introduced in 2022 and which expired on 31 January.\nDeclining gas storage levelsThe energy minister also expressed concern over the effects soaring prices would have on Italy’s need to replenish its gas storage facilities after the winter. \nTypically, gas injections are carried out between April and October, with the first auctions held in early April, and gas is withdrawn during winter months when demand peaks. However, Pichetto Fratin said he had already ordered the first refills.\nIn January, he said Italy was considering bringing forward some of the gas storage auctions to help safeguard consumers from potential price spikes.\n“We have fairly good storage levels, but we are drawing them down and will need to replenish them,” the minister said. “Buying at above the EUR MWh we paid at the time of filling becomes a serious problem.”\nItalian storage levels are currently at 62.7% compared to the European average of 53.1%. Italy’s PSV spot is trading at EUR 54.4\/MWh, in line with its summer contract which is currently being exchanged at EUR 54.5\/MWh.\n“This weighs on us much more because we are very dependent on gas for thermal power stations’ generation,” Pichetto Fratin said, adding that power demand was expected to “explode” in coming years.\nItaly relies heavily on gas, which fuels nearly half of the country’s electricity generation, with gas imports exceeding 90% of total consumption.",
        "datetime":"2025-02-03T10:23:35",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]