[
    {
        "title":"Italy eyes new rules to boost biomethane as substitute for gas",
        "subtitle":"(Montel) Looming Italian rules to help decarbonise industry may seek to boost biomethane uptake as a substitute for natural gas under a scheme that mirrors a policy recently deployed for renewable energy, experts told Montel.",
        "body":"Italy was looking to guarantee a discounted price of gas to industrial consumers willing to enter a biomethane purchase agreement (BPA) in the same way it guaranteed cheaper electricity to industrial consumers that entered deals to develop solar and wind power, experts said. \n“This would be really a smart move, because of the potential biomethane has in Italy,” said Lorenzo Parola, managing partner at law firm Parola Associati. “It would boost BPAs by encouraging direct involvement from gas-intensive industries.”\nBiomethane is an upgraded form of biogas typically produced through agricultural waste or energy crops.\nIn 2024, Italy’s industrial gas consumption was 11bcm and the country could produce up to 5bcm of biomethane annually by 2030 based on EU estimates, said Matteo Melotti, energy expert at consultancy Fedabo.\n“The opportunity for [the Italian] industry to decarbonise could account for 10-15% of its natural gas consumption,” said Tomas Carini, a consultant at Fiordaliso Business Development.\nAutomatic GO cancellationThe country’s biomethane sector is awaiting details of a new law that introduces crucial incentives for hard to abate industries. This follows a recent consultation conducted by Italy’s state-owned energy services company GSE.\nA key aspect was the potential for the government to cancel guarantee of origin (GO) certificates associated with the gas, Melotti said, with such certificates verifying the environmental integrity of clean energy production.\nCurrently, biomethane producers receive feed-in tariffs that are reduced by the cost of GO certificates they can sell. By automatically cancelling the GOs, which can be worth EUR 12-20\/MWh, the government would effectively hand parties to a BPA more value to split between themselves.\n“This system recognised benefit can be shared between the parties, encouraging consumers to sign BPAs while allowing producers to gain an additional advantage by selling directly to an industrial consumer rather than through the market,” Melotti said.\nProduction costsBiomethane production costs in Europe averaged around EUR 87\/MWh in 2021, according to the Biomethane Industrial Partnership, a lobby group to promote the EU’s goal of producing 35bcm of sustainable biomethane by 2030.\nThis makes biomethane more than double the average price of gas on Europe’s benchmark TTF hub last year.\nHowever, large-scale projects could deliver production costs of EUR 54\/MWh, allowing them to be competitive when carbon prices were above EUR 64\/t, said the lobby group. \nThe absence of a need to buy emissions allowances for biomethane was another factor that could make BPAs lasting 10 to 15 years appear attractive for those seeking long-term security, Melotti said. \n“Right now, there is much more demand than supply,” Parola said. “There are very few producers but a lot of industrial interest in BPAs, which is creating an imbalance.”\nBiomethane producers lacked familiarity with market dynamics, making it difficult to position themselves strategically, said Fiordaliso’s Carini.\n“While many are still currently on the sidelines, they will eventually need to secure buyers before injecting biomethane into the grid.\nFinancial instability?“Banks will also require long-term contracts as a condition for financing. Without market knowledge and a structured strategy, producers risk financial instability and missed opportunities,” he added.\nTo address supply constraints, industry stakeholders are calling for additional biomethane auctions under the existing support scheme managed by the GSE.\nItaly aimed to allocate nearly EUR 2bn across five competitive tenders to increase biomethane production to 2.3bcm\/year by 2026. The final auction’s bid submission closed last month.\nThe EU aims to meet 10% of its gas consumption as part of its RePowerEU plan to substitute Russian fossil fuels.\nThis is an online version of an article published in Montel’s Energy Transition Weekly last Friday.",
        "datetime":"2025-02-10T13:36:03",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]