[
    {
        "title":"Italy seeks lower EU gas storage targets to ease prices",
        "subtitle":"(Montel) Italy is pushing for a “reasonable” lowering of European gas storage filling targets as current requirements may be driving up costs unnecessarily, a senior official told Montel.",
        "body":"“Reducing storage filling obligations decreases quantities and, consequently, tends to lower prices,” said Federico Boschi, head of the energy department at Italy’s environmental and energy ministry, late on Monday.\nHe said lower demand could help ease market tensions and emphasised the importance of “being reasonable” in balancing energy security needs with price stability.\nBoschi said Germany also believed storage filling constraints should be reviewed, and Italy was open to discussions on lowering them.\nItaly’s gas storage was last seen at nearly 63% full, exceeding the EU average of just under 53%, Gas Infrastructure Europe data showed. Compared to the same period in 2024, storage levels are down 1 percentage point in Italy and 17 percentage points across the EU.\nEU regulations require storage to be 90% full by November 1, along with intermediate targets. However, the legislation is due to expire at the end of 2025, unless it is extended.\nEarlier auctionsBoschi noted that Italy announced plans a fortnight ago to start storage filling via auctions earlier, perhaps by mid-February rather than April as usual.\n“In a tight gas market, this approach prevents overly concentrated purchasing or transportation orders by spreading them over time,” he said.\nBoschi said the introduction of incentives for gas storage Italy in 2022 – and currently under consideration in Germany – “is something to be assessed in due time”.\nGas price spreadA key priority for Italy is eliminating the gas price spread between the Dutch TTF and the Italian PSV as Italian gas consistently trades at a premium over the European benchmark.\nThe PSV-TTF annual average spread reached EUR 2.02\/MWh in 2024, the highest premium since 2019, when it averaged EUR 2.55\/MWh. \nHe said Italy’s import costs remained “nearly identical” at import points for northern European gas deliveries whether it received supplies from there or not.\nThese fixed import costs affected its overall gas price despite receiving the country receiving most of its gas supply from southern suppliers like Algeria or Azerbaijan, he said.\nItaly was working on a solution that can be implemented without negotiations with northern European countries, he added, without providing further details.\nUpdates article to correct EU storage percentage change.\nUpdates article to correct reference to 2022 storage incentives introduction.",
        "datetime":"2025-02-04T09:21:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]