[
    {
        "title":"Italy red tape delays 8 GW interconnections – consultant",
        "subtitle":"(Montel) Italian regulatory hurdles and TSO Terna’s lack of support is delaying more than 8 GW of interconnections, an industry expert told Montel, while others agreed projects were being held up that could reduce power prices.",
        "body":"Key challenges included Italy’s unsynchronised permitting process with neighbouring countries, as well as engaging communities and managing costs, especially for underground cables in the mountainous north, said Giuseppe Gatti of consultancy Energy Advisors. \nThe most advanced projects from private developers, known as merchant lines, are mainly on Italy’s northern border, where up to 1 GW could be quickly developed, said Gatti, who is advising on a new 300 MW interconnection with Austria.\nDevelopers of these interconnections take on investments typically handled by TSOs, recovering costs over 8-12 years. However, after this period, Italian law requires the asset to be sold to the TSO, he said. \nTSO hesitance“All TSOs, especially Terna, see these projects as intrusions and are very conservative in assigning net transfer capacity (NTC),” he said.\nThe NTC is the maximum capacity an interconnector can import or export, determined by TSOs.\n“Terna is reluctant to invest in these projects and often discourages them by assigning capacities that make them financially unviable,” Gatti said, pointing to an example of a 200 MW project receiving an NTC up to 75% lower.\nNo appeal process existed, Gatti said, calling for an independent authority to define capacity allocations. \nTerna declined to comment when contacted by Montel.\nLower power pricesHe agreed with Riccardo Siliprandi, senior principal at Afry in Italy, that more interconnections would lower power prices and boost exports.\nStrengthening the interconnection with Austria could partially reduce Italy’s current spot power price differential of EUR 9.53\/MWh, said Gatti, to a range of EUR 8-12\/MWh.\nIn 2024, more than 84% of Italy’s power imports came from France and Switzerland. Austria accounted for 5%, Slovenia for just over 3%, while the rest was shared between Montenegro, Greece, and Malta.\nLast year, French power prices were lower than Italy’s 97% of the time, according to GME energy exchange and LSEG Data & Analytics.\n“Interconnections are key for renewables integration, given the complementarity between wind power in northern Europe – stronger at night and in winter – and solar in the south, which peaks in summer and during the day,” said Siliprandi. \nItaly’s current merchant line projects include plans for two cables of 2 GW each to Tunisia and a 2 GW interconnector with Spain.",
        "datetime":"2025-02-13T13:54:59",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRANSMISSION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]