[
    {
        "title":"Italian subsidies hamper uptake of utility PPAs – consultancy",
        "subtitle":"(Montel) Utilities’ prices for power purchase agreements (PPAs) in Italy remain stable but they are still too low to compete with state-backed programmes, Italian consultancy Elemens told Montel on Thursday.",
        "body":"Andrea Marchisio, partner at Elemens, said a 10-year pay-as-produced solar PPA starting in 2026 would reach a maximum offer of EUR 61\/MWh, with the price dropping to EUR 55.60\/MWh for projects set to begin operations in 2027 and to EUR 51.50\/MWh for a 2028 start.\nThe data came from a survey of five major utility off-takers in Italy, conducted by Elemens.\nThese prices are lower than the EUR 65\/MWh available under Italy’s energy release scheme – a contract for difference mechanism where industrial consumers can secure renewable power at that capped price in exchange for committing to building renewable power capacity.\nUtility PPA prices are also below the anticipated pricing for the government’s green capacity auction schemes, known as Fer X, with reference prices for solar and wind set at EUR 80\/MWh and EUR 85\/MWh, respectively.\nThe Italian PPA market remained strong last year, with nearly 1 GW contracted in 2024, little changed from 2023.\nCorporate PPA premiumCorporate PPAs accounted for one-third or 587 MW of 2024’s total deals, marking an increase from the 470 MW recorded in 2023, said Marchisio. Elemens’ estimates showed corporate PPA prices tended to be around EUR 5-15\/MWh above the price of utility PPAs, he said. \n“This is partly due to the growing awareness among industrials… and their increased willingness to commit to long-term agreements,” he said. “On the other hand, it also reflects the declining attractiveness of utility PPAs as traders struggle to offer truly competitive prices.”\nHe said the Italian government was preparing new regulations aimed at improving the bankability of corporate PPAs.\nIn December, the government said it would introduce state guarantees for renewable PPAs, with state-owned energy services company GSE acting as guarantor of last resort.",
        "datetime":"2025-02-06T15:18:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]