[
    {
        "title":"Italy calls for EU energy market unity to compete globally",
        "subtitle":"(Montel) Italy’s foreign minister has urged EU member states to swiftly integrate their energy markets to unify prices and combat rising industrial costs whilst bolstering the region’s competitiveness against global rivals.",
        "body":"Antonio Tajani said the move was a strategic necessity due to heightened competition from emerging and industrialised economies. \nRather than competing on energy prices, European nations should strengthen their internal market integration, he said during a hydrogen event in Rome Tuesday.\n\"The solution among the European Union is to have only one energy market because competition among Europeans is a big mistake,” Tajani said. \n“We need to be the strongest in the world because now our competition is with North Africa, with Russia, with China, with India, with the new countries in South America and in Africa,” Tajani said.\nHis comments come following the inauguration of Donald Trump as the US president on Monday. Trump declared a national energy emergency to unleash fossil fuel production with the aim of reshaping global energy markets.\n“We need a market with uniform prices, similar to a single capital market with the same rules that produce uniform and competitive conditions as well as power and gas prices,” Massimo Medugno, who heads Italian paper industry association Assocarta, told Montel.\n“Gas is used to generate electricity, and it’s essential for those who need thermal energy like paper mills, ceramics, chemicals.”\nRisk to economiesA single energy market would help restore competitiveness to European industry and boost economic growth across the region, Medugno said. \nIf this is not done, he said, Europe “risks not being competitive with the US, China, India” with negative consequences on industry and the local economies.\nThe European Commission has long championed an integrated electricity market across the 27-nation bloc, with new market design rules and amended regulations adopted last year. Still, Italian foundries have in past months already called for a single power price across the EU.\nEnergy costs significantly impact the EU’s global competitiveness, in contrast with other industrialised regions including the US.\nEU wholesale gas prices were nearly five times higher than US prices, a significant challenge for the region’s industrial competitiveness, according to think tank Bruegel.\nThe price disparity stems from the EU’s reliance on imported fossil fuels, while the US is a net energy exporter.\nItaly hit hardestItaly suffers more than other EU nations, and its industry has grappled with wholesale power prices that rose some 38% in early 2025, averaging EUR 150\/MWh, according to data from Italian industry association Confindustria.\nMeanwhile, gas-fired power generation accounts for 42% of Italy’s power mix. \nThe high electricity prices and strong reliance on gas are “a cry of alarm”, Confindustria’s delegate for energy, Aurelio Regina, told an Italian parliament hearing on Monday.\n“We do not expect significant improvements for 2025, and therefore we will have to work while waiting for nuclear power to present itself as an opportunity in the Italian production mix; thus, new generation nuclear power which will unlikely be available before 8-10 years,” he added.",
        "datestamp":"22-01-2025",
        "category":[
            "ELECTRICITY",
            "GAS",
            "HYDROPOWER",
            "OFFSHORE WIND",
            "RENEWABLES",
            "SOLAR",
            "WIND"
        ]
    }
]