[
    {
        "title":"Limited new capacity to keep EU gas supply tight – TotalEnergies",
        "subtitle":"(Montel) Europe’s gas supply will likely remain tight this year due to “very limited” new capacity, keeping prices above USD 13MMbtu (EUR 43\/MWh) in the first quarter, French energy giant TotalEnergies said on Wednesday.",
        "body":"It cited robust winter consumption and “rapid inventory declines” in Europe for underpinning gas prices, particularly with the stoppage of Russian gas flows to Europe via Ukraine at the start of the year when a five-year contract terminated.\nEurope’s benchmark gas price, the TTF front month, was last seen trading at EUR 52.46\/MWh on Ice Endex – well above the average of EUR 34.60\/MWh in 2024 and EUR 41.38\/MWh in 2023.\nAverage selling priceTotalEnergies estimated its average LNG selling price to be above USD 10\/MMbtu (EUR 33.02\/MWh) in Q1, up from an average of USD 9.80\/MMbtu (EUR 32.36\/MWh in 2024, due to the recent increase in gas prices and the lag effect on price formulas.\nAs such, the group expected to sell more than 40m tonnes (54.6bcm) of LNG this year, compared with 39.8m tonnes last year – which was a 10% drop from 2023. Last year, it signed 6m tonnes (8.2bcm) of new medium-term supply contracts in Asia.\nStill, the company’s adjusted net income of its LNG branch fell 21% last year to USD 4.9bn (EUR 4.7bn), mainly due to “lower average LNG selling prices and low market volatility during the first three quarters, that impacted gas trading results,” it said.\nThe firm expected to grow its oil and gas production by more than 3% this year with several ramp-ups and start-ups, as reported by Montel in October.\nHigher power outputTotalEnergies said it expects its power generation unit to produce more than 50 TWh this year, compared to 41.1 TWh last year.\nThe company’s power division’s adjusted net income rose 17% last year to USD 2.2bn, mainly due to a 38% increase in renewable output, which accounted for more than 60% of the overall power production. Its gross installed renewable capacity rose by 3.36 GW to 26 GW at the end of 2024.\nIt expected net investments to remain about stable at USD 17-17.5bn this year, including USD 4.5bn, or USD 0.5bn less than last year, allocated for low carbon energy.\nTotalEnergies said its overall adjusted net income slid 21% to USD 18.3bn in 2024, citing a sharp decline in refining margins following “two exceptional years”.",
        "datetime":"2025-02-05T08:53:18",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]