[
    {
        "title":"Limiting cross-border power trade “detrimental” to EU – analyst",
        "subtitle":"(Montel) The likes of Norway and Sweden have little to gain by cutting cross-border power trade with neighbours in order to curb domestic prices as “protectionism [is] detrimental for [EU] energy security and prices”, said an analyst.",
        "body":"“Politically, protectionism is on the rise. In some respects, countries do need to take steps to support their local economies. But I am sceptical whether limiting trade is the right measure,” Siddhart Iyer from Swedish consultancy ELS Analysis told Montel this week.\nHe was commenting on the growing opposition to power exports in energy-rich Sweden and Norway, which had recently seen price spikes due increased flows to the likes of Germany amid shortages there.\nLittle to gain?The Nordic countries had little to earn, for example, by threatening Germany and other countries with cutting exports, said Iyer.\nOnly 5% of Germany’s electricity consumption came from imports and the country could easily increase its self-reliance by using more gas-fired output, he added.\n“But this would unnecessarily draw on European gas storage, which would be detrimental for both energy security and prices across the EU,” he said.\nLocking in electricity within one country could also lead to surpluses that reduced earnings for national power producers and could also limit import possibilities at times of shortage leading to huge price spikes, he added.\nSuch a unilateral policy would therefore only increase volatility as interconnectors helped balance out scenarios where there was too much power or not enough, said the analyst. \nYesterday, local media reported a spat over energy policy could topple Norway’s government, with the Centre party threatening to quit if its Labour coalition partner implemented the EU’s co-called clean energy package and gave more sovereignty to Brussels.\nRenegotiation urgedThe Centre party also urged a renegotiation of deals governing trade on power links to Germany and the UK with the aim of reducing exports when prices are high.\nMoreover, several Norwegian parties have opposed a potential renewal of the two oldest power links to Denmark (500 MW), when they reach the end of their lifetime later this decade. \nThe Norwegian and Danish energy ministers will likely discuss this issue at a meeting today.\nLast year, meanwhile, the Swedish government axed plans for a 700 MW interconnector to Germany.",
        "datestamp":"23-01-2025",
        "category":[
            "ELECTRICITY"
        ]
    }
]