[
    {
        "title":"Looming US tariffs on Europe may threaten energy transition",
        "subtitle":"(Montel) A US trade war with Europe could threaten the bloc’s energy transition and deter investment in clean technologies, although some experts believed Donald Trump’s moves could be an opportunity for the region.",
        "body":"The EU was “definitely” next on the American president’s list of countries targeted by sweeping tariffs after Mexico, Canada and China, he told reporters on Sunday, sparking concerns of a spiralling trade conflict.\nTaxing imported goods from the 27-nation bloc could slow economic growth in the region as its trade surplus with the US had “increased significantly in recent years,” said Ignacio Urbasos, energy and climate researcher at Spanish think tank Elcano.\nLast year, the EU’s trade surplus with the US reached USD 236bn, with Germany raking in USD 85bn, Italy 44bn and France EUR 16.4bn, US government data showed.\nEconomic slowdownIn a report published on Wednesday, the German Economic Institute also estimated that disruption to supply chains would likely lead to a relative economic slowdown and cost the German economy EUR 25bn over the next two years, with a global trade war acting as a “poison for the investment climate”.\n“Tariffs are never good for domestic industries, and that will affect production and therefore [energy demand],” said Matthew Jones, head of power analytics at Icis.\nAnd the mere prospect of new tariffs was enough to paralyse investment decisions for clean technology projects in Europe, said Nicolas Berghmans, director at French think tank Iddri.\nFurthermore, a prolongation of tariffs could lead to decarbonisation projects in Europe being postponed, cancelled or relocated to the US, Nicolas de Warren, head of France’s power-intensive industry lobby, Uniden.\n“Some companies already think it’s better to invest in the United States rather than in Europe, [and] this could be an aggravating factor in future investment location decisions,” he said.\n“For the energy transition as a whole and for shifting towards clean energy at the lowest cost possible, it’s clearly not good to lack a partner across the Atlantic,” said Ben McWilliams, affiliate fellow at Brussels-based think tank Bruegel.\nHowever, Trump’s executive order rescinding financial support distributed via the Inflation Reduction Act (IRA) could make Europe more attractive, he added, citing Chinese battery manufacturing company CATL’s decision to open a new factory in Spain.\nPositive impact?“What’s happening is paradoxically an opportunity for Europe… investments that cannot be made in the United States will be able to come to Europe if the right conditions are there,” said Jules Nyssen, head of France’s SER renewables lobby.\nNew trade rules could also force the European Commission to speed up the adoption of the Net Zero Industry Act (NZIA) to protect European value chains, he added.\nThe European Commission, meanwhile, has said it would “respond firmly to any trading partner that unfairly or arbitrarily imposes tariffs on EU goods”, citing the risk of “unnecessary economic disruption” and increasing inflation.\nBehind the scenes, the EC had started working on possible retaliatory tariffs over the past few months, according to Genevieve Pons, head of the Europe Jacques Delors think tank and honorary director of the EC.\nA dedicated team to select specific American goods had been set up and regular meetings “at the highest level in Washington” had been conducted, she told Montel.\nFollowing the meeting with EU leaders on Monday in Brussels, the president of the EC, Ursula von der Leyen, said the EU would “prioritise productive discussions and engaging early” with the United States.",
        "datetime":"2025-02-05T14:31:13",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]