[
    {
        "title":"Low capture rates, weak power prices curb Nordic PPAs – Alpiq",
        "subtitle":"(Montel) Low capture rates and wholesale power prices are making it harder to strike long-term power purchase agreements (PPAs) in the Nordic market, the head of northwest European operations at Swiss energy group Alpiq told Montel.",
        "body":"“I think the market for Nordic PPAs is not as healthy as it used to be,” Matti Ahtosalo said at the E-World energy fair in Essen, Germany.\nA rapid ramping up of wind and solar production has reduced the capture rates of such plants, making it increasingly risky for power plant developers to sign up to the fixed baseload PPAs that are still preferred by large consumers, said Ahtosalo.\n“So now, asset owners are asking for pay-as-produced contracts to reduce risks. But when you use a smart mathematical model to calculate what you can get in a pay-as-produced contract then you end up with a level that is too low to trigger an investment decision [in new capacity],” he added. “It is not as easy as before to develop PPAs.”\nAhtosalo said that Alpiq and other third parties were constantly working to bridge the gap in expectations and facilitate PPAs, but that in the current environment it was easiest to sign deals with moderate volumes and lengths due to risks related to low wholesale power prices and capture rates.\nNot over yetThe CEO of Norwegian aluminium producer Norsk Hydro recently told Montel that the era of large-scale PPAs was “over”.\nHowever, Ahtosalo said that he thought this was an exaggeration. “Right now, it is impossible to transact big PPAs because no one is willing to carry the risk,” he said. “But if for example there is a big consumer who needs a huge amount of power for the long-term and somebody is there with a big wind farm, it could be possible to structure a deal.”",
        "datetime":"2025-02-13T13:31:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]