[
    {
        "title":"Model highlights “confidential” Swedish grid bottlenecks – analyst",
        "subtitle":"(Montel) A computer model from Montel Analytics can pinpoint Sweden’s restricted internal grid bottlenecks to make price forecasts more accurate following the launch of flow-based market coupling, said Aleksei Selesznev, an analyst from the group.",
        "body":"Information regarding such bottlenecks was currently encrypted for national security reasons and was the “most annoying part of the current flow-based market coupling set-up”, he added, referring to the lack of transparency in the system launched last October aimed at improving the utilisation of grid capacity in the Nordic day-ahead power market.\nThe fact information regarding the bottlenecks was encrypted made it difficult to analyse the physical power market and made price forecasting less accurate, said Selesznev.\nLobby group Swedenergy has said previously the introduction of flow-based market coupling had exposed the challenges of the country’s strict confidentiality legislation on grid infrastructure.\nSecurity issue?This legislation prevents TSO Svenska Kraftnat from sharing information about critical parts of the electricity grid with market participants and is unique to Sweden.\nHowever, Seleznev said, the model devised by Montel Analytics analysed open-source data and could find “fingerprints” that identified the bottlenecks, given insights into their location, though it “is not 100% accurate”.\nSweden should not keep such information confidential as “a lot of public maps are available with this critical infrastructure such as roads, bridges, power plants and [TSO] Svenska Kraftnat provides schematical grid maps as well”, he added.\nThe Nordic region introduced flow-based coupling – a calculation method widely used in other continental European power markets – on the day-ahead power market in October last year to improve the utilisation of existing grid capacity.",
        "datetime":"2025-01-28T09:11:05",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRANSMISSION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]