[
    {
        "title":"Nordic power prices too low for new capacity – Fortum CEO",
        "subtitle":"(Montel) Nordic power companies need higher prices to invest in new capacity, Finnish energy firm Fortum said on Tuesday when launching a feasibility study into pumped hydro storage in Sweden.",
        "body":"“Structurally, Nordics are a good place to invest in. We have the lowest cost of energy in Europe but new capacity will not come with these prices,” CEO Markus Rauramo said in a teleconference.\nThe statement comes as Fortum’s full-year operating profit dived 20% year on year to EUR 1.32bn, while the average sales price for its Nordic output slid 16% last year.\nThe Nordic front-year power traded at EUR 37.70\/MWh on Tuesday, significantly below German levels of EUR 103\/MWh.\n“If the market sentiment and investment environment improve and projects meet our investment and profitability criteria, we will make new investment decisions,” Rauramo said.\nAt the moment, “the prerequisite for making any investment decisions on new renewables is that they are linked to profitable PPAs,” he added.\nThe firm’s expected three-year capital expenditure dropped from EUR 1.7bn to EUR 1.4bn for the years 2025-2027, compared to the 2024-2026 period.\nNew pump storage, nuclear?For the longer term, Fortum has launched a two-year study on a possible new pumped hydro storage in Sweden.\nRauramo said pumped hydro storage would provide “much-needed flexible balancing power” thanks to its ability to produce, store and consume electricity “during long periods of time and in big amounts”.\nFortum is also finalising a two-year feasibility study on new nuclear power.\n“At Fortum, we consider it positive that the Swedish and Finnish governments are investigating financing and risk-sharing models,” Rauramo said.\n“However, we are still very far from required technical and profitability conditions and making any potential investment decisions,” he added.",
        "datetime":"2025-02-11T13:29:03",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]