[
    {
        "title":"Nordic power futures set to hit fresh multi-year lows – analyst",
        "subtitle":"(Montel) The Nordic Q2 power contract – already trading at around a five-year low on a rolling basis – is set for further falls if the unseasonably wet and wild weather persists amid strong hydropower levels, an analyst said on Wednesday.",
        "body":"“I don’t think we have seen the end to the downside yet. The [Q2] contract could drop some more euros if February turns out as mild as current forecasts suggest,” Johan Sigvardsson, chief analyst at Swedish supplier Bixia, told Montel.\nPrices were under pressure from very high hydropower reserves and muted demand, with industrial consumption not likely to rise significantly before 2029, with many green hydrogen projects having been postponed or scaled down, he added.\nMeanwhile, the region currently had close to 20 TWh more potential hydropower output stored in reservoirs, snow and soil than normal, according to Montel Analytics.\nSingle digits?In a low-price scenario, spot prices could drop towards the single-digit levels seen in 2020, when the Nordic system price averaged EUR 5.61\/MWh in Q2 and EUR 8.88\/MWh in Q3, said Sigvardsson.\nAn increase in installed solar capacity could also add more bearish pressure to spot prices from April, he said, though added support might come from higher prices elsewhere in Europe determined by the short-term marginal cost of gas-fired power production.\nThe Q2 contract was last seen at EUR 18.10\/MWh on Wednesday, slightly above the contract low of EUR 16.60\/MWh from 10 January but almost half the EUR 34\/MWh it was trading at this time last year, while the Q3 contract was at EUR 17.35\/MWh.\nTraders recently told Montel that liquidity in the Nordic financial power market was set to rise for the third consecutive year in 2025 amid the historically low prices.",
        "datestamp":"22-01-2025",
        "category":[
            "ELECTRICITY"
        ]
    }
]