[
    {
        "title":"Nordic power faces setback with Norway’s fixed price – Sweden",
        "subtitle":"(Montel) Norway’s plan to fix retail electricity prices at NOK 400\/MWh (EUR 34\/MWh) could curb liquidity in the Nordic power futures market and dampen overall market sentiment, Sweden’s energy authority has warned.",
        "body":"“It is too early to say what the result of the Norwegian proposal will be. But we want to emphasise that price signals must be respected,” Alejandro Eguez, analyst at the authority, told Montel.\nHowever, he said a fixed price would remove incentives to move consumption from peak demand hours to low demand hours as encouraged by authorities for years.\nNorway’s Labour government said on Friday that it planned to launch a fixed retail price of NOK 400\/MWh from 1 October to help ease costs for household consumers.\nBut Eguez said that having a fixed retail price meant that the Norwegian state would at times have to cover the risk of buying power at a higher price in the wholesale market – which would also reduce suppliers’ incentives to hedge in the futures market.\n“Then liquidity in that market decreases further, making it more difficult for other actors in our Nordic market to hedge their prices,” he said.\nFor instance, he pointed out that Norway’s fleet of 750,000 electric cars generally charge during nighttime hours. However, a fixed price meant that EV owners could charge during the day when the grid is more strained – which could drive up the need for grid balancing resources, and prices.\nUndermining flexibility?Several experts have also criticised Norway’s proposal for potentially undermining current policies aimed at increasing end-user flexibility.\nGerard Doorman, an independent consultant and former market design expert at TSO Statnett, said the proposal was deplorable as it would reduce any incentives for households to save power, noting end-user flexibility was crucial to reduce the extent of price spikes in Norway.\n“It is very frustrating that this aspect, that we have a system that needs this flexibility, is absent from the Norwegian discussion,” he said.\nJens Stoltenberg, Norway’s new finance minister, acknowledged that the proposal was not ideal from a perspective of deregulated markets when asked by Montel on Tuesday.\nHowever, he said some measures were politically necessary when referring to the fixed price proposal and the current support scheme that reimburses Norwegian households for 95% of the costs above NOK 750\/MWh.\nNorwegian households have grown discontented by the high volatility of power prices, partially exacerbated by cross-border flows with other European nations.\nEUR 1 = NOK 11.65",
        "datetime":"2025-02-05T11:48:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]