[
    {
        "title":"Nordic power market liquidity set to rise for 3rd year running",
        "subtitle":"(Montel) Liquidity in the Nordic financial power market was set to rise for the third consecutive year in  2025, with prices trading around multi-year lows, traders told Montel.",
        "body":"Trading volumes cleared via the Nasdaq exchange rose 18% year on year to 526.7 TWh last year, which is the highest figure since volumes hit 802 TWh in 2021, while 16.8 TWh was traded on the EEX bourse, up 33% year on year.\n“My guess is that we will see another increase in volumes this year,” said Kolbjorn Hembre, CEO of A Entelios, which manages a portfolio of 28 TWh in the Nordic market.\n“Prices in the forward market have come down and we are experiencing a greater desire from customers to secure long-term contracts. This contributes to increased liquidity,” he added.\nIn terms of prices, the front-quarter contract is trading at a five-year low on a rolling basis and was last seen around EUR 17\/MWh, 50% lower than the EUR 34\/MWh it was trading at in 2024.\nLess capital required“When the market drops significantly, less capital is required to take positions. We now see that more and more people are looking to participate,” said Geir Arne Mo, CEO of portfolio manager Bergen Synergy.\nDespite the recent rise in volumes, historically low prices meant the value of trades fell from EUR 20.3bn in 2023 to a 10-year low of EUR 17bn last year.\nBy comparison, 1,564 TWh of financial contacts with a combined value of EUR 44bn were cleared over the exchange in 2014.\nStill, lower prices attracted more participants to the market and boosted trading volumes, agreed Tom Erik Olsen, head of trading at supplier Ishavskraft.\nFor example, volumes slumped to a 25-year low of 409.3 TWh in 2022 when prices soared due to the European energy crisis precipitated by the Ukraine war.\n“For example, if the contract for the second quarter of this year falls by 10% now, it amounts to EUR 1.70. Not long ago, such a drop would have been well over EUR 10, so the risk has become entirely different,” Olsen said.\nNord Pool wild cardMeanwhile, the Nord Pool exchange, which planned to launch a rival marketplace for futures trading in the Nordic region this summer was a wild card in terms of how liquidity would develop going forward, said the market participants. \nAll three traders added it would be negative for liquidity, while Olsen doubted “there is room” for another exchange on the market.",
        "datestamp":"22-01-2025",
        "category":[
            "ELECTRICITY",
            "TRADING"
        ]
    }
]