[
    {
        "title":"Nordic hydropower surplus to double by end Feb – LSEG",
        "subtitle":"(Montel) Recent forecasts suggest a strong improvement of the Nordic hydrological balance during February, which is likely to depress prices throughout the summer, LSEG senior analyst Ole Tom Djupskaas said on Wednesday.",
        "body":"“The outlook is very bearish”, Djupskaas told Montel, after estimating the market impact of the latest 46-day weather forecast from the European Centre for Medium-Range Weather Forecasts.\n“It looks like it will be wet, windy and warm to the end of February,” said Djupskaas, adding the hydrological balance in the region – measuring potential hydropower output stored in reservoirs, snow and soil – was likely to swell from 16 TWh above normal currently to 30 TWh by the end of next month, which will be the highest level for five years.\nBearish spotThe Nordic region would thus enter the spring with unusually full hydropower reservoirs, which was very bearish for spot prices both in Q2 and Q3, he said.\nStill, Djupskaas did not believe average spot prices would drop to the single-digit levels seen during the summer of 2020 – as suggested by the chief analyst at Bixia earlier on Wednesday – because gas and German power prices were much higher now than five years ago.\n“It not unlikely we will see an average system price of around EUR 20\/MWh in Q2,” he said, which is slightly above the current futures price for Q2 at EUR 18.45\/MWh.\nNorwegian and Swedish hydropower reservoir levels stood at 73% and 74.3%, respectively, at the end of last week, which was record high for this time of the year, official data showed.\nThe Q2 contract was last seen at EUR 18.45\/MWh on Wednesday, slightly above the contract low of EUR 16.60\/MWh from 10 January but almost half the EUR 34\/MWh it was trading at this time last year, while the Q3 contract was at EUR 17.35\/MWh.",
        "datestamp":"23-01-2025",
        "category":[
            "ELECTRICITY"
        ]
    }
]