[
    {
        "title":"Norsk Hydro CEO- Era of large PPAs is “over”",
        "subtitle":"(Montel) Norwegian aluminum giant Norsk Hydro will rethink its long-term power purchase strategy when it seeks to secure an additional 4 TWh\/year, as the era of large PPAs is over, its CEO Eivind Kallevik told Montel.",
        "body":"“The days when you could sign a long power purchase agreement (PPA) for 4-5 TWh annually are probably over,” Kallevik said in an interview. “Instead, you need to actively work in the market and build a broad portfolio of smaller contracts.”\nA PPA is a long-term contract between a buyer and a renewable energy provider to purchase electricity at a predetermined rate. It helps organisations secure stable energy costs while supporting sustainability goals, often without requiring upfront investment. PPAs are commonly used for large-scale solar, wind and other renewable energy projects, providing financial certainty to both parties.\nNorsk Hydro is Norway’s single largest user of electricity, with its annual consumption of 17 TWh accounting for more than 10% of the country’s total. The power is secured through self-owned production and PPAs.\nHowever, from 2030, the company must increase its annual supply by 4 TWh to cover demand.\nNorsk Hydro CEO Eivind Kallevik. Photo: Oscar Birk \/ Montel.\nContinuous development“The power portfolio will not consist of a few contracts maturing at a specific time, but several contracts maturing at different times. This allows you to actively develop the portfolio continuously,” Kallevik said.\nThe CEO would not comment on the price levels of Norsk Hydro’s current contracts.\n“We are focused on having competitive conditions. This does not mean we need the lowest price in the world [but] it needs to be on par with our competitors.”\nFigures from Montel’s Qwatt show that wind output under a five-year PPA delivered in central Norway’s NO3 bidding zone, where Norsk Hydro’s largest aluminum plant is located, costs around EUR 38\/MWh. Prices across other European countries range from EUR 31\/MWh in Sweden’s SE2 bidding zone to PLN 444\/MWh (EUR 104\/MWh) in Poland.\nRising demandNorsk Hydro fears that a lack of new investments in new generation capacity will elevate these prices in the next 5-10 years, as demand is forecast to rise strongly as more and more sectors replace fossil fuels with renewable electricity.\nOnly 278 GWh of new generation capacity was commissioned in Norway during the first nine months of last year, limiting the availability of PPAs.\n“It is time to remind everyone what happens if we do not have competitive power prices in Norway, and what happens to industry and jobs,” said Kallevik.\n“We believe we can secure the power we need after 2030, but it must be a combination of new power being developed and power contracts based on existing production,” he said.\n“Russia’s invasion of Ukraine underscores the importance of predictable power contracts. The EU lost around 50% of its aluminum production capacity within six months because the volatility that then arose in the power market was completely impossible to live with for aluminum producers who did not have long-term contracts.”\nTo see Montel’s video report with Norsk Hydro CEO Eivind Kallevik click here.",
        "datestamp":"15-01-2025",
        "category":[
            "PPAS",
            "RENEWABLES"
        ]
    }
]