[
    {
        "title":"Norway’s prime minister backs Hammerfest LNG electrification",
        "subtitle":"(Montel) Norway’s prime minister Jonas Gahr Store on Tuesday told Montel ongoing plans for the electrification of Equinor’s LNG plant at Hammerfest must go ahead despite local concerns.",
        "body":"“Stopping the electrification will be irresponsible and wrong,” he added, responding to proposals by several opposition parties to withdraw the energy major’s licence to source power required from the mainland grid, due to concerns over the local power demand balance in northern Norway.\nLittle sense?It made little sense to stop a project that was already 30% completed and where Equinor had spent NOK 5bn (EUR 426m), said Store, referring to the 2023 plan to go ahead with electrification to cut 850,000 tonnes\/year of emissions.\nThe plans would help secure jobs in Norway’s northernmost Finnmark county and contribute to economic activity by prolonging the lifetime of the LNG plant, the prime minister added.\nBroadcaster NRK reported yesterday that a slim one-seat majority in parliament was now against electrifying the LNG plant.\nEquinor, meanwhile, told Montel that a move to reverse the decision would be highly regrettable, as it had already spent NOK 5bn (EUR 426m) on the plan and signed contracts with key suppliers.\n“We must be able to rely on administrative decisions made by Norwegian authorities. We are concerned about statements that create uncertainty around the industry’s framework conditions and for investments and jobs in large industrial projects,” said Trond Bokn, project development director at Equinor.\nU-turn questionableHans Petter Graver, a law professor from the University of Oslo, said it was questionable whether parliament could withdraw a licence that has already been given.\nStore talked to Montel after reshuffling his cabinet with the government in turmoil after  coalition partner, the Centre party, quit last week in a spat over EU energy policies.\nThe country faces a general election in September.\nHammerfest LNG consumes roughly 3.6 TWh of electricity a year, corresponding to around 3% of Norway’s annual supply.\n(EUR 1 = NOK 11.72)",
        "datetime":"2025-02-04T13:01:06",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]