[
    {
        "title":"Norway price cap may “mess up” power market – Finnish minister",
        "subtitle":"(Montel) Norway’s plan to cap retail power prices is an exceptional measure that would change the nature of the Nordic market, the Finnish energy minister told Montel in an interview on Wednesday.",
        "body":"“Of course, when we are in this common Nordic market, we should make sure that it works and not mess it up with national solutions like this,” added Sari Multala.\n“It is certainly exceptional to go to such lengths. Of course, it’s the kind of thing that changes the nature of the market quite a bit.”\nHer comments came after the Norwegian government announced last month it planned to introduce a fixed retail price of NOK 400\/MWh (EUR 34.32\/MWh) starting 1 October to help reduce costs for household consumers.\nCurb liquidity?The plan had already received criticism from Sweden’s Energy Authority, which said it could curb liquidity in the Nordic power futures market and dampen overall market sentiment.\nFinland’s reservations were in line with those of their Swedish counterparts due to the interconnected nature of the Nordic market, said Multala.\n“And when we will also need consumption flexibility in the future, as part of this whole system, it is clear that we should also be able to provide incentives for it,” she added.\nSome observers have said the Norwegian plan would hit incentives to shift consumption from peak demand hours, which was a key part of the EU’s decarbonisation plans.\nFinland itself has seen strong power price volatility in recent years, though the energy minister would not speculate on possible state intervention.\nBefore stepping down, Multala’s predecessor from her reigning conservative National Coalition party, Kai Mykkanen, suggested the country should help fund new nuclear investments.\nInsufficient solutionsHowever, Multala agreed the market did not currently offer sufficient solutions to cold, windless periods in the winter amid the country’s green transition.\n“It shows that our electricity market is not entirely problem free at the moment… and then it easily leads to discussions about different support mechanisms,” she said.\nCold weather combined with low wind production saw the Finnish spot price hit a record high of EUR 890.54\/MWh last winter.\n(EUR 1 = NOK 11.67)",
        "datetime":"2025-02-12T14:06:07",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]