[
    {
        "title":"Oil prices rise but investor caution continues to curb gains",
        "subtitle":"(Montel) Oil prices were recovering early on Tuesday, after falling around 2% in the previous session, though investor caution was curbing gains amid weak economic data and concerns about potential US tariffs from the new Trump administration.",
        "body":"The front-month contract for Brent crude North Sea oil was last seen up USD 0.40 at USD 77.48\/bbl, while the WTI equivalent was USD 0.37 higher at USD 73.54\/bbl.\n“A risk-off tone across wider markets weighed on sentiment in energy and metal sectors,” said Australia’s ANZ bank a note.\n“It’s going to be all eyes on equity markets as the key driver of sentiment and risk assets including crude oil,” Tony Sycamore, market analyst at online trading platform IG, told Montel.\nOil prices would continue to remain under pressure, he added.\nSycamore pointed to DeepSeek, an AI model launched by a Chinese start-up that overtook US-based ChatGPT as the most downloaded free app over the weekend, adding its emergence “threatens last year’s 25% rally in the Nasdaq 100, driven by AI and tech stocks”.\nMeanwhile, weak economic data out of China, the world’s biggest crude importer, also weighed on sentiment after its purchasing managers index fell to 49.1 in January, said market participants.\nA reading of below 50 shows the economy is contracting.\nTariff risk?“Markets are also unsettled by the use of tariffs by the US,” said ANZ bank.\nOver the weekend, new US president Donald Trump threatened to impose a 25% tariff on Colombian goods, while also threatening to inhibit the Russian oil trade.\n“We think the market expects Russia to find some way to mitigate at least some of the impact of these sanctions,” Ajay Parmar, global analytics director at consultancy Icis, told Montel.\n“Furthermore, even if the sanctions did lead to a significant reduction in Russian oil supply, the fact that Opec+ is sitting on over 5m bbl\/day of spare capacity means there is a limit to the upside potential here,” he added.\n“Trump’s recent pressure on Opec to help to lower oil prices only cements this view further for us.”",
        "datetime":"2025-01-28T07:27:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OIL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]