[
    {
        "title":"Oil prices slip on hopes Trump-Putin talks will remove supply risk",
        "subtitle":"(Montel) Oil prices were falling on Thursday after it was revealed US president Donald Trump and Russian counterpart Vladimir Putin have begun negotiations to end the Ukraine war, which could ease crude supply concerns.",
        "body":"The front-month contract for Brent crude North Sea oil was last seen down USD 0.60 at USD 74.58\/bbl, while the WTI equivalent was USD 0.58 lower at USD 70.79\/bbl.\n“Crude oil prices slumped following reports that Russia and the US were in talks to end the war in Ukraine,” said Australia’s ANZ bank in a note.\n“US president Donald Trump called Russian president Vladimir Putin, sparking optimism that risks to crude oil supplies would ease. The leaders agreed to begin talks to end the war.”\n“Immediate negotiations”In a post on his Truth Social platform, Trump said he and the Russian president had “agreed to have our respective teams start negotiations immediately”.\n“Signs of tightening supplies have been pushing up oil prices in recent weeks,” said ANZ.\n“US sanctions on Russian oil companies and vessels are said to have exacerbated the situation,” it added, with the previous administration in Washington having brought in the curbs to stop Moscow funding its war via petrodollars.\n“Russia’s oil output has subsequently fallen to 8.9m bbl\/day, 16,000 bbl\/day below its approved levels under the Opec+ production agreement.”\nSentiment was also not helped by a broader “risk-off tone” across the market, with a weak global economy compounded by concerns about the erratic tariff policy of the new US administration, which could further dent growth, said ANZ.\nMarket in surplusIn the medium term, meanwhile, Sweden’s SEB bank cited a forecast from the US Energy Information Administration that predicted a “surplus market with prices sliding lower assuming Opec+ lifts production”.\nAfter implementing significant output cuts since late 2022 to inflate prices, the producer cartel has announced plans to gradually reverse these cuts starting in April.\nHowever, given the projections the “job of Opec+ is getting more difficult with no room to lift production from its January level if it wants to avoid rising inventories and lower prices”, said SEB.",
        "datetime":"2025-02-13T07:12:48",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OIL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]