[
    {
        "title":"Only 7% of planned green H2 projects finish in 2023 – study",
        "subtitle":"(Montel) Only 7% of global green hydrogen projects finished on schedule in 2023, owing to a yawning gap between production costs and buyers’ willingness to pay, according to a study in Nature Energy on Tuesday.",
        "body":"The study, conducted by the Potsdam Institute for Climate Impact Research (PIK), tracked 190 projects in 60 countries over three years.\nThe success rate of projects varied to date by region, the study said. Projects in North America were equivalent to the global average, European projects were below average, Asian projects were above average, while projects in Australia had all failed to deliver so far.\nThe study attributed the shortfall in project completions during this period to rising costs, a lack of interest on the demand side and uncertainties about subsidies and future regulation.\nIt noted that project announcements had simultaneously almost tripled within three years to 422 GW.\nThis had helped to close a gap in ambition to align investments by 2030 with the requirements of a world that keeps global warming below a 1.5C rise in temperatures this century, the study said.\nHowever, the announcements outpaced available subsidies to develop them, it added.\nUSD 1 trillion needed“Enormous additional subsidies of around USD 1 trillion would be required to realise all announced hydrogen projects by 2030,” said Falko Ueckerdt, head of the PIK’s national energy transitions team.\n“Green hydrogen will continue to have difficulties meeting the high expectations in the future due to a lack of competitiveness.”\nThe authors recommended refining expectations for the role of hydrogen in a clean economy to focus on applications where the gas was “indispensable”. They also suggested supporting it in the near-term with a combination of more direct subsidies and regulations to compel uptake.\nIn Europe, the EU bloc’s strategy aims to produce 10m tonnes and import 10m tonnes of renewable hydrogen by 2030. Further ahead, it calls for green hydrogen to cover 10% of the EU’s energy needs by 2050.\nHowever, several H2 projects in Europe were scrapped or scaled down last year mainly due to cost issues.",
        "datestamp":"15-01-2025",
        "category":[
            "HYDROGEN",
            "RENEWABLES"
        ]
    }
]