[
    {
        "title":"Orsted returns to profit for 2024 despite EUR 2bn impairment",
        "subtitle":"(Montel) Danish utility Orsted returned to profit last year – having made a significant loss in 2023 – despite a DKK 15.6bn (EUR 2bn) impairment due to heavy writedowns of its US offshore wind operations, it said on Thursday.",
        "body":"The firm’s net profit totalled DKK 16m for full-year 2024, compared to a loss of DKK 20.2bn in the prior 12 months, it added in its latest financial report for the January-December period.\nThe firm said previously that the increased cost of seabed leases along the coasts of New Jersey, Maryland and Delaware contributed to the writedown, while it was also linked to delays and cost increases to a major US offshore wind project, now due to come online in the second half of 2027.\nOrsted generated 33.9 TWh of electricity last year, up 9% year on year, which helped it return to profit, it said.\nOffshore wind generation rose 5% year on year to 18.6 TWh, while onshore wind generation increased 15% to 17.8 TWh and thermal power production gained 2% to 4.5 TWh.\n“Challenging year”“2024 proved to be a challenging year for the industry and for Orsted. We have experienced headwinds and have therefore taken necessary actions, including the adjustment of our business plan,” said new CEO Rasmus Errboe, who replaced Mads Nipper last week.\nOn Wednesday, the firm announced it had axed its 2030 renewables target of 35-38 GW, only a year after it had slashed it from 50 GW, while investment over the next five years would be cut 25% amid challenging times facing the development of offshore wind generation.\nCompanies across the region are being affected by the challenging investment environment, with higher interest rates and regulatory uncertainty impacting capital intensive green projects.\n(EUR 1 = DKK 7.46)",
        "datetime":"2025-02-06T08:32:43",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]