[
    {
        "title":"Orsted was “too optimistic” on US wind market – CEO",
        "subtitle":"(Montel) Orsted’s new CEO said the group had been too optimistic over the prospects for offshore wind in the US, after two prestigious projects cost it EUR 4.6bn in impairments over the past two years.",
        "body":"“It is clear that especially our offshore wind investments in the US have proven to be more challenging than we had anticipated in the past,” Rasmus Errboe told media when presenting the group’s financial results for 2024 in Copenhagen.\nThe world’s largest operator of offshore wind posted impairments of DKK 14.1bn (EUR 1.9bn) from its US offshore wind operations for 2024, following a DKK 19.9bn impairment from the same business in 2023.\nOrsted currently aims to start power production at its Revolution Wind (704 MW) and Sunrise Wind (924 MW) projects in 2026 and 2027, respectively. However, both projects are struggling with supply chain and construction challenges, said Errboe.\nNo guarantees“We are working hard to minimise the risks, but due to uncertain market conditions and the macroeconomic climate, I cannot give any guarantees [they will be completed],” he said.\nPolitical uncertainty has also increased following Donald Trump’s return to the US presidency. Trump has publicly said he is opposed to wind power.\n“We are closely following all relevant political developments and announcements regarding wind energy [in the US],” said Errboe.\nOrsted on Wednesday axed its 2030 renewables targets due to increased uncertainty, and Errboe said the group would have to cut 800 jobs to adjust to a revised target.\nIts share price was up 5% on Thursday following the announcement, but is still down close to 10% so far this year. \n(EUR 1 = DKK 7.46)",
        "datetime":"2025-02-06T11:59:07",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]