[
    {
        "title":"Orsted posts EUR 1.6bn impairment in Q4 on wind woes",
        "subtitle":"(Montel) Danish utility Orsted posted a DKK 12.1bn (EUR 1.6bn) impairment for last year’s fourth quarter late on Monday, linked to rising US interest rates as well as delays and rising costs related to a key US wind farm project.",
        "body":"“The impairments announced today and especially the continued construction challenges, are very disappointing,” CEO Mads Nipper said in a statement.\nOrsted said DKK 3.5bn of the impairments were caused by the increase in long-dated interest rates in the US, which was driving up costs of its wind generation business.\nIncreased value of seabed leases along the coasts of New Jersey, Maryland and Delaware contributed DKK 3.5bn to the writedown, while DKK 4.3bn was linked to delays and cost increases to a major US offshore wind project, now due to come online in the second half of 2027.\nCommitted to USThe firm, which also posted a massive EUR 3.8bn impairment in November 2023 linked to the cancellation of a US offshore wind project, said it was still committed to the US market, however.\n“We remain committed to the US market in the long term with its potential for renewables to meet the growing electricity demand and create thousands of industrial jobs across the US,” said Nipper.\nOrsted and other Danish renewables companies, like wind turbine manufacturer Vestas, also faced uncertainty linked to president Donald Trump’s return to the White House, analyst Jacob Pedersen at Danish bank Sydbank told Montel.\nThis stemmed from Trump’s opposition to wind power, as well as his recent threats to tax Danish goods if the country did not concede Greenland to the US.\nMeanwhile, Orsted announced earnings before interest, tax, depreciation and amortisation of DKK 24.8bn for 2024, which was in line with forecasts.\n(EUR 1 = DKK 7.46)",
        "datestamp":"21-01-2025",
        "category":[
            "ELECTRICITY",
            "FINANCIAL",
            "OFFSHORE WIND",
            "WIND"
        ]
    }
]