[
    {
        "title":"Oversupply to depress EU GO prices until next year – STX",
        "subtitle":"(Montel) The current oversupply in the European guarantees of origin (GO) market is likely to continue to depress prices this year before they potentially pick up in 2026, said the head of environmental commodities Europe at trading firm STX.",
        "body":"“A warm and dry summer could give higher prices but I believe we have to wait until 2026 or 2027 to see the current strong oversupply in the market being reduced,” David Ceder told Montel at the E-World energy fair in Essen on Wednesday.\nGO prices rose to a record EUR 10\/MWh in late 2022 but have since crashed, recently hitting a four-year low, due to an oversupply caused by strong renewables build in the region, ample hydropower supply and new countries entering the market.\nThe certificates for last year’s renewables production were currently trading at around EUR 0.25\/MWh, with 2025 output at EUR 0.90 MWh and 2026 at EUR 1.15\/MWh.\nTougher reporting standardsNew and stricter reporting standards, like the EUs corporate sustainability reporting directive, should boost demand in the years to come as more companies needed to buy GOs to document renewables use, said Ceder.\nThis could see prices returning to levels around EUR 2-4\/MWh, he added.\nThere should be a closer match between production and consumption of GOs, with current standards prolonging periods of oversupply, said Ceder.\nHis comments came as it was possible to document renewables use from power that had been produced up to 18 months earlier in some countries.\n“I think it makes sense to harmonise and shorten the matching requirements. France has monthly matching today, which works fine. I think that should be the ambition for the overall market,” Ceder said.\nHe was more sceptical about hourly matching, however, as it was “not realistic” and “too ambitious” for most companies.",
        "datetime":"2025-02-13T07:45:28",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GOS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]