[
    {
        "title":"Peace could see tripling of Russia gas flows to EU – Equinor",
        "subtitle":"(Montel) An end to the war in Ukraine could see the return of up to 35bcm of Russian pipeline gas to Europe but the market will otherwise likely remain tight until 2026-27, said Equinor executive Irene Rummelhoff on Wednesday.",
        "body":"“Some kind of settlement [between Ukraine and Russia was] the big unknown” this year in terms of regional supply, she said at an event held by the Norwegian energy major in London, with 35mcm equating to about 7% of the region’s 2024 demand according to figures from the International Energy Agency.\n“Before the war, there were four big pipeline infrastructure projects that supplied Europe with gas,” she told Montel in an interview on the sidelines of the event, referring to the situation before Russia invaded Ukraine in February 2022 and when the EU relied on the former for about 40% of its gas demand.\nOf these, the Yamal route via Poland was unlikely to resume operations – in part due to political opposition from Poland – and the Nord Stream 1 pipeline was assumed to be permanently damaged following explosions in September 2022, she said.\n“Nord Stream 2 still needs a little bit of permitting but we think that will be solved,” she said, noting this route – via the Baltic Sea to Germany – could provide 8bcm\/year to Europe.\n“And we do expect that Ukraine will then go back to transiting Russian volumes,” she said, noting this could see a further 27bcm of gas from Russia.\nThis would be in addition to ongoing flows, amounting to around 14bcm\/year, via the TurkStream pipeline, through Turkey and Bulgaria, she noted.\nStorage target challengeWithout the flows – which, of course, are purely hypothetical at present – Europe was facing a relative tightness in supply this year and possible challenges in meeting existing EU-wide storage targets, of 90% by 1 November, Rummelhoff said.\nEurope could potentially reduce the target to 80-85%, she said.\n“But going significantly below 80%, I think, is a stretch,” she said, noting a severely cold winter could then lead to supply issues.\n“A blackout situation in any northern European country would be a political disaster,” she added.\nMontel reported on Tuesday that Italy was supporting efforts for a “reasonable” lowering of European gas storage filling targets.\nWith the benchmark European TTF Summer contract still at a premium of EUR 4-5 to the Winter contract – with prices last seen on Ice Endex at EUR 52.81\/MWh and EUR 48.43\/MWh, respectively – there was little reason for buyers to begin refilling storage facilities, Rummehoff said.\n“What [the price spread] tells us is that there is a clear expectation that there will be regulation or regulated storage filling rather than commercial storage filling,” she added.\n“They’re all anticipating that they’ll get some incentives from the respective governments to fill the storage.”\nHammerfest electrificationMeanwhile, a slim one-seat majority in the Norwegian parliament against electrifying Equinor’s LNG plant at Hammerfest would not affect the company’s plans, the executive said.\n“We’re really into investing into Hammerfest LNG, it’s extremely important for us and I think also for the Norwegian government, to provide investors with a stable environment,” she said.\n“Backing off an already approved project would be a bit of a surprise, I think,” she said, with the current government supporting the development.",
        "datetime":"2025-02-05T15:18:02",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]