[
    {
        "title":"Polish power exports could lower regional prices – Acer",
        "subtitle":"(Montel) Reducing constraints on Polish power exports could lower regional prices during cloudy, still days when there is less wind and solar power available, according to EU energy regulatory agency Acer.",
        "body":"During such a “dunkelflaute” event for an hour on 12 December, for example, the Polish power price was EUR 165\/MWh, compared with EUR 936\/MWh in neighbouring Germany, it said on Tuesday in an opinion on Poland’s national assessment of its generation resource adequacy.\nThis assessment looks at whether Poland has enough power resources to ensure its supply security, and if extra measures, such as capacity mechanisms, are justified.\nAcer said the assessment underestimated the power import capacity available and did not consider exports. This meant it did not consider the full benefits of cross-border trading, “which help reduce overall system costs and improve adequacy”.\n“Allocation constraints”The Polish power TSO applied “allocation constraints” which sometimes limit exports from Poland, even when neighbouring market prices are much higher, said Acer.\nThis meant Poland’s power prices did “not reflect regional shortages effectively, limiting earnings for local generators and demand response providers”.\nPoland’s assessment also did not fully consider the impact of demand-side response and battery storage, said Acer.\nRemoving barriers to developing these would help “alleviate concerns that might otherwise justify extending the existing capacity mechanism”.\nAcer recommended that the Polish climate ministry and TSO take its opinion into account and if needed update the assessment to provide “a more accurate picture of the country’s electricity adequacy”.\nThe Polish national resource adequacy assessment complements the European analysis carried out each year by formal EU power TSO body Entso-E and reviewed by Acer.\nEU rules require Acer to review any national assessments and comment on differences with the European resource adequacy assessment.",
        "datetime":"2025-02-18T10:16:28",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]