[
    {
        "title":"Polish TSO steps up security ahead of grid synchronisation",
        "subtitle":"(Montel) Poland's TSO PSE has strengthened security measures for the Poland-Lithuania 4 GW link ahead of the planned synchronisation of the Baltic grid with the EU network on Saturday.",
        "body":"The TSO’s security teams were patrolling the link with Lithuania using choppers and drones, PSE said in a statement.\n“Due to the tense geopolitical situation in Europe, the company also has plans to additionally strengthen its own technical resources related to the physical protection of transmission facilities,” PSE head Grzegorz Onichimowski said in a statement.\nPoland’s high voltage grid operator has not seen physical attacks on the link with Lithuania, although “it is better to be safe than sorry”, PSE’s spokesman, Maciej Wapinski, told Montel.\nThe LitPol link consists of two 440kV lines with a combined thermal capacity of 4.1 GW. It is a vital link for Lithuania, Latvia and Estonia, which plan to disconnect from the Russian grid on Saturday and synchronise with the Entso-E network.\nIn December, a Russia-linked oil tanker was suspected of damaging the 650 MW Estlink 2 subsea cable connecting Estonia with Finland. Lithuania’s energy minister Zygimantas Vaiciunas said last month that it could be an attempt to compromise the desynchronisation.\nThe three Baltic states currently rely on a 350 MW Estlink 1 link between Estonia and Finland, a 700 MW Nordbalt link between Lithuania and Sweden and the 4.1 GW LitPol to keep the lights on after synchronisation happens on Saturday.\nNato, meanwhile, has strengthened security in the Baltic Sea cables following a series of suspected attacks on critical infrastructure in the region.",
        "datetime":"2025-02-03T12:33:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]