[
    {
        "title":"Romania, Greece achieve 7-fold rise in PPAs in 2024",
        "subtitle":"(Montel) Romania and Greece, southeast Europe’s energy market leaders, secured a sharp rise in power purchase agreements (PPAs) in 2024, and are set to see robust growth continue this year, consultancy Veyt told Montel on Monday.",
        "body":"Greece signed four new PPAs in 2024 for a total of 660 MW in capacity and almost 2.2 TWh in contracted volume. The country saw six deals in 2023 but for lower capacity and volume, at 118 MW and 1.2 TWh, respectively.\nRomania secured nine PPAs for a total of 495 MW and 765.5 GWh, up from two PPAs for totals of 50 MW and 61 GWh in 2023.\n“I expect that in 2025 we’ll see further PPA growth in these two countries,” Irina Peltegova, the senior green power market analyst at Veyt, told Montel. “These are the two biggest regional markets in terms of natural potential and 2030 renewable energy targets.”\nGreece and Romania are increasingly attractive for renewables developers due to their untapped potential and improving liquidity. According to consultancy Pexapark, both were among the ten most prolific PPA markets in Europe last year.\nElsewhere in the region, Bulgaria signed one PPA for 83 MW of solar capacity and 110 GWh in 2024, and Hungary saw one 13 MW solar PPA for 15 GWh.",
        "datetime":"2025-02-10T13:16:21",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]