[
    {
        "title":"Romania unveils 2026 net power export target, market sceptical",
        "subtitle":"(Montel) Romania announced plans yesterday to become a net power exporter by 2026, though traders told Montel on Monday that the goal could be hampered by grid bottlenecks and delays building new capacity.",
        "body":"The country aimed to add between 1.5-2 GW in new baseload power capacity from a combination of gas-fired, hydropower and co-generation units this year, said energy minister Sebastian Burduja in a statement.\nThis new capacity was hoped to help Romania switch from net power importer to an exporter in 2026, he added.\nLocal market participants, however, pointed to the country’s poor track record, citing delayed energy projects and expressed doubts the target would be met.\n“I doubt very much we can become a net power exporter in 2026. The grid needs to be improved to absorb the new capacity, while delays are always expected on the new gas-fired capacity projects, such as the 1.7 GW Minitia [plant],” a trader told Montel.\nMany of the country’s new solar and wind projects had also faced delays due to an insufficient grid system and excessive bureaucracy, said other traders.\nRising demandIn addition, Romania’s domestic power demand was rising, which made excess volumes to export unlikely, they added.\nPower demand rose 2% year on year to 46 TWh in the first 11 months of 2024, according to data from TSO Transelectrica, though electricity output decreased by 8.3% over the same period.\nNational electricity exports dropped 5% year on year to 9.9 TWh between January and November, while imports jumped 58% to 12.2 TWh, the data showed.\nThe country’s main export power markets are Serbia, Hungary and Bulgaria.\nSeparately, the minister said the country was planning to add 1GW of storage capacity by 2027 but market participants expressed doubts about the completion of this target within the set timeline.",
        "datestamp":"21-01-2025",
        "category":[
            "ELECTRICITY",
            "GAS"
        ]
    }
]