[
    {
        "title":"Sabotage won’t stop Baltic split from Russian grid – Estonia",
        "subtitle":"(Montel) Attacks on key energy infrastructure in the Baltic Sea will not stop plans by the Baltic states to desynchronise from the Russian power grid next month, Estonia’s prime minister said on Tuesday.",
        "body":"“If the intention [behind recent damage to the 650 MW Estlink 2 cable] was to hamper decoupling, then it probably won’t work,” Kristen Michal told a press meeting with Nato secretary general Mark Rutte and Finnish president Alexander Stubb in Helsinki.\nThey were asked by reporters if they believed the 25 December attack on the Estlink power cable was done to stop desynchronisation, planned for 9 February, with both Estonia and Finland suspecting Russia of being behind the damage.\nMichal said Estonia, Latvia and Lithuania had worked for several years to plan the desynchronisation and that they had ample reserve solutions in place if key power lines go out of operation.\n“But it can cause inconveniences. It could be an intended message that the Baltics and Nordics don’t work well without the Russian embrace,” Michal said.\nThe Baltic states stopped trading electricity with Russia in 2022 but still require system services from their eastern neighbour. They plan to synchronise with the central European grid through Poland on 9 February.\nAt the same meeting, Nato launched a new initiative to strengthen monitoring of key energy and telecoms infrastructure in the Baltic Sea.\nThreats to other cablesEarlier today, Lithuanian energy minister Zygimantas Vaiciunas told local media that recent attacks on infrastructure could be an attempt to compromise the desynchronisation.\nHe commented on reports by Swedish broadcaster SVT about anchor marks found close to the 700 MW Nordbalt power link between Sweden and Lithuania.\nSwedish defence minister Carl-Oskar Bohlin told SVT the marks were likely caused by the Chinese ship Yi Peng 3, which severed telecommunications cables between Sweden and Lithuania and between Germany and Finland in November last year.\nPolish state broadcaster TVP reported today that a ship belonging to Russia’s shadow fleet had been seen circling around the natural gas pipeline between Denmark and Poland in the Baltic Sea.\nStubb confirmed the issue had been discussed at the Helsinki meeting but did not provide more details. The meeting comprised Nato member countries bordering the Baltic Sea.",
        "datestamp":"15-01-2025",
        "category":[
            "ELECTRICITY",
            "POLICY"
        ]
    }
]