[
    {
        "title":"Safety body finds 50 anomalies at new French reactor",
        "subtitle":"(Montel) France’s ASNR nuclear safety authority has recorded about 50 safety issues at the Flamanville 3 (1.6 GW) reactor since it was connected to the grid on 21 December, it said on Tuesday.",
        "body":"The errors “reveal a lack of control on the part of [EDF] teams in the transition from the construction phase to the plant’s operating phase”, ASNR head Pierre-Marie Abadie, told a press conference.\n“Overall, what we’re seeing is a lot of events linked to the human factor, to difficulties in coordinating teams, preparing interventions, preparing tests”, he added.\nSince connection in December the reactor has only generated electricity for 11 days, between 14-25 at low levels not exceeding 120 MW, TSO data showed.  \nExceed 25%? The authority is set to rule next week on operator EDF’s request to exceed the 25% power capacity limit, a level it had originally planned to reach as soon as it was connected to the grid.\nASNR chief inspector Christophe Quintin noted that the Flamanville reactor, France’s first to come on stream in more than 20 years, recorded more safety events than the two Civaux reactors when they were commissioned in 1997 and 1999.\n“The machine was simpler [to operate], so there was less risk of significant events. And frankly, the safety level of the teams was lower than on the EPR [European pressurised reactor]. So, when you compare the two, the EPR is better,” he said.\nFinland’s new EPR experienced problems after start-up at the end of 2021, including problems with a  turbine steam heater, which led to a shutdown lasting several months.\nIn October 2022, tiny cracks were detected on water supply pumps, necessitating further investigations and repairs.",
        "datetime":"2025-01-28T16:08:31",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]