[
    {
        "title":"Ships still avoiding Suez Canal despite Israel-Hamas ceasefire",
        "subtitle":"(Montel) Seaborne vessels, including those carrying coal and LNG, continue to avoid the Suez Canal, despite the easing of Middle East tensions, as geopolitical uncertainty and the lingering threat of attacks keeps insurance costs high.",
        "body":"The number of crossings via the canal – which serves as a conduit between the Red and Mediterranean seas – was down by around a quarter in January from the same month last year, and by 52% versus January 2023, Arrow Shipbroking Group data showed.\nTotal crossings by dry bulk vessels – which handle coal, among other dry goods – were down by 42% on the year, while LNG shipments have come to a virtual halt, the figures showed.\nThis was due to the ongoing threat of Iran-backed Houthi rebels in Yemen attacking vessels traversing the Bab el-Mandeb strait – which links the Red Sea to the Gulf of Aden – since November 2023, in response to Israel’s war on Hamas in Gaza.\nHowever, with the two sides last month agreeing on a ceasefire and hostage release deal, bringing a pause after 15 months of war, some of the regional tension has eased.\nNo noticeable change“There hasn’t been any noticeable change in crossings, as owners and charterers are still very nervous,” Burak Cetinok, head of research at Arrow Shipbroking Group, told Montel.\n“Insurance premiums have also not changed at all,” he said, with sources last year citing a risk premium cost of some 1% of the ship’s value.\nNevertheless, Ossama Rabiee, the chairman of the Suez Canal Authority, said in late January – during a meeting with 23 major shipping firms – that the Red Sea region was “witnessing positive indicators”.\n“Stability returning to the region” could help pave the way for a return to normality for the shipping conduit, he noted.\nCommodity flowsCoal shipments in both directions through the canal totalled just 1.35m tonnes in January, down from 7.6m tonnes in the same month last year and nearly 10m tonnes in January 2023, according to preliminary Kpler vessel-tracking data.\n“The main route would be Taman [in the Black Sea] to Asia, which is not active really as Russia has already adjusted its logistics procedure to export from northeast ports,” said Firat Ergene, senior dry bulk analyst at Kpler.\nRussia shipped just 5.86m tonnes of coal from its port at Taman to Asia via the Suez Canal in 2024, down from around 16m tonnes\/year in the previous two years, Kpler figures showed.\nLNG shipments via the route have dropped to negligible levels since hostilities began, from 2.5m tonnes (3.4bcm) in January 2023, with shippers redirecting vessels around South Africa’s Cape of Good Hope or to alternative destinations.\nHowever, shipbroker Intermodal said in a note that the potential reopening of Red Sea trade following the ceasefire in Gaza “may rejuvenate certain routes, such as Qatari LNG shipments to Europe, or Algerian exports to Asia”.",
        "datetime":"2025-02-06T12:23:01",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        COAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FREIGHT\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]