[
    {
        "title":"Small-scale batteries may help Germany’s energy transition",
        "subtitle":"(Montel) Linked battery systems – from car batteries to household and industrial storage – could help Germany’s energy transition, experts told an energy summit in Berlin this week.",
        "body":"The country has about 16 GW of storage capacity just in private homes, said Oliver Koch, CEO of solar power company Sonnen. But on a typical January winter day, “they are doing nothing at the moment”, he said, speaking during a Tuesday panel.\nBut that kind of capacity – ideally matched with large-scale battery projects and other distributed storage – could help Europe’s biggest electricity market transition to carbon neutrality and curb bottlenecks.\nGermany has already phased out nuclear power and aims to close its coal-fired power plants by 2038. However, its massive fleet of wind and solar – the most capacity in the EU – means that extreme high or low renewable generation can mean negative or surging wholesale power prices.\nThe outgoing government has spent most of the last two years debating the need for at least 10.5 GW of new hydrogen-ready gas-fired power plants to provide baseload power to balance out the renewables cycle.\nBut that proposal has likely fallen by the wayside, with most key decisions expected after a new government is formed following 23 February elections.\nSeveral industry insiders have also criticised the power plant plan – and the associated plan for a capacity energy market – as relying too much on central planning, without enough possibility for flexibility if circumstances change or the industry see new opportunities.\nHowever, the way ahead is not clear, with panelists at the summit calling for extra flexibility, perhaps networking Germany’s wide array of commercial and household solar power batteries and its fleets of electric cars.\nUsing those to store unneeded renewable generation during times of high production could help minimise negative prices and keep power on hold for times of low generation.\n“We don’t have to reinvent the wheel,” said Thomas Raffeiner, CEO of Mobility House, a green vehicle firm.\nSeveral other experts at the event said that jumps in technology and the need to fill production gaps meant it was time for Germany to invest heavily in large-scale battery projects. “We are seeing big, continued development of these technologies,” said Constantin Eis, CEO of CMBlu Energy.",
        "datestamp":"23-01-2025",
        "category":[
            "BATTERIES\/STORAGE",
            "POLICY",
            "RENEWABLES"
        ]
    }
]