[
    {
        "title":"Solar capacity exceeds wind to lead energy mix in Spain",
        "subtitle":"(Montel) Solar photovoltaic has become the renewable technology with the most installed capacity in Spain, surpassing wind for the first time, TSO Red Electrica said on Tuesday.",
        "body":"Spain’s solar fleet has reached 32,043 MW, ahead of the 32,007 MW of wind, to represent almost 25% of the country’s total installed power, it added in a statement.\nThe solar figure was found to be higher than provisional January TSO data released on Monday.\n“With the new photovoltaic solar megawatts that came online, 66% of the generation fleet in Spain is made up of renewable technologies, a fact that shows the progress of the energy transition,” said the TSO.\nSpain connected 7.7 GW of renewable capacity last year, of which 6.7 GW was photovoltaic solar.\nSolar panels hit a production record in Spain last year with 44.5 TWh, or 17% of the total, the TSO said.\nThe technology produced 9.5% of total generation in January, with 2.3 TWh, or a year-on-year increase of 19%, it added.",
        "datetime":"2025-02-04T12:53:44",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]