[
    {
        "title":"Spain faces doubling of hours with negative power prices",
        "subtitle":"(Montel) Spain’s electricity market could face a doubling of hours with negative prices this year as solar power capacity continues to grow, potentially dampening the profitability of new projects, analysts  told Montel.",
        "body":"“This year, Spain is expected to see up to 500 hours of negative prices,” said Montel Analytics analyst Elena Dahlem, noting this would “roughly” double the 247 hours seen in 2024.\nThe growth in photovoltaic capacity in Spain is causing a supply excess in the central hours of the day, Dahlem added.\nSpain added almost 7 GW of solar capacity last year, while there were still “not enough batteries or storage systems to efficiently manage these peaks,” Dahlem said. “That leads to many hours with negative prices,” she added.\nSpain saw negative prices for the first time in April, making that month the cheapest in history, amid a boom in green power generation.\nNegative power prices in Spain fell to as low as EUR -2\/MWh for a few hours on 16 June.\nExport curbs, GO pricesAnalysts have also attributed the prospect of more hours with negative prices this year to France’s ongoing restrictions on exports from Spain – essentially trapping its surplus of power.\nStill, Spanish renewable installations will continue producing even in negative hours, thanks to additional revenues from Guarantees of Origin (GOs), power purchase agreements (PPAs) or payments from ancillary markets.\nThe higher the price of GOs, the more room renewables have to generate at negative prices and compensate for those losses with the sale of green certificates, said Javier Revuelta, senior principal at Afry in Spain.\nThe recent fall in prices in the GO market will mean that negative prices in the power market will not be as pronounced as last year, he added.\nThe price of GOs currently hovered around EUR 0.15-0.20\/MWh, compared to around EUR 4\/MWh a year ago, said a Spanish GOs trader.\nThe Spanish power market was likely to see more below-zero hours in the coming years, although prices may fail to reach levels as low as in other European countries, Montel reported previously.",
        "datetime":"2025-01-28T09:50:52",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]