[
    {
        "title":"Spain industry unlikely to embrace green H2 until 2030 – lobby",
        "subtitle":"(Montel) Spanish industry will fail to replace natural gas consumption with green hydrogen until 2030 despite the country’s green targets due to high costs, lengthy investment processes and technical hurdles, lobby Aege said on Thursday.",
        "body":"“When they have started to test the use of hydrogen in blending with natural gas and have been increasing the weight of hydrogen, we have found that there is a loss of performance and corrosion in the furnaces,” Pedro Gonzalez, director general of the energy-intensive industry lobby, said during a conference hosted by Spanish wind lobby AEE.\nSuch problems “surely have a solution but require time and investment”, he added.\nSpain aims to reach 12 GW of green hydrogen capacity by 2030, with industry experts previously calling the deployment of green hydrogen in Spain “essential” for the country’s energy plan for the end of the decade.\nMore expensiveIn addition to the investments needed to adapt equipment, green hydrogen can be up to three times more expensive than natural gas, discouraging its use, he said.\nHowever, he saw a “clear” future for green hydrogen as an alternative to grey hydrogen made from natural gas or methane, with several projects underway.\nHe cited projects from Repsol and Fertiberia, where the use of grey hydrogen has already been mostly replaced by green hydrogen.",
        "datetime":"2025-02-06T13:13:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]