[
    {
        "title":"Spain capacity market may favour thermal power to storage",
        "subtitle":"(Montel) Spain’s forthcoming capacity market appears to favour gas-fired power plants to battery storage when balancing supply against demand, according to energy experts.",
        "body":"The planned mechanism prioritised firmer backup capacity over flexibility assets, which could benefit gas-fired power plants and penalise batteries, said Pedro Linares, energy regulation expert and professor at Comillas University.\nThe new capacity market aims to pay for backup capacity to cover the intermittency of renewable energy. Renewables like solar and wind accounted for 67% of Spain’s 131 GW of total installed capacity at the end of 2024.\nThe mechanism could lead to “excess backup,” but it lacked specific penalties for assets failing to be available when summoned to generate, Linares added.\n“This is a positive measure, but it needs more details and faster implementation,” said Daniel Fernandez, regulation director at Engie Spain and secretary of Aprie, a lobby representing owners of 20% of the country’s gas-fired fleet.\nSpain closed a public consultation for the capacity mechanism last month. The country’s energy ministry expected the first auction to be held before summer, although some industry sources put a likely launch in the autumn.\nDiffering needsSome analysts reckon the capacity market as crucial to keep Spain’s 26 GW gas-fired power plants open amid low utilisation rates due to rising renewables generation.\nHowever, an industry expert, who spoke under the condition of anonymity, criticised the lack of details regarding auction parameters and the inclusion of existing gas-fired plants and batteries in the same mechanism, despite having differing needs.\nExperts had already warned that around 6 GW of gas-fired plants in Spain were unavailable due to inadequate maintenance, as companies refrain from investing due to their low profitability.\nStill, the new capacity market could improve profitability for battery storage, enabling the deployment of 4.5–5.5 GW of batteries by 2030, said Chema Zabala, managing director of the consultancy Alantra Energy Transition. Without this scheme, the country would only add around 2 GW, he added.\n“Four-hour batteries should be highly competitive in the auctions,” he said.\nBatteries will have a chance to compete with existing gas-fired plants and secure capacity, agreed Ainhoa Jimenez, storage director at solar lobby Unef.\nSpain currently had just 30 MW in operational grid-scale batteries and some 3.3 GW in pumped hydro storages. Meanwhile, the country’s national energy and climate plan envisioned around 17.7 GW of batteries and pumped hydro capacity combined by 2030.",
        "datetime":"2025-02-03T08:52:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]