[
    {
        "title":"Swedish industry opposes 0.3 GW capacity boost to Denmark",
        "subtitle":"(Montel) Sweden’s power-intensive industry told Montel on Monday it opposes plans announced last week for a 0.3 GW capacity boost between Sweden and Denmark as this may inflate power prices in southern Sweden.",
        "body":"“Increased capacity on export cables to continental Europe could lead to increased power prices, particularly in southern Sweden,” said Johan Bruce, managing director of industry lobby group SKGS.\n“[TSO] Svenska Kraftnat should spend its resources on improving domestic power cable capacity in Sweden.”\nThe Swedish TSO and its Danish counterpart Energinet said last Wednesday they had started a project to boost capacity on the Konti-Skan link by almost 40% to 1 GW by the 2030s.\nCompetitiveness fearsBruce said that Sweden already had ample cross-border capacity with Denmark and other European nations, where power prices are higher than in Sweden, adding that it was important to ensure the competitiveness of Swedish industry.\nSpot power prices were roughly 40% lower in northern Sweden than in the south last year, since current domestic grid capacity is insufficient to balance out the northern power surplus.\nIn neighbouring Norway, political parties have gone against plans to renew the two oldest power cables to Denmark (500 MW) later this decade over similar concerns, highlighting a growing scepticism over cross-border electricity trade in the region.",
        "datetime":"2025-02-10T12:15:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]