[
    {
        "title":"Traders fear bankruptcy as Italy TSO to hike collateral requirement",
        "subtitle":"(Montel) Italian TSO Terna’s proposed changes to dispatching guarantees could force energy traders to boost collateral deposits by up to 16-fold, threatening smaller renewable producers’ viability and potentially driving up spot power prices by EUR 5-6\/MWh, traders told Montel.",
        "body":"All 12 trading companies contacted by Montel to discuss the measures said the increased financial collateral requirements in the plan would particularly impact smaller traders who aggregate output from multiple small renewables installations. They said this could force some to exit the market or significantly reduce operations.\nTerna’s consultation period on the proposals runs until next Monday and if confirmed will be introduced in the next six months.\nFor medium- and low-voltage connected installations, Terna proposes extending required financial collateral from five to 45 days of the value of a plant’s nominal production capacity. Around 90% of Italy’s solar installations are connected to these grids, traders said.\nFor a 5 MW hydropower plant, guarantees would surge from EUR 50,000 at present to EUR 625,000 under the new rules, industry group Assoidroelettrica said.\nThe total increase in guarantees held by Terna just for small non-dispatchable units could reach EUR 1-1.5bn, which the group warned could have “systemic implications”.\nSome trading firms calculated that their guarantee requirements could jump by 16-fold under the proposed changes, said Gabriele Franze, Italy country manager at trading firm Inxieme Energia.\n“Twilight zone”“If this goes through, smaller producers will be trapped in a twilight zone where no one will buy their power as it will be too expensive, and over time many of these businesses will not be sustainable,” said Michele Burbi, CEO of trading firm Eco Trade.\nMatteo Donati, managing partner of renewables developer ReFeel, said that although “dispatching guarantees don’t affect us directly because we don’t dispatch, traders will likely pass these extra costs on to us”.\nMarket participants said the changes could slow Italy’s renewable energy expansion and lead to increased market concentration. \n“Absurd situation”“It’s an absurd situation,” said Diego Pellegrino, head of energy trading association Arte. “We’re talking about requesting guarantees from plants that far exceed their annual turnover. This excessive collateral is not justified by any market parameters, correctness, security or guarantee.”\nThe “guarantees are being hiked at a time when the banking system is extremely rigid, so it’s basically a gift to the banking system which, if it issues this type of guarantee, will profit again from something that is excessive collateral”, he added. \nThe changes would particularly impact solar installations below 10 MW – representing more than 70% of Italian solar generation – as major utilities like Enel typically only handle larger volumes. \nOnly 4-5 companies in Italy, including Eni and Enel, with investment-grade ratings from top agencies would be exempt from the new requirements.",
        "datetime":"2025-02-12T11:30:33",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROPOWER\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]