[
    {
        "title":"Trump’s sanctions wildcard may hit Russia LNG flows – analysts",
        "subtitle":"(Montel) Potential sanctions on Russian LNG exports by new US president Donald Trump are a wildcard in terms of European supply, analysts told Montel this week.",
        "body":"“In the short term, not a huge amount is going to change but Russian sanctions could be the most important,” said Alex Munton, US-based Rapidan Energy’s global gas and LNG research lead.\n“We haven’t seen what the policy toward Russia will look like but I would give it 60% odds, maybe a little better, that Trump will go harder on sanctions,” he added, with LNG exports from the country to the EU reaching record highs last year amounting to about 7.5% of total gas consumption.\nThe US has imposed multiple sanctions on Russia’s mammoth energy industry, from banks to upstream producers, amid efforts to stop Moscow funding its war with petrodollars but its LNG sector has remained fairly unscathed.\nFor example, the Yamal and Sakhalin plants, accounting for nearly 95% of Russia’s record LNG exports last year of 44.6bcm, had not been targeted so far.\nHowever, Trump had a motive for penalising Russian LNG, analysts agreed.\n“Go for the kill”“There is a growing sense that [president Vladimir] Putin’s economy is on its knees and Trump should go for the kill,” said Munton, adding that while painful for Europe at first, US consumers would be spared. “If anything, it’s a benefit for US consumers and companies.”\nThe new president also reiterated that the EU must buy more US LNG and oil to avoid punitive trade tariffs, with the country the largest supplier of the chilled fuel to Europe last year, while Russia was in second place.\n“The obvious way for [the] EU to import more US LNG is to sanction Russian LNG,” said Laurent Ruseckas, executive director at S&P Global.\n“He wants to sell US LNG and Russian gas is an obstacle,” he added.\n“Maintaining Russian sanctions, while expanding US production could suppress global energy prices and enhance American market share – suggesting a strategy that aligns geopolitical leverage with commercial expansion,” agreed Claudio Steuer, an energy consultant and faculty member of IHRDC, Boston.\nEnergy emergencyFollowing his inauguration on Monday, Trump – the Republican beginning his second term in office – declared an energy emergency to unleash fossil fuel production with the aim of reshaping global energy markets.\nEven though the EU wants to wean itself off Russian energy, meanwhile, further sanctions from Brussels were unlikely for now given overall supply concerns, Montel reported yesterday.",
        "datestamp":"23-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]