[
    {
        "title":"Trump set to overturn LNG export pause imminently – analysts",
        "subtitle":"(Montel) Market participants expect US president Donald Trump to overturn a pause on LNG exports to the EU today once he is inaugurated, while maintaining sanctions on Russia, they told Montel on Monday.",
        "body":"“The most imminent policy measures Trump will take is reverse the ban on granting new LNG export licences,” said Rabobank energy strategist Florence Schmit. “This will be beneficial for Europe, although only from 2030 onwards once the plants in question start operating.”\nTrump is due to be inaugurated in Washington DC at 12:00 local time or 18:00 CET, with participants expecting him to focus on overturning the pause as one of his first measures.\nNational emergency?After a pause on non-free trade agreement (FTA) export approvals amid environmental concerns instituted by the outgoing administration of Joe Biden, the oil and gas industry expects to gain approval to build new export facilities and pipelines in the Gulf of Mexico.\nTrump vowed last August to declare a national energy emergency to overturn the pause if he took office and has been widely forecast to ramp up LNG production, which could provide a USD 1.3 trillion boost to the domestic economy, S&P said in a report quoted by the Financial Times last week.\nThe energy department under Trump would likely revert to the long-standing policy of issuing non-FTA permits in an “expeditious manner” under guidelines that approved those permits until 2050, said Jack Weixel, senior director of energy analysis at oil and gas intelligence firm East Daley Analytics. \nExports to EuropeTrump would likely begin pushing to boost US oil and gas production to fuel increased LNG exports to Europe, said Jay Young, CEO of Texas-based oil and gas developer King Operating Corp.\nTo help facilitate more American LNG cargoes to Europe, US companies may be incentivised to invest in European regasification facilities, Weixel said.\nBut increasing US LNG exports to Europe could cause friction as Europe aims for low-carbon intensity energy supply, while Trump may not see that as a priority, said Jason Feer, global head of business intelligence at consultancy Poten & Partners.\nAnother source of friction could be whether Trump makes good on promises to use tariffs to pressure the EU to buy more US LNG.\n“I suspect there will need to be a wider deal,” Feer said. “Europe needs US LNG supply and their near-term options to seek supply from elsewhere are limited, so I think the US will have a significant amount of leverage in this negotiation.”\nSanctions on RussiaTrump may use oil sanctions on Russia as a bargaining tool for Ukraine peace negotiations, said Schmit, but she noted maintaining LNG sanctions on Russia benefit the US energy industry.\nUsing sanctions as a bargaining chip, presents a conundrum, however, Feer said. If Trump lifts sanctions on Russia LNG, that may “make it harder for US LNG to find markets in Europe”, he added. “It’s unclear how the administration will balance these competing demands.”",
        "datestamp":"20-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]