[
    {
        "title":"Turkey’s 1.3bcm Turkmengaz deal may benefit Europe – minister",
        "subtitle":"(Montel) Turkey has signed an agreement with Turkmenistan for the supply this year of 1.3bcm of gas, some of which could also be pumped to European markets, Turkish energy minister Alparslan Bayraktar said late on Wednesday.",
        "body":"The supplies would be delivered between March and the end of the year under a swap deal between Turkey’s state-owned pipeline operator Botas and Turkmenistan’s Turkmengaz, Bayraktar said in a statement.\n“It is… important that those resources can go to Turkey and Europe, especially through Turkey, which needs it. In this sense, our infrastructure is ready for this,” he said.\nEU interestSince the halt at the start of January of Russian gas transit through Ukraine, he noted European countries, notably Slovakia, had expressed interest in sourcing gas from Turkey.\nThe Turkmenistan gas will be shipped to Iran and then transported to Turkey’s Gurbulak entry point through the Iran-Turkey gas pipeline.\nTurkey consumes more than 5bcm\/year of gas and relies on supplies from Russia, Azerbaijan and Iran, along with LNG imports from various suppliers.\nIt will renegotiate two key gas contracts with Russia at the end of the year, potentially expanding its regional transit role following the halting of Russian exports via Ukraine, market participants told Montel in January.",
        "datetime":"2025-02-13T08:32:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]