[
    {
        "title":"UK battery storage faces growing connection backlog – study",
        "subtitle":"(Montel) A growing number of UK battery energy storage systems (BESS) waiting for a grid connection has prompted concerns that the backlog could stifle buildout and further investment, a new study has warned.",
        "body":"Analysis from Cornwall Insight estimates that the pipeline of BESS projects awaiting connection is now 61 GW – far above the government’s 2030 target of 30 GW. \nBy 2035, Cornwall says, the queue is expected to hit 129 GW – over four times the required 29 GW expected by this date, raising questions about which projects will move forward and how grid access will be managed. \n“Several challenges threaten 2030 clean power goals, with the connection queue being a major hurdle,” said James Lomax, analyst at Cornwall. \n“Given the rapid expansion of battery energy storage over and above forecast connections capacity… it could well be that more than 100 GW of BESS that wants to connect to the network will not get the option to until at least 2035 or even much later,” he added.\n“If an asset can’t connect to the grid, it simply can’t contribute.”\nPrioritising projectsCurrently, the UK’s battery energy storage capacity of just over 4 GW is well below the 2030 target.\nSome battery projects will be given priority over other connections in the backlog, including those with capacity market contracts (around 14 GW), projects contracted to connect by 2026 (4.5 GW) and those significantly progressed in planning or construction (21.5 GW). \n“To meet the Clean Power 2030 capacity targets, we would need to connect assets to the network on average 2.5 [times] quicker than we have over the past five years,” Cornwall Insight said.",
        "datetime":"2025-02-17T14:56:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]