[
    {
        "title":"UK needs zonal pricing, market not credible as is – Ofgem",
        "subtitle":"(Montel) A shift to zonal power pricing is the best option for Britain, not least because of the anticipated boom in AI-driven data centre demand, Jonathan Brearley, CEO of regulator Ofgem told Montel’s Plugged In podcast on Friday.",
        "body":"“With the amount of change that’s in this sector, the idea we leave this market as it is, I don’t think is credible.\n“We’ve had a robust debate within Ofgem [and] we have come to the view that zonal pricing is the best way forward. It’s not a unanimous view but by and large we think that is the best way to create a system that’s adaptable,” he said.\nConsidering splitThe UK government is considering a shift from a national wholesale market price to splitting the country into at least six pricing zones as part of its current review of electricity market arrangements.\nDoing so would allow industrial consumers, including data centres, to locate to areas with plenty of wind generation, for example, allowing them to access cheaper electricity, Brearley said.\n“[It’s a] big debate within Ofgem. Not finalised but we think it’s the right thing to do,” he said.\nBrearley likened the contentious discussion around zonal pricing to the government’s contracts for difference subsidy scheme, which had faced similar resistance within industry initially, before going on to score significant success, namely the drastic reduction in prices for offshore wind.\n“People told me at the time this was too disruptive and this wasn’t going to be good for investment and it drove a huge increase in investment. All my experience suggests that when you set clear goals, when you work with the industry properly, that you can achieve far more than you imagine you can,” he said.\nUtility viewMeanwhile, Greg Jackson, CEO of UK utility Octopus Energy, has openly backed zonal pricing, saying it would attract energy-intensive industry to areas with the cheapest electricity prices.\nBut Alistair Phillips-Davies, CEO of rival SSE, holds a different view.\n“Personally, I’m baffled as to why we’re having a discussion about zonal pricing,” he told the BBC’s Today programme this week.\n“Zonal pricing is a postcode lottery for both people looking to build massive new infrastructure and work out what their costs might be,” he said, warning consumers would also face “possibly huge differential prices” across the country.\n“What we need to do is get zonal dismissed.”\nThe UK government is widely expected to take a decision on whether to move to zonal pricing by June.\nThe Nordic region, for example, has such a mechanism, which observers say can more efficiently match local supply and demand, leading to more competitive power prices.\nListen to the Plugged In podcast here.",
        "datetime":"2025-02-07T09:04:20",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]