[
    {
        "title":"UK plans to fast-track nuclear build with planning reform",
        "subtitle":"(Montel) The UK government on Thursday announced plans to expedite the construction of nuclear power plants across England and Wales by stripping back planning regulations to facilitate the development of small modular reactors (SMRs).",
        "body":"A press release from the Department for Energy Security and Net Zero said that regarding nuclear power, “for too long the country has been mired by delay and obstruction, with a system too happy to label decisions as too difficult, or too long term”.\nIt noted that no new nuclear power plants have been built since 1995 and that only one – Hinkley Point C – is currently under construction, “leaving the UK lagging behind in a global race to harness cleaner, more affordable energy”.\nNew groundThe statement notes that nuclear development is currently restricted to eight sites, as a result of “archaic planning rules that haven’t been looked at since 2011”.\nThe reforms announced today include “scrapping the set list of 8 sites”, “removing the expiry date on nuclear planning rules” and “setting up a Nuclear Regulatory Taskforce”.\n“The refreshed planning framework will help streamline the process to encourage investment and enable developers to identify the best sites for their projects, supporting development at a wider range of locations,” the statement said.\nPart of the government’s wider Plan For Change, the reforms also include a proposal that small and advanced modular reactors be built in the UK for the first time. \nSMRs would be integrated into existing planning frameworks, allowing for their construction in various locations, including those that can support energy-intensive infrastructure such as AI data centres. \n“Strongest signal”Tom Greatrex, chief executive of the Nuclear Industry Association, told Montel that the proposal was “the strongest signal yet that new nuclear is critical to the growth and clean power mission”. \n“A more streamlined planning system will give certainty to investors, the supply chain and communities, and will enable us to get on with building new nuclear plants on more sites and at pace for a cleaner, more secure power system,” he added.\nThe UK currently has around 6.5 GW of installed nuclear capacity.",
        "datetime":"2025-02-06T11:03:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]