[
    {
        "title":"Ukraine eyes Russian-made parts to complete 2 GW reactors",
        "subtitle":"(Montel) Ukraine is mulling the purchase of unused Russian-made equipment from Bulgaria that could help it add 2 GW of much needed power capacity within as little as three years, an expert told Montel.",
        "body":"The sale depended on the condition of the equipment and the availability of the necessary components, which would allow the country to complete the unfinished Khmelnytskyi nuclear power plant in western Ukraine, said Croatian nuclear expert Davor Grgic.\nIt made sense, since by comparison the country would need at least 5-8 years to complete the reactors using Western equipment, as it would not be compatible with the units and require adapting, he added.\nReactors 1 and 2 (2 GW combined) at the Khmelnytskyi plant are operational but 3 and 4, where construction began in the 1980s, were never finished because of the Chernobyl disaster.\nEarlier this week, the Ukrainian parliament passed the bill allowing the purchase of the Russian-made equipment, whose price has previously been estimated at EUR 600m.\nZelensky welcomes planUkrainian president Volodomyr Zelensky welcomed the development, which had initially been held up by local opposition.\nThe purchase would allow Ukraine to limit its dependence on power imports and strengthen its energy security, he added in his nightly video address.\nUkraine, which seeks ways to make up for the loss of the Russian-occupied 5.7 GW Zaporizhzhia nuclear power plant and other crippled energy infrastructure, first expressed interest in purchasing the equipment 18 months ago.\nOn Wednesday, the leader of Bulgaria’s biggest party Boyko Borissov confirmed Bulgaria’s intention to sell the reactors.\nUkrainian lobby groups have, however, expressed concerns about the deal, with environmental advocates Greenpeace warning the quality of the equipment and its compliance with modern quality standards was questionable.",
        "datetime":"2025-02-13T13:37:40",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]