[
    {
        "title":"US metals tariffs “wake-up call” for EU renewables industry",
        "subtitle":"(Montel) The latest tariffs announced by president Donald Trump, on all steel and aluminium entering the US from next month, should spur EU efforts to protect steelmakers and establish regional renewables industry supply chains, industry participants told Montel on Wednesday.",
        "body":"“It’s a wake-up call,” said Jules Nyssen, head of French renewables lobby SER, with wind turbine towers made of steel, as well as foundations and floating structures. Steel is also used for the structures that support solar panels.\nAlthough the tariffs would not directly concern the supply of steel and aluminium for European equipment manufacturers, Trump’s measures could “push the European Commission to…start recognising that for certain sectors that are deemed strategic we need to establish local, or at least European, value chains,” he said, citing offshore wind power.\nThere was unlikely to be a “major negative impact” on European renewables developers, unless steelmakers – which partly rely on exports – were to shut down completely, “which I find unlikely”, he said.\nWhile European steelmakers losing access to the US market could potentially result in lower costs for renewables developers amid lower demand, the shutting down of any production capacity could have “quite the opposite effect”, he said.\n“That would justify protecting the European market,” he added.\nJacques Percebois, head of the Creden energy research centre, agreed that European steelmakers would “likely” be impacted by the new tariffs.\n“But I’m not sure [Trump] will maintain them in the long term. If Europe’s retaliatory measures significantly affect the US economy, that could make him backtrack,” he added.\nCheap Chinese supply“Our industry is already struggling to compete with cheaper products that could suddenly arrive on the market,” said French industry and energy minister, Marc Ferracci, on French TV “TF1” on Tuesday, adding that Europe needed to “stay united and respond firmly”.\n“There is currently a lot of Chinese steel entering Europe, and we are fighting at the European level to impose what is called a safeguard clause – meaning limiting Chinese steel imports to Europe and also imposing a carbon tax at the borders,” he added.\nBut Joseph Fonio, head of RWE Renewables France, played down concerns of any notable impact to the region’s renewables buildout costs.\n“The impact would be quite marginal because the markets are fairly separate,” he told Montel, noting that while European and Asian supply chains served the European market, the US was largely self-sufficient.\n“There is very little crossover between European and American supply chains in renewable energy,” he added.\nOn Tuesday, European Commission president Ursula von der Leyen said that Trump’s tariffs would “trigger firm and proportionate countermeasures”.\nThis spring, the EC is set to propose a steel and metals action plan, which would include the use of “trade defence instruments”.",
        "datetime":"2025-02-12T15:01:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]