[
    {
        "title":"US quits Paris climate treaty amid complete energy policy overhaul",
        "subtitle":"(Montel) US president Donald Trump has ordered the country’s withdrawal from the Paris agreement, a global pact to limit global warming, saying it does not reflect US values.",
        "body":"The US ambassador to the UN would “immediately” submit formal written notification of the country’s withdrawal from the agreement, according to an executive order signed by the newly instated president on Monday.\n“The United States will consider its withdrawal from the agreement and any attendant obligations to be effective immediately upon this provision of notification,” it added.\nThe 2015 treaty aims to limit the global temperature rise this century to 1.5C compared with pre-industrial levels.\nSteer dollars away“The United States’ successful track record of advancing both economic and environmental objectives should be a model for other countries,” the order said.\nIt said that, in recent years, the US “purported” to join international agreements and initiatives that did not reflect the country’s values or contributions to the pursuit of economic and environmental objectives.\nSuch agreements “steer American taxpayer dollars to countries that do not require, or merit, financial assistance”, it added.\nTrump also declared an energy emergency to buoy fossil fuel production with the aim of reshaping global energy markets, including the export of more LNG, vital to Europe’s security of supply, Montel reported earlier.\nEurope takes the lead“The US withdrawing from the Paris agreement is unfortunate, but multilateral climate action has proven resilient and is stronger than any single country’s politics and policies,” said Laurence Tubiana, CEO of the European Climate Foundation and a key architect of the treaty.\n“Europe – alongside other partners – now has the responsibility and opportunity to step up and lead,” she added.\nGina McCarthy, former White House national climate adviser, said by leaving the agreement, the new administration was “abdicating its responsibility to protect the American people and our national security”.\nLinda Kalcher, executive director of European environmental think tank Strategic Perspectives, warned the Trump administration could bring “turbulent geopolitical times”.\n“There is a risk that the EU turns into a deal-taker, at the mercy of an unpredictable US president,” she said, adding that preserving transatlantic relations should not “translate into weakening European laws or slowing down its net-zero transition”.\nUpdates published story with reaction.",
        "datestamp":"22-01-2025",
        "category":[
            "POLICY"
        ]
    }
]