[
    {
        "title":"US tariffs on Spain may spur LNG diversification – analysts",
        "subtitle":"(Montel) President Donald Trump’s threat to hike tariffs on trade with Spain may provide a good opportunity for the Iberian nation to cut its dependency on US LNG, analysts said on Tuesday.",
        "body":"Trump’s administration may impose “at least a 100% tariff” on Spanish trade with the US due to Madrid’s low defence expenditure, he said late on Monday.\nThe freshly inaugurated president failed to elaborate on the threat, while erroneously placing Spain in the BRICS bloc, which includes Brazil, Russia, India, China and South Africa.\n“It would make sense to think about diversifying” Spain’s LNG supply away from the US, in light of this, Ignacio Urbasos, energy and climate researcher at Spanish think tank Elcano, told Montel.\n“If we are going to replace Russian gas, which accounts for almost 20% [of Spain’s supply], it wouldn’t be a good idea to replace it with American gas, which presents obvious geopolitical risks.”\nQatari LNG is a possible alternative, he said, pointing to increased export capacity from the nation entering the market later this decade.\nAlso, LNG projects in Africa scheduled to come online this decade could help with the diversification of Spain’s supply mix, Urbasos said.\nThis was despite the looming expiration of an existing multi-year contract for Nigerian LNG with Spanish utility Endesa.\nSpain last year imported an estimated 3.86m tonnes (5.25bcm) of LNG from the US, already down from 5.29m tonnes in the previous year and a record 8.44m tonnes in 2022, according to Kpler estimates.\nRussia was Spain’s largest supplier last year, providing 4.75m tonnes of a total 13.7m tonnes from all origins, the data showed.\nNo choiceMarina Tsygankova, gas analyst at LSEG, agreed that US tariff threats “potentially” signalled a good opportunity for Spain and Europe to diversify its LNG supply.\nBut if Europe intended to phase out Russian gas, it may have little choice other than to pay up for US LNG, even if there are increased tariffs, she said, noting this would mean “a win-win situation for Trump”.\nUrbasos agreed. “Trump tweeted a few weeks ago that the solution to the trade war was to buy more US LNG and oil,” the analyst said, noting that energy was unlikely to play a role in any potential diplomatic spat between the two sides.\nMinister respondsMeanwhile, Spanish minister Pilar Alegria, responding to Trump’s comments, said in a statement that Spain remained a “reliable” trading partner for the US, as it aimed to continue strengthening its joint relationship.\nSpain was “obviously” not part of the Brics, she added.\nUpdates the story at 12:49 CET with comments from Spanish minister.",
        "datestamp":"22-01-2025",
        "category":[
            "GAS",
            "LNG"
        ]
    }
]