[
    {
        "title":"US-China tariffs unlikely to trigger rerouting of coal to EU – analysts",
        "subtitle":"(Montel) The US is expected to maintain its position as the EU’s third-largest supplier of thermal coal, but US-China tit-for-tat tariffs are unlikely to result in much of a rise in transatlantic volumes, analysts told Montel.",
        "body":"The US exported around 3.1m tonnes of thermal coal to the world’s largest consumer, China, last year, along with 5m tonnes of metallurgical coal, according to Kpler vessel-tracking data.\nHowever, US president Donald Trump this week imposed a 10% tax on Chinese imports, to which China responded with a 15% tax on imports of US coal and LNG.\n“China will be quick to adapt,” said Toby Hassall, lead coal analyst at LSEG, noting for example that the country had already ramped up imports of coking coal from Mongolia and Russia in recent months.\nUS coal would in turn be redirected to alternative markets, he added.\nHowever, there were also broader macroeconomic implications for the coal market, Hassall said, noting that the tariff spat was seemingly a “bearish development” for the global coal market.\n“It can have a negative impact on China’s economy, which could result in reduced consumption of coal, and therefore, potentially less imports,” he added.\nAlready, the Pacific Basin benchmark Ice Newcastle contract today hit USD 111\/t, its lowest since June 2021.\nMore supply to Europe?But the prospect of lower US supply to China was unlikely to result in a significant increase in flows across the Atlantic to EU consumers.\nEuropean countries – excluding Turkey – imported 3.16m tonnes of US thermal coal last year, or 15% of a total 21.6m tonnes, putting the supplier in third place, after Colombia and South Africa, according to Kpler figures.\n“We may see an increased volume of US coal flowing to Europe, although prices will ultimately determine where [US exports] end up,” Hassall said.\nAnother coal analyst, with a Swiss trading house, said current price levels would not incentivise any redirection of shipments from the Chinese market to Europe.\n“At current prices, this 3m tonnes of US coal will rather go domestically [within the US], if not to China,” he said.\nA coal trader with a German utility also noted that the EU-wide ban on Russian coal since mid-2022, in response to the war in Ukraine, had reduced the region’s need for US coal.\n“High-sulphur coal has kind of lost its spot in Europe, since there is no low-sulphur Russian coal around,” he said.\nUS coal is typically higher in sulphur content than Colombian and South African material, and therefore requires blending with lower-sulphur coal, which until recent years was most commonly sourced from Russia.",
        "datetime":"2025-02-07T11:12:07",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        COAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]