[
    {
        "title":"Vattenfall to invest EUR 15bn in “challenging market” – CEO",
        "subtitle":"(Montel) Swedish utility Vattenfall will invest SEK 170bn (EUR 15bn) over the next five years in the face of a challenging market dogged by flagging wholesale prices and rising supply-chain costs, CEO Anna Borg said on Thursday.",
        "body":"“This is the first time we are presenting a five-year investment horizon, previously it was two years, which makes it a bit difficult to compare. But in the short term, we do not see lower investments, rather somewhat more,” Borg told Montel after presenting the group’s 2024 result in Stockholm.\nVattenfall’s planned investment comes at a time when other energy companies, such as Orsted and Equinor, have cut their planned investments in renewable energy towards 2030.\nBorg acknowledged that lower electricity prices had made investments in new generation capacity more challenging, with wholesale power prices in the Nordic and German markets dropping 36% and 18%, respectively, last year at the same time as costs increased due to supply chain bottlenecks and inflation.\nGrid and offshore windThe bulk of the SEK 170bn investment would go to grid network projects and offshore wind farms, said Borg, with SEK 77bn allocated to wind alone.\nThe company had not budgeted any new investments in nuclear power, although company continued to explore the potential for at least two reactors at its Ringhals power station.\n“The model for state risk management, which will be presented in the spring, must first go through parliament. The work with concrete offers from suppliers is not yet complete. Then there will be a practical negotiation [with the state] about the details,” said Borg, adding that the state support model also had to be approved by the European Commission.\nEarlier today, Vattenfall reported its operating profit more than doubled last year to SEK 39.9bn, although its profit from underlying operations fell SEK 0.2bn to SEK 19.8bn – partly due to lower wholesale prices.\nEUR 1 = SEK 11.32",
        "datetime":"2025-02-06T10:24:55",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]