[
    {
        "title":"Zonal power pricing would raise costs for Britain – Afry",
        "subtitle":"(Montel) Britain should enhance its electricity market rather than switch to a zonal power pricing system as the latter could result in “significant” costs for the country, consultancy Afry said on Monday.",
        "body":"The country could benefit from improving its current system, making bilateral agreements with European grid operators, expanding on existing trading mechanisms, without the need for complex regulatory changes, it said in the report.\n“Overall, our view is that an enhanced national market design could deliver positive benefits rapidly with limited downside risk,” the report said.\n“The alternative option of a zonal market has a wider range of outcomes, with higher possible benefits but also potentially resulting in significant net overall costs.”\nThe UK government is considering switching to zonal power pricing, where prices vary by region based on local supply and demand, as part of broader reforms aimed at improving grid efficiency and integrating more renewable energy. The government is expected to decide on whether to switch later this year.\nThe head of regulator Ofgem told Montel’s Plugged In podcast last Friday that zonal power pricing was the best option for the country.\nHigher capital costs?According to Afry’s analysis, a shift to zonal pricing could deliver an estimated GBP 3.3bn in net economic benefits from 2030-2050.\nHowever, the report warned that this could be negated by higher capital costs, delays in implementation and inefficiencies in forecasting transmission constraints.\nOne of the key areas it identified for improvement in the national pricing model, in lieu of a switch to zonal, was the management of interconnectors.",
        "datetime":"2025-02-10T15:45:42",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRANSMISSION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]