[
    {
        "title":"“Capacity market has to come” – German energy minister",
        "subtitle":"(Montel) A capacity market should be a top priority for the next German government in order to ensure secure supply amid the country’s energy transition, economy and energy minister Robert Habeck said on Tuesday.",
        "body":"“A capacity market has to come,” he told the Handelsblatt energy summit in Berlin, with the growth of intermittent renewables output heightening concerns about having enough power to keep the lights on.\n“It should be one of the first projects that the next government pulls to the forefront after the next election,” said Habeck, with previous plans for such a system – where producers are paid to keep plants on standby for times of supply scarcity – derailed by the recent collapse of the Free Democrat, Social Democrat and Green coalition government.\nHabeck, meanwhile, remains an electoral candidate for the Green party, with the general election due on 23 February.\n“Not thought through”“The energy transition has not been thought about in an integrated manner until now,” Sven Becker from TSO Trianel told reporters ahead of the conference.\n“And the one-sided construction of renewables has led to upheavals.”\nThe shift to a capacity market should also be allied to linking household\/small-scale solar and battery storage systems to the grid to act as “a buffer”, increasing flexibility, Becker added.\nHowever, such a proposal could be hampered by construction fees for batteries and the imposition of transmission charges, which had to change to keep supply and demand in balance, he said.\nBattery pushChristoph Mueller, CEO of TSO Amprion, noted during the conference that the push into batteries could change many of the equations for the nation’s power mix.\nHe noted that, just a few years ago, batteries barely figured in Amprion’s plans but now the company had seen projects amounting to 75 GW applying for connection to its grid.\nThe centre-right Christian Democrats are expected to take the largest share of the vote in the upcoming election, with the party backing the building of more gas plants, as opposed to the hydrogen-ready units favoured by the previous government, while also mooting a return to nuclear.\nCorrects date of election",
        "datestamp":"22-01-2025",
        "category":[
            "BATTERIES\/STORAGE",
            "POLICY",
            "TRANSMISSION"
        ]
    }
]