[
    {
        "input": "French green support rockets to EUR 6.8bn amid low power prices (Montel) France will pay a hefty EUR 2.5bn this year and EUR 4.3bn next in public subsidies to support wind and solar plants, due to lower wholesale power prices, the country’s CRE energy regulator said on Wednesday. The forecast payouts are a reversal of the situation in 2022 and 2023 when these renewable producers paid a total of EUR 5.9bn to the state as wholesale prices surged.\nSubsidised plants must return revenues to the state when market prices exceed their contract prices.\nWholesale prices had returned closer to “normal” levels since the spikes of 2022 in the aftermath of Russia’s invasion of Ukraine.\nIn 2025, subsidy levels for power and gas renewables would return to those seen before the energy crisis at just over EUR 6bn, the CRE said, adding support for solar farms would account for about half of the total.\nHowever, onshore wind, which represents half of the total volume of subsidised renewable power generation, yielded EUR 3.4bn to the state last year and was expected to generate about EUR 0.3bn this year, the regulator said.\nSupport for biomethane injected in the gas grid should increase EUR 0.3bn from 2023 to EUR 1.1bn this year and EUR 1.2bn next.\nMeanwhile, the emergency measures taken to protect consumers’ bills from the impact of the energy crisis cost the French state EUR 26.3bn, most of it in 2022-23, including EUR 21.5bn for power and EUR 4.8bn for gas, CRE said.\nAs the “shields” were being phased out amid lower energy prices, they should cost only EUR 0.4bn this year and nothing next year, it added.",
        "sentiment": "Neutral"
    },
    {
        "input": "France’s largest solar farm project still viable – Engie (Montel) France’s largest solar project is still viable despite a government decision preventing the clearing of a 700-hectare forest to make way for the farm, its main developer, energy firm Engie, told Montel. “At this stage, the Horizeo project has not been buried, it is still being examined” by the French authorities, said an Engie spokesman.\nThe 820 MW project is at risk following a decision by France’s ministry of the environment not to include it on the list of projects that will be exempt from soil artificialisation quotas.\nThat decision would prevent the developers from razing the pine forest.\nThe plan did not meet “the legal criteria and there was no real carbon offsetting”, an environment ministry spokeswoman told Montel. However, she said the decision was “not definitive”.\nA spokeswoman at France’s energy and economy ministry said the solar project was “crucial” for the nation’s goal to triple solar capacity to 54-60 GW by 2030.\nThe park in the southwest of France would meet the electricity needs of 500,000 inhabitants, at a production cost of around EUR 70/MWh, according to a report in French daily Les Echos.\nConstruction was due to start in late 2025 or early 2026, with commissioning scheduled in late 2027.\nA source close to the matter said a new government could reverse the outgoing environment ministry’s decision, as the current government had only a caretaker role after the French general election left no single party with a majority.\nEngie and the other project developers, Banque des territoires – a public bank – and Neoen had already scaled down their ambitions after studies and a public consultation concluded that the destruction of pine trees was the main point of contention with the local population.",
        "sentiment": "Bullish"
    },
    {
        "input": "Endesa’s H1 earnings drop amid lower prices and thermal output (Montel) Spanish utility Endesa’s earnings before interest and tax (Ebit) dropped 9% year on year to EUR 1.4bn in the first half of the year amid lower power and gas prices and reduced thermal power generation, it said on Wednesday. Results were affected by a 56% decrease in wholesale power prices in Spain to EUR 39/MWh during the first six months of the year, compared with EUR 88/MWh in the same period last year, it added in a statement.\nGas prices saw a similar drop, with the European reference TTF front-month price dropping 34% year on year to EUR 29.50/MWh from January to June, it added.\nMeanwhile, Endesa’s nuclear and gas-fired generation decreased 10% to 19.8 TWh, compared with 21.9 TWh in the first half of 2023.\nThis was partially offset by a slight increase in renewable production, which totalled 24.5 TWh in the first six months, driven by a 69% jump in hydropower output to 4.4 TWh, according to the report.\n2 GW solar saleEndesa planned to close “in the near future” the sale of a minority stake in a 2 GW operating solar portfolio in Spain, it said, without proving further details.\nEndesa’s renewables capacity in Iberia increased 9% year on year to 10.1 GW in the January-June period.\nCEO Jose Bogas urged the government to improve grid regulation and remuneration to attract industry.\n“The grid is not sized to meet the needs of demand and therefore, between 2020 and 2023, up to 30 GW of new capacity has been rejected due to lack of grid capacity throughout Spain,” he said. \nSinking forward power prices in Spain amid the country’s green boom could attract industrial companies from other EU nations seeking lower costs but grid connections were hindering such efforts, industry analysts previously told Montel.",
        "sentiment": "Bearish"
    },
    {
        "input": "Equinor’s H1 profit slides 24% amid lower gas prices (Montel) Norwegian oil and gas major Equinor’s profit slumped by a quarter year on year in the first six months of 2024 amid falling gas prices. Equinor posted an adjusted operating profit for the first half of USD 15bn, down from USD 19.7bn one year ago, according to its interim financial report published on Wednesday.\nThe group achieved an average sales price of USD 9.66/MMbtu (EUR 30.35/MWh) for gas sold via pipelines to the rest of Europe between January-June, down 37% from H1 last year, while realised oil prices rose 7% to USD 76.8/bbl.\nTotal gas production in the six months to June stood at 965m barrels of oil equivalent per day, up 4% year on year.\nRenewable energy unit lossThe group’s renewable energy business made a USD 311m loss, down from a USD 180m loss a year ago, mainly due to a USD 147m net loss following an offshore wind asset swap, under which Equinor took full ownership of the Empire Wind project, while rival BP took over the Beacon wind scheme, both in the US, the group said.\nRenewables output, however, rose 69% compared to January-June last year and stood at 1.4 TWh, driven by new production from onshore wind power plants in Poland and Brazil.\nIts total electricity production, including gas-fired power in the UK, was 2.4 TWh, up from 2.1 TWh a year earlier.",
        "sentiment": "Neutral"
    },
    {
        "input": "END OF DAY – Coal hits near 1-week high despite ample supply (Montel) European coal prices rose to a four-session high in Tuesday trading as some expectation of heightened post-summer demand marginally countered pressure from seasonally sluggish generation levels and ample supply. The front-month API 2 contract was last seen up by USD 2.10 to USD 110.05/t on Ice Futures, its highest level since last Wednesday.\nA coal analyst with a trading firm said the gains would be limited as they largely reflected a lack of clear market direction, with improved profit margins for coal-fired plants after summer somewhat offsetting bearish supply and demand fundamentals.\n“Depending on the efficiency you use, the darks for Q4 have been above [gas-fired plant profitability] for several months,” he said.\nThis was regarding the clean dark spread, or the profit margin for burning coal to produce power, with Montel last assessing the August German spread – for a 42% efficiency plant – at EUR -0.70/MWh, compared with EUR -15/MWh for August.\nBut more generally, the analyst noted the market was “not trading on much”.\nAs such, European buyers were still not importing much coal at present, with stocks at ports having thereby slipped this week to fresh two-year lows of 4.49m tonnes, Montel reported.\n“This has to do with seasonality in this period,” said a source at a Rotterdam-based dry bulk terminal. “It is quiet on the energy market.”\nGas lossesDespite the coal gains, the front-month European benchmark TTF gas contract last traded EUR 0.28 lower on the day at EUR 31.56/MWh, on Ice Endex.\nMarket participants pointed to healthy storage levels and the return of the US Freeport LNG facility, which helped to alleviate supply concerns ahead of winter.\nFor carbon, the bellwether Dec 24 EUA contract traded last EUR 1.36 higher at EUR 66.08/t on Ice Endex.",
        "sentiment": "Bullish"
    },
    {
        "input": "EU’s Russian LNG sanctions won’t impact Spain’s Naturgy – CEO (Montel) Spanish energy company Naturgy was “unaffected” by the EU’s veto on transhipment and re-export of Russian LNG out of the bloc, CEO Francisco Reynes said on Tuesday. “None of the impacts of the decisions that have been made at the European level… have affected us,” Reynes told reporters, noting that Naturgy’s 3.4bcm/year contract with Yamal LNG was signed “long before” the beginning of the war in Ukraine.\n“We do not do transhipment with Russian gas,” he said in a press conference to present the company’s results for the first half of the year.\nNaturgy’s contract with Yamal LNG involved penalties if volumes were not delivered so it had to be honoured, he said.\nIn February, the company said it had avoided purchasing Russian LNG beyond the contracted volumes since the conflict started. \nThe ban on reloading of Russian LNG in EU territory to be sent to other regions announced in June was part of the bloc’s latest package of sanctions against Russia.\nSpanish capacityThe EU’s veto could lead to an increase in volumes of the Russian chilled fuel arriving in Spain, which saw low utilisation rates at regasification plants, analysts and market participants said last month.\nSpain was one of the most prepared countries in Europe to receive the chilled fuel and had “sufficient flexibility capacity”, Reynes said during the presentation.\nSpain’s six regasification plants have a combined storage capacity of 22.7 TWh connected to the gas network, with an additional 2 TWh at the El Musel gas storage facility. As such, Spain makes up 44% of the EU’s tank capacity, according to TSO Enagas data.\nLNG tightness?The global LNG market was overall likely to remain tight towards the end of the year, with prices largely in line with the forward curves, Rita Ruiz, Naturgy’s head of financial controlling and energy planning, told analysts earlier in a conference call.\nLNG prices in Europe were last seen at around USD 11.40/MMbtu (EUR 35.72/MWh) for the second half of the year, according to Spark Commodities data.\nNaturgy had already hedged all its forecast LNG volumes for the remaining six months of the year, Ruiz said, without adding price details.\nMeanwhile, the company announced a price revision for 2024 of the long-term piped supply contract with Algeria’s Sonatrach, reflecting “current market conditions”, Ruiz said, without elaborating on price levels.\nNaturgy has a 5bcm/year contract with Sonatrach and prices were revised up in 2022. \nNaturgy’s earnings before interest and tax (Ebit) in the first half of the year increased 8% year on year to EUR 1.9bn, despite a “less favourable energy scenario”, it said in its results report.\nIts energy management division – which includes trading and other activities – posted EUR 384m in earnings, a 55.5% decline year on year.\nThis came amid lower energy prices and extraordinary trading results in 2023 as it reversed losses from unprofitable hedges in 2022, said Naturgy’s global head of financial markets, Steven Fernandez.",
        "sentiment": "Neutral"
    },
    {
        "input": "GAS – Prices edge lower amid well-supplied system (Montel) European gas prices edged lower on Tuesday morning amid unchanged fundamentals, with healthy storage stocks and the return of the US Freeport LNG facility alleviating any supply concerns ahead of winter. The benchmark Dutch TTF front-month contract was last seen down EUR 0.33 at EUR 31.51/MWh on Ice Endex, while the UK’s NBP equivalent was 0.73p lower at 73.23p/th on Ice Futures.\nTwo LNG cargoes had now left Freeport amid a partial restart following damage caused by hurricane Beryl earlier this month, said consultancy Icis.\nNews of LNG cargoes loading and leaving the facility again helped push the TTF August product to a one-week low of EUR 31.10/MWh yesterday.\nYet demand for US LNG across the continent remained muted amid relatively full storage sites, with imports into Europe and Turkey expected to reach around 1.7bcm this week, Montel reported on Monday.\nHealthy storageEU storage sites were last seen 83% full, putting them on track to be at 90% of capacity by 1 November in line with an EU mandate, analysts said.\n“The only bullish factor is Norwegian maintenance next month, which increases the possibility of unplanned outages and supply constraints in August,” said a UK-based analyst.\nPipeline exports from Norway into other European entry points were nominated at 321mcm/day, data from operator Gassco showed.\nThis was broadly stable on the day but down 15mcm on the same point a week ago amid an unplanned outage at the Visund gas field.",
        "sentiment": "Bearish"
    },
    {
        "input": "Endesa’s H1 earnings drop amid lower prices, thermal output drop (Montel) Spanish utility Endesa’s earnings before interest and tax (Ebit) dropped 9% year on year to EUR 1.4bn in the first half of the year amid lower power and gas prices and reduced thermal power generation, it said on Wednesday. Results were affected by a 56% decrease in wholesale power prices in Spain to EUR 39/MWh during the first six months of the year, compared with EUR 88/MWh in the same period last year, it added in a statement.\nGas prices saw a similar drop, with the European reference TTF front-month price dropping 34% year on year to EUR 29.50/MWh from January to June, it added.\nMeanwhile, Endesa’s nuclear and gas-fired generation decreased 10% to 19.8 TWh, compared with 21.9 TWh in the first half of 2023.\nThis was partially offset by a slight increase in renewable production, which totalled 24.5 TWh in the first six months, driven by a 69% jump in hydropower output to 4.4 TWh, according to the report.\n2 GW solar saleEndesa planned to close “in the near future” the sale of a minority stake in a 2 GW operating solar portfolio in Spain, it said, without proving further details.\nEndesa’s renewables capacity in Iberia increased 9% year on year to 10.1 GW in the January-June period.\nCEO Jose Bogas urged the government to improve grid regulation and remuneration to attract industry.\n“The grid is not sized to meet the needs of demand and therefore, between 2020 and 2023, up to 30 GW of new capacity has been rejected due to lack of grid capacity throughout Spain,” he said. \nSinking forward power prices in Spain amid the country’s green boom could attract industrial companies from other EU nations seeking lower costs but grid connections were hindering such efforts, industry analysts previously told Montel.",
        "sentiment": "Bearish"
    },
    {
        "input": "EU coal terminal stocks dwindle to new 2-year low (Montel) Coal inventories at northwestern European import terminals have diminished 3% over the past week to a more than two-year low as slack generation demand eroded import requirements. Combined inventories at four key terminals in Amsterdam, Rotterdam and Antwerp (ARA) were assessed last at 4.49m tonnes, a weekly decline of 0.14m tonnes and the lowest since the week beginning 25 April 2022, terminal data obtained by Montel showed on Tuesday.\n“There is a low stock level due to low use of coal at coal-fired power stations,” said a source at one large import terminal.\nIndeed, the August German clean dark spread – the profit margin for burning coal to produce power – was seen last at EUR -15/MWh for plants with an average efficiency of 42%, thereby deterring utilities from firing up units.\nAs a result, there were not many vessels expected to arrive in the near-term, the terminal source added.\n“There has been a slowdown in arrivals, since there is no demand for coal and stocks at the power stations are pretty full,” said a source at another import terminal.\nWith spot demand muted, the front-month API 2 coal contract has so far this month averaged just USD 107/t and compared with USD 113/t in the same period last month, on Ice Futures.\nBut there were signs of a tentative upturn in demand, with imports of all coal types to ARA hubs this month provisionally pegged at 2.4m tonnes, up from 2.1m tonnes in June and the highest level since January, according to DBX estimates.\nOf the ARA stock total, inventories at Rotterdam’s EMO terminal were 0.1m tonnes lower on the week at 2.7m tonnes, while stocks at the OBA terminal in Amsterdam were down 0.02m tonnes to 1.2m tonnes.\nInventories at Rotterdam’s smaller EBS terminal were unchanged at 0.5m tonnes, while Ovet’s Vlissingen terminal near Antwerp reported a slight decline of 0.02m tonnes to 0.54m tonnes, of which 0.47m tonnes were thermal.",
        "sentiment": "Bearish"
    },
    {
        "input": "European PPA prices slip in June on lower futures – Pexapark (Montel) Prices for European power purchase agreements (PPAs) fell by 1.5% on the month to EUR 50.1/MWh in June, tracking lower forward power contracts, Pexapark said on Tuesday. Germany’s Cal 25 baseload power contract touched EUR 89.20/MWh on 28 June, its lowest point since 2 May, “as prices shrugged off gains in European gas prices amid cooler temperatures and wet conditions”, the renewables specialist added in its latest monthly report.\nIn turn, all PPA prices reversed the previous month’s gains, with British prices falling the most, by 3.2%. Italian PPA prices dropped by 2.7%, while Dutch prices fell by 2.2%, Pexapark data showed.\nIn terms of disclosed deals, 23 agreements were announced, totalling 944 MW. By volume, this was down 36% from the previous month but up by around 35% on the same month a year ago.\nAll of last month’s deals were announced by corporates, with no PPAs by utilities disclosed for the first time ever, Pexapark noted.\nIts indices are based on the weighted average of 10-year, technology-specific contracts.",
        "sentiment": "Bearish"
    },
    {
        "input": "Bid zone split won’t solve German grid congestion – analyst (Montel) Splitting Germany’s power market into two or more bidding zones will not solve the country’s grid congestion issues, a Montel Analytics analyst said on Tuesday. EU regulatory agency Acer has proposed breaking up the bloc’s biggest single power market to one with as many as four different zones, especially as the nation struggles with congestion and bottlenecks in sending supply from its massive wind fleet in the north to power-consuming industries in the south.\nHowever, Tobias Federico, managing director at Montel Analytics, said it was not the single price zone that caused higher costs for grid balancing through redispatch but rather bottlenecks in the grid. He said more investment in expanding the grid was needed to solve the issue and creating more bidding zones would not incentivise this investment.\n“In practice, price zones do not incentivise the right investments, neither in grid infrastructure nor in the right locations for power generation plants,” he said.\n“The price signals in or the price differences between the zones are either too small or, above all, too volatile for investment decisions to be made on this basis alone.”\nPrice differencesEuropean TSOs are due to conclude an ongoing review of EU bidding zones in December, after which national regulators will be given six months to decide on possible reforms. Germany is under scrutiny due to its grid congestion.\nAnalysts last year estimated that a price zone split could result in prices in the north being around EUR 10/MWh lower than those in the south.\nTwelve economists said in an open letter earlier this month that a zone split would better reflect the realities in the market and increase flexibility more than a single price zone.\n“The disadvantages of a common price zone will increase massively in a world in which flexibility essentially no longer comes from power plants,” said Christoph Maurer, managing director of energy consultancy Consentec, on the social media platform X at the weekend.\nFlexibility neededPrice signals were needed to create more flexibility on the demand side and increase storage capacity, he added.\nHowever, Federico said there was a lack of incentives to invest in grid expansion, as well as technologies to increase flexibility.\nOn Monday, 11 industry associations including VIK, BDEW, VKU and Efet released a statement in favour of maintaining the single price zone as they said it ensured transparent long-term prices on the wholesale power market.\nThey said smaller bidding zones created stronger price swings, which raised uncertainty for investors and would lead to a drop in investment in the grid and renewables.",
        "sentiment": "Neutral"
    },
    {
        "input": "Financing questions linger as German H2 grid plan advances (Montel) German TSOs said on Tuesday they are still trying to sort out financing for the national hydrogen grid they proposed to the national regulator BNA yesterday. Energy company ENBW and TSO Ontras Gastransport released statements today pledging about EUR 1bn and a figure in the “mid-three-digit millions”, respectively, towards the project, which will be split into a series of smaller projects for individual companies to accomplish.\nHowever, FNB Gas, an association of transmission companies that helped draft the plan, said the total price tag would run to EUR 19.7bn, in contrast to Monday’s statement by EWE, which owns one of the TSOs that make up the FNB, of a EUR 19.8bn cost. FNB also quoted the grid length as 9,666km, compared with EWE’s statement yesterday of 9,721km.\nThe construction of the hydrogen grid “contains risks for the network operators due to the network structure, demand forecasts and the maturity and character of the separate infrastructure projects, all of which have varying degrees of relevance”, said Barbara Fischer, FNB’s managing director, in a statement.\nShe said a review by FNB and its members led to various conclusions about how to approach the project. “That is why in some cases, particularly in the later years after 2030, there is no company responsible for some projects.”\nAutumn implementationThe handover of the plans to the BNA started an approximately two-month regulatory review process. The regulator said today it would accept comments on the project until 6 August.\nThe economics ministry said in a statement today that the “operational implementation” of the plan should start in the autumn, with the first stretches of the grid expected to be in operation by next year. The grid is expected to be complete by 2032.\nThe ministry has set up plans for the network so that it can be privately financed with transmission fees, though the project is backed by government guarantees in case of unexpected developments.\nAlongside Ontras, the group of 12 TSOs include GTG Nord, Gasunie, GRTgaz Deutschland, Nowega, Thyssengas, Ontras Gastransport, Fluxys, Open Grid Europe, Gascade Gastransport, Terranets BW, Bayernets and Ferngas Netzgesellschaft.\nSeparately, Germany’s cabinet is expected to decide tomorrow on a hydrogen import strategy as part of its target to achieve a net-zero economy by 2045.",
        "sentiment": "Neutral"
    },
    {
        "input": "Dutch hydrogen market “faces underlying challenges” (Montel) The Dutch low-carbon hydrogen market, despite recording “considerable” growth in supply and demand between October 2023 and this April, “faces underlying market challenges”, consultancy Icis said in a report on Tuesday. Supply grew 4.8%, or 777 MW, over the six-month period, while demand increased 13.8%, it added.\nHowever, no projects during this time progressed further in their development phase to meet a final investment decision, said Icis hydrogen editor Jake Stones.\nThe consultancy assessed 38 supply-side projects and 21 demand-side schemes for the purposes of the report.\n“Despite the apparent growth, this lack of progression indicates underlying market challenges that must be addressed to fully capitalise on potential,” he added.\nEconomic drivers, such as industrial support mechanisms and increasing clarity on targets for decarbonising energy use, would help promote investment, said the report.\nFinancial challengesCurrently, financial challenges and regulatory uncertainties “continue to dictate” the pace of market development.\nIn the longer term, Icis forecast the country would have around 17 GW of low-carbon hydrogen – typically produced from excess renewables – as of 2040, with almost three-quarters of the capacity online by 2035.\nLow-carbon hydrogen is seen as a backbone of the EU’s plan to decarbonise by 2050 but a number of hurdles to meeting capacity goals have been identified, with the lack of infrastructure pinpointed as key.\nThe bloc has set an initial goal of 10m tonnes of domestic renewable hydrogen production and another 10m tonnes of imports by 2030.\nHowever, the European Court of Auditors said in a recent report that the European Commission’s hydrogen policy “needs a reality check”.",
        "sentiment": "Neutral"
    },
    {
        "input": "Enel’s H1 generation slides 17% as fossil fuel output dives 60% (Montel) Enel's domestic power generation slid 17% year on year to 17.8 TWh in the first six months of 2024, with production from fossil fuels plummeting 59% to 4.4 TWh, said the Italian utility. Coal-fired output in Italy slumped 90% in the January-June period, while gas-fired generation was down 17%, the company added in preliminary data released late on Tuesday.\nHowever, Enel’s domestic production from renewables increased by almost 26% to 13.3 TWh in H1.\nGreen generation continued to be driven by a growth in hydropower output, which increased by 36% to 9.9 TWh.\nEnel’s installed renewable energy capacity in Italy grew by 2% to 15 GW this year, with solar growing to 330 MW, from around 50 MW in the same period of 2023.\nIberia output fallsIn Iberia, where Enel has a large presence, its production from fossil fuels fell by 10% to 19.8 TWh during the January-June period.\nElectricity production from gas fell 26% to 5.4 TWh, while coal production was almost non-existent at 0.05 TWh, down 84% year on year.\nNuclear production decreased by 2% to 12.2 TWh.\nEnel’s green energy production in the region comprising Spain and Portugal grew 25% year on year to 10 TWh.\nTotal H1 production in Iberia grew by 1% to around 29.8 TWh.\nEnel will publish its financial results for the first half of the year on Thursday.",
        "sentiment": "Neutral"
    },
    {
        "input": "Endesa’s H1 earnings fall amid lower prices, thermal output drop (Montel) Spanish utility Endesa’s earnings before interest and tax (Ebit) dropped 9% year on year to EUR 1.4bn in the first half of the year amid lower power and gas prices and reduced thermal power generation, it said on Wednesday. Results were affected by a 56% decrease in wholesale power prices in Spain to EUR 39/MWh during the first six months of the year, compared with EUR 88/MWh in the same period last year, it added in a statement.\nGas prices saw a similar drop, with the European reference TTF front-month price dropping 34% year on year to EUR 29.50/MWh from January to June, it added.\nMeanwhile, Endesa’s nuclear and gas-fired generation decreased 10% to 19.8 TWh, compared with 21.9 TWh in the first half of 2023.\nThis was partially offset by a slight increase in renewable production, which totalled 24.5 TWh in the first six months, driven by a 69% jump in hydropower output to 4.4 TWh, according to the report.\n2 GW solar saleEndesa planned to close “in the near future” the sale of a minority stake in a 2 GW operating solar portfolio in Spain, it said, without proving further details.\nEndesa’s renewables capacity in Iberia increased 9% year on year to 10.1 GW in the January-June period.\nCEO Jose Bogas urged the government to improve grid regulation and remuneration to attract industry.\n“The grid is not sized to meet the needs of demand and therefore, between 2020 and 2023, up to 30 GW of new capacity has been rejected due to lack of grid capacity throughout Spain,” he said. \nSinking forward power prices in Spain amid the country’s green boom could attract industrial companies from other EU nations seeking lower costs but grid connections were hindering such efforts, industry analysts previously told Montel.",
        "sentiment": "Bearish"
    },
    {
        "input": "GERMAN – Front year rebounds off 12-week low on higher gas (Montel) Germany’s benchmark front-year power contract rose on Wednesday, tracking firmer gas and carbon prices after hitting a 12-week low in the previous session. The Cal 25 last traded EUR 2.02 higher at EUR 89.10/MWh on the EEX, after hitting EUR 85.86/MWh on Tuesday, its lowest point since 29 April.\nThe front month was last seen up EUR 3.01 at EUR 74.51/MWh.  \nFrom a fundamental perspective, the upward correction was a “bit of a surprise”, said a trader. “There could be some [participants] out there trying to close positions ahead of the new month.”\n“Today’s movements were rather impulsive,” another trader said.\nIn gas trading, the benchmark front-month TTF contract was last seen up EUR 0.65 on the day at EUR 32.28/MWh. In carbon, the benchmark Dec 24 EUA last traded EUR 1.63 higher at EUR 67.36/t on Ice Endex.\n“Forecasts showing low wind output in August are driving front-month prices today,” a third trader said.\nLower windIn the first week of August, wind power generation should average 6.7 GW, 3.4 GW below normal, data from Montel Analytics showed today.\nCloser in, the publication of European day-ahead prices was delayed today due to a decoupling between the Czech Republic and adjacent markets, according to the Joint Allocation Office (JAO).\nIn a later round, Germany’s baseload price rose EUR 13.42 to EUR 79.28/MWh, while peakload rose EUR 20.13 to EUR 57.82/MWh.\nWind output tomorrow should average 5.6 GW, 4.5 GW below normal and 6.6 GW lower than today, while solar should average 16 GW, 3.1 GW above the norm and 0.9 GW higher than today, according to data from Montel Analytics.",
        "sentiment": "Bullish"
    },
    {
        "input": "European spot markets avoid decoupling after Czech error (Montel) European spot power markets have avoided full decoupling after auction delays caused by an unknown Czech error, said the Joint Allocation Office (JAO) on Wednesday. “Please be informed that the incident is closed on the single day-ahead coupling auction. The final market results have been published,” said JAO in a market message at 14:19 CET after it had earlier warned market participants of the risk of full decoupling due to the auction delay.\nAuction results for spot power for Thursday delivery on European markets other than the Czech Republic had been delayed by more than an hour due to the Czech decoupling caused by “technical reasons or market issues”, Montel reported earlier.",
        "sentiment": "Neutral"
    },
    {
        "input": "EU spot market at risk of full decoupling amid Czech error (Montel) A decoupling error caused by unknown reasons in the Czech Republic has caused a delay of spot auctions throughout Europe on Wednesday – and there is a risk of full decoupling, said the Joint Allocation Office (JAO). Auctions for spot power for Thursday delivery on European markets other than the Czech Republic would be reopened at 13:15 CET due to the Czech decoupling, said JAO on its website.\nData from Epex Spot showed the auction went ahead at that time but the results were not yet available.\nThe decoupling was “due to technical reasons or market issues”, the JAO added.\nThe website of Czech power exchange OTE was not working at the time of publication.\nJAO warned market participants of the risk of full decoupling due to an ongoing delay of the auctions in its latest market message at 13:54.",
        "sentiment": "Neutral"
    },
    {
        "input": "Czech spot for Thursday settles at EUR 92.14-MWh, 7 hours late (Montel) Czech power for Thursday delivery outturned at EUR 92.14 /MWh, up EUR 17.84/MWh on the day, with the settlement run by exchange OTE 7 hours late amid an IT system failure. “We managed to run the auction for Thursday delivery at 7 PM with the results [published] 5 minutes later,” OTE’s deputy head Igor Chemisinec told Montel.\nThe Czech power market decoupled from its neighbours earlier on Wednesday as OTE systems failed.\nOther European spot markets came close to decoupling after the Czech error delayed day-ahead auctions across the continent, Montel reported earlier.\nIn neighbouring markets there were large spot price variations on Wednesday. In Hungary, day-ahead power jumped EUR 122.43 to EUR 197.44/MWh on the HUPX exchange, while the Austrian spot rose by EUR 12.62 to EUR 80.38/MWh. In Slovakia, the day-ahead baseload settled at EUR 108.48/MWh on OKTE bourse, up EUR 35.11/MWh day on day, while the Polish spot soared EUR 21.45 to EUR 133.49/MWh on the TGE bourse.\nEurope’s benchmark price, German day-ahead power, rose EUR 13.42 day on day to EUR 79.28/MWh on Epex Spot.\nMarket participants were jittery, and nervously eyed the delayed market coupling settlements for Thursday following the disconnection of operations on 25 June.\nEditing by: \nSnjólfur Richard Sverrisson\nsnjolfur.sverrisson@montelnews.com",
        "sentiment": "Bullish"
    },
    {
        "input": "GB Energy to focus on offshore wind (Montel) The UK’s Labour government will invest GBP 8.3bn in GB Energy, a publicly-owned company that will work with the Crown Estate – which owns much of the seabed around the UK – to help boost the offshore wind sector, UK media reported on Thursday. The government said the partnership with the Crown Estate will lead to 20-30 GW of new offshore wind reaching seabed lease stage by 2030, a target already set out by the Crown Estate.\nThe agreement is only for projects around England and Wales, while the UK government is also in discussions with the Scottish Government and Crown Estate Scotland on support for Scottish projects, the BBC reported.\nWith GB Energy’s GBP 8.3bn of funding, Labour hopes to attract GBP 60bn of investment, it said. Alongside a new law to create GB Energy, the government will also loosen regulation on the Crown Estate so it can invest and borrow more.\nLower bills?Prime minister Keir Starmer said that the plans were “turbocharging our country toward energy security” and promised that it would lower energy bills.\nHowever, the opposition Conservatives have said GB Energy “will end up costing families, not cutting bills”.\nLabour hopes that GB Energy will reduce UK “over-reliance” on fossil fuel markets, particularly following Russia’s invasion of Ukraine – which had spiked wholesale gas prices in 2022.\nThe company will take stakes in energy projects to speed them up. Apart from offshore wind, it will consider boosting other technologies including carbon capture and storage, hydrogen, wave and tidal energy.\nEventually, GB Energy may take a controlling interest in some renewable energy projects, the BBC said.",
        "sentiment": "Bullish"
    },
    {
        "input": "Czech bourse hopes to run spot auction “later” after IT error (Montel) Czech bourse OTE plans to run a day-ahead power auction later today following an unexpected error in its IT system that led to a decoupling of the country’s power market from its neighbours on Wednesday, said OTE's deputy head Igor Chemisinec. “The decoupling was caused by an unexpected error during the planned maintenance of our IT systems and we are currently working to resolve the issue,” Chemisinec told Montel.\nThe Czech exchange OTE has not yet managed to run an auction for Thursday delivery on the spot market.\n“We hope to run it later today,” Chemisinec added.\nEuropean spot markets were close to decoupling earlier today after auction results delays caused the Czech error, Montel reported earlier.",
        "sentiment": "Neutral"
    },
    {
        "input": "Few “upside risks” for EU power prices in H2 – consultancy (Montel) EU power markets will likely be well supplied in the second half of the year compared with H2 2023 due to a surge in renewable output, consultancy Icis said on Wednesday. Across the bloc, it forecast hydropower, solar and wind output to rise by almost 9%, or 43 TWh, year on year to 543 TWh from July-December.\nThe firm said it saw “few major upside risks” in terms of prices. It only included a price forecast for France, and said it expected French power prices to average about EUR 69/MWh in the second half of the year, down from EUR 83/MWh in H2 2023.\nIt expected the rise in renewable production to offset a 13 TWh fall to 347 TWh in lignite- and gas-fired output. It saw nuclear generation increasing by 1 TWh to 296 TWh.\nMeanwhile, EU power demand was set to see a 24 TWh recovery year on year, totalling 1,280 TWh, due to “improvements in the macroeconomic picture leading to an increase in all sectors, including some recovery in industry”.\nThe “most substantial threat” for power prices would come from gas price developments, it said, amid geopolitical risks including the risk of Russian pipeline gas supply via Ukraine being cut off at the end of the year, potential sanctions on Russian LNG, threats to LNG supply disruption in the Middle East and the potential for an LNG demand surge in Asia.\nHowever, it said that overall it saw bearish fundamentals for the gas market amid sluggish demand growth and strong storage.",
        "sentiment": "Bearish"
    },
    {
        "input": "Endesa plans shift to wind projects amid solar challenges – CFO (Montel) Spanish utility Endesa plans to shift its green strategy to more profitable wind farms and away from solar as part of its green transition, said Marco Palermo, the firm’s CFO, on Wednesday. However, the policy change would not be easy “because there are a lot of potential delays related to legal challenges\", with a public backlash to such developments in the country, he added during an analyst call to present the company’s H1 results.\nEndesa’s move away from solar comes amid increased price cannibalisation in Spain, which occurs when renewable installations produce at the same time and so reduce the average revenues for generators.\nEarlier today, rival Iberdrola said it had cut production from solar plants in times of low prices in Iberia in the January-June period.\nThe average price captured by Spanish solar generators in the first half of the year totalled just EUR 22-23/MWh, which was economically unviable level if it persisted, according to a recent report by consultancy Afry.\nEarnings to recover? Endesa reported a 9% year-on-year drop in earnings before interest and tax in H1 to EUR 1.4bn amid lower power and gas prices, though it expected these to recover in H2, said CEO Jose Bogas in the same call.\nPower forwards were already trading at EUR 80/MWh for Q4, with an expected average price for full-year 2024 of EUR 60/MWh, he added.\nMeanwhile, Endesa had recently struggled to sign power purchase agreements (PPAs) as “it turns out that there is a level where actually nobody is ready to transact because the price is probably too low”, it said.\nWasted opportunityYet the company continued to expand its green portfolio to meet an expected increase in demand that would come “not in a matter of months, [but] probably it will be a matter of years,” Palermo said.\nNevertheless, around 30 GW of connection requests for new green capacity had been rejected in Spain between 2020 and 2030 due to the lack of grid infrastructure, with half of that capacity from Endesa, said the firm.\n“It is something painful because we have a unique opportunity in Spain,” said Bogas in reference to the country’s green transition.",
        "sentiment": "Neutral"
    },
    {
        "input": "French TSO to limit cross-border flows to 8 GW from Monday (Montel) French TSO RTE will limit cross-border power exports on its eastern borders to 8 GW from next Monday until 8 September, it said on Wednesday, forecasting “a tense situation until mid-October”. “In some cases, it is possible that some limitations would be applied below this 8 GW threshold, depending on the flows distribution over the different eastern borders,” the TSO added in a statement. \nMeasures would first be applied “as close as possible to the constraints”, namely closer to the France-Italy border, although it could also activate limitations on the France-Switzerland border, it said.\nIf these measures proved insufficient, the TSO could also activate “remedial actions” on the France-Germany and France-Belgium borders, it added.\nThe TSO would publish all planned and unplanned outages, as well as any specific measures, it added.\n“Proactive communication”RTE warned last month of possible export cuts from August to October and promised “proactive communication”.\nThe warning followed the large curbs in French power exports on its eastern borders earlier this year.\nThe TSO curbed power exports towards neighbours due to grid issues and high export demand from early March into May, reserving only 40% of grid capacity for cross-border trading but did not inform the market until 17 April.\nThis situation was due to low domestic demand, high supply and significant transit flows across the French network, it added.",
        "sentiment": "Bullish"
    },
    {
        "input": "Iberdrola solar plants avoid forced curtailments – chairman (Montel) Spanish utility Iberdrola has cut production from solar plants in times of low prices in Iberia, yet the TSO has never forced it to curtail generation, executive chairman Ignacio Sanchez Galan said on Wednesday. “Curtailments happen when system operators force generators to stop production. That has not already happened to us,” he told analysts in a conference call to discuss the company’s interim results, which climbed 64% year on year to EUR 4.1bn.\nHowever, Galan said it had stopped green plants “depending on the market condition”, when prices “are not as good as needed”.\nSpain has seen a growing problem of renewable power curtailments in the last two years amid a continued buildout of solar and wind capacity, in line with its ambitious green goals.\nVoluntary wind and solar output curbs due to low prices have doubled in the year to date, to around 1,300 GWh, while forced output curtailments have totalled 400 GWh for solar plants and 900 GWh for wind farms, experts told Montel last week.\nIncreased intraday spreadsHigher intermittent production from renewables has also led to a growing problem of cannibalisation, which occurs when green assets produce too much energy at the same time.\nThe Iberian market has changed “very significantly” in the last five years, “resulting in an increased intraday spread between central hours with high renewable [production] and low demand and mornings and evenings when there is no solar production and demand increases,” Galan said.\nThis created “a recurring need for storage infrastructure” and had led to more production in existing pumped hydropower facilities, Galan said.\nGrowing demandHowever, he pointed to a “more normalised environment, with forward markets showing an increase in price and in demand as well” after instability in recent years.\nThe company had seen “growing demand prospects” coming from data centres and artificial intelligence so it started a subsidiary to handle this business, he added.\nIberdrola already had 8 TWh in annual green supply contracts with major IT corporations including Meta, Apple, Microsoft, Google and Amazon, Galan said.\nMeanwhile, the company owns UK utility Scottish Power and Galan said it had already started to work “closely” with the new UK government that came to power last month.\nThe company also operates power distribution grids and renewables in the US but he shrugged off fears for the future of renewables there amid the potential re-election of Donald Trump in November.",
        "sentiment": "Bullish"
    },
    {
        "input": "Iberdrola H1 net profit soars 64% to EUR 4.1bn (Montel) Spanish utility Iberdrola posted a 64% year-on-year rise in net profits to EUR 4.1bn in the first half of the year, largely thanks to the sale of its business in Mexico. In June 2023, Iberdrola sold 55% of its business in the country – including 8.5 GW in gas-fired plants – to Mexico Infrastructures Partners for more than EUR 5.4bn, leaving nearly EUR 1.2bn in capital gains, the firm said in its interim results published on Wednesday.\nThe firm’s net profit without that effect would have amounted to less than EUR 3bn.\nImproved results also came amid increased hydropower storage and production in Iberia, as well as “record” renewables production, the company said.\nGreen power output risesIberdrola’s global green production in the January-June period totalled 45.2 TWh, a 5.3% jump. Hydropower increased 9.2% to 16.4 TWh.\nThe firm saw a 21.4% spike in renewables generation in Spain to 18.5 TWh, with hydropower soaring nearly 50% to 12.1 TWh. Iberia had a severe drought in 2022-23.\nIberdrola’s global green capacity last stood above 43 GW, with more than half of it – 22 GW – installed in Spain. Most of the 2.2 GW of green capacity built by Iberdrola in the last 12 months was in Spain, where it connected 1.5 GW, mainly solar.",
        "sentiment": "Neutral"
    },
    {
        "input": "GERMAN – Spot power to jump EUR 20 as wind plummets (Montel) German day-ahead power prices looked set to jump nearly EUR 20 on Wednesday, with wind generation expected to plummet to well below average values. Baseload for Thursday last traded at EUR 83.50/MWh on the EEX exchange, compared with the prior day-ahead settlement of EUR 65.86/MWh.\nAverage wind generation should dive from 11.4 GW today to 5.4 GW on Thursday, according to Montel Analytics, which would be 4.8 GW below the seasonal norm.\nSolar generation, however, looked set to rise from 14.9 GW to 16.9 GW, with peak generation increasing from 42.5 GW to 45.8 GW, the forecasts showed.\nResidual load, the amount of demand not covered by solar and wind energy, was expected to rise 3.1 GW to 31 GW, 1.5 GW above average.\nStable demandPower demand should edge up 0.1 GW to 53.2 GW, in line with the seasonal average, while peak demand should largely remain stable at 62.6 GW, Montel data showed.\nIn neighbouring France, peak demand was forecast to edge up 0.1 GW to 49.6 GW, with the average reaching 44 GW, 0.3 GW above the previous day.\nTemperatures in France should average 21.5C tomorrow, 0.8C higher on the day and 0.4C above normal.\nIn Germany, temperatures were expected to drop 0.3C to 18C, 1.6C below average, according to Montel data.\nMeanwhile, German lignite availability was set to rise 1.1 GW to 12.2 GW, or 80% of operational capacity, amid the end of several smaller outages, data from German regulator BNA and EEX showed.\nThe following table lists outages affecting plants of more than 700 MW of installed capacity tomorrow:\nNameInstalled MWFuelOutage StartOutage EndOperatorDatteln 41,052Hard Coal2024/05/062024/07/29UniperHeilbronn 7778Hard Coal2024/06/192024/08/22ENBWNiederaussem K924Lignite2024/07/032024/09/02RWESchwarze Pumpe B775Lignite2024/05/102024/08/20Leag",
        "sentiment": "Bullish"
    },
    {
        "input": "Oil prices rise on indications of robust US demand (Montel) Oil prices rose on Wednesday, as investor sentiment was buoyed by an anticipated drawdown in US crude inventories, signalling that summer demand in the world's largest economy remained robust despite an uncertain global outlook. The front-month contract for Brent crude North Sea oil waslast seen up USD 0.43 at USD 81.44/bbl, while the WTI equivalent rose USD 0.46 at USD 77.42/bbl.\nBoth global benchmarks had been on the slide in the previous three sessions, with WTI posting losses of around 7%, while Brent was down 5%.\nIndustry data provided by the American Petroleum Institute was projected, for a fourth straight week, to show a drop in crude and distillate inventories in the world’s largest oil consumer.\nCrude stocks are expected to have fallen by 4.9m barrels in the week ended July 19, while gasoline inventories fell around 2.8m barrels.\nBalanced marketOil prices had reached an equilibrium, which was reflective of a balance that was acceptable by both consumers and producers, said analysts.\nWith price levels holding in a comfortable range, Opec and the alliance of producers led by Russia were unlikely to rock the boat by announcing any new policy mandates at its next meeting on 1 August, Amena Bakr, senior analyst at Energy Intelligence, told Montel.\n“It’s unlikely that any changes will be recommended by the committee in terms of altering policy,” she said.\n“What can be expected is that Opec+ will focus on its messaging around compliance and keeping the current pact in place that will allow them to start unwinding some of the cuts by the end of the third quarter if the market permits.”\nThe producer cartel recently agreed to gradually phase out cuts – brought in to shore up prices – of 2.2m bbl/day over the course of a year from October to next September.\nFor now, oil was expected to trade within a narrow range in the mid-USD 80s with escalating tensions in the Middle East amid the Israel-Palestine war keeping a floor under prices, said market participants.\nMiddle East risk?“The market has grown immune to the geopolitical risk coming out of the Middle East. Absent a supply disruption I don’t think markets will react any more than it already has,” said Bakr.\nUS bank Goldman Sachs said that the risk premium on oil was now near zero.\n“The geopolitical risk premium is still muted despite rising tensions between Israel and Yemen, with Brent call options implied volatility remaining very low,” it added.\nIsrael’s war with Hamas now heads into its ninth month with various attempts to broker a ceasefire falling short, though more talks are expected.\nNow the fight has drawn in Hezbollah from Lebanon, while the Houthis, a Yemeni rebel group backed by Iran, is stepping up its attacks on commercial vessels plying the Red Sea.",
        "sentiment": "Bullish"
    },
    {
        "input": "Nordic nuclear output Wednesday- 87% (+411 MW) (Montel) Nordic nuclear power production is running at 9,799 MW on Wednesday morning, up 411 MW from Tuesday and using 87% of installed generation capacity (11,307 MW). TVO has reduced output at Olkiluoto 3 by 110 MW, due to \"marginal of thermal power.”\nForsmark 1 is offline due to annual maintenance.\nIn periods of low spot prices, operators could decrease nuclear output.\nFigures were updated at 06.50 CET.\nCurrent output (MW)Change* (MW)UtilisationInstalled capacity (MW)Annual outage startingAnnual outage endingRinghals 395028588%108115.05.2421.07.24Ringhals 41073195%113015.08.2413.09.24Forsmark 1000%104001.07.2427.07.24Forsmark 21081197%112021.04.2423.05.24Forsmark 31127-396%117201.09.2418.10.24Oskarshamn 314211102%140006.04.2406.05.24TOTAL SWEDEN565228581%6943Olkiluoto 1866497%89012.05.2419.06.24Olkiluoto 2866697%89028.04.2409.05.24Olkiluoto 3148112594%157002.03.2414.05.24Loviisa 1 + 2934-992%101431.08.2430.09.2404.08.2425.08.24TOTAL FINLAND414712695%4364TOTAL NORDIC979941187%11307\nFigures for installed capacity correspond with those used by the operators in urgent market messages (UMM)The installed capacity for OL3 is reduced by 30 MW due to grid limitations.*) Change from previous working day",
        "sentiment": "Bullish"
    },
    {
        "input": "Italian PPA demand jumps on green auction uncertainty (Montel) Demand for power purchase agreements (PPAs) in Italy has risen steadily this year – with market participants increasingly concerned about delays to a forthcoming subsidy scheme for 60 GW of new renewable energy capacity until 2028. “Interest in Italian PPAs is on the rise,” said Dario Gallanti, partner at Spanish PPA consultancy Our New Energy, noting they were being used as a “mitigant” for possible delays in the publishing of the long-expected Fer X legislation. \nAuctions for the 60 GW of renewables capacity in 2024-2028 via the scheme – known as Fer X – were originally scheduled for autumn but market participants now expect them to be postponed until 2025.\n“More and more renewables operators are looking at alternatives to cover delays in the Fer X legislation,” Gallanti added. \nThe spike in interest followed the publication of the Fer X draft green auctions legislation in early March and continued in May when the second draft was published, he said.\nAlthough some investors were willing to wait several months for the new subsidy scheme, others were actively attempting to conclude deals, especially when PPAs met their specific investment return requirements, experts said.\nThis was despite PPAs currently being priced at just over EUR 60/MWh in Italy, compared with Fer X auction prices starting at EUR 85/MWh for both solar and wind energy, an analyst added. \nInterest was particularly evident for portfolios located in the southern regions of Italy, where competition in the first Fer X auction was expected to be “fierce”, another analyst said. \nCorporate demand“Demand originates mainly from corporates as their requirements never go away,” said Lorenzo Parola, managing partner at law firm Parola Associati.\n“They are often available to pay well above the forward curves that are currently under EUR 65/MWh.”\nDemand for Italian PPAs was equally balanced between utilities and corporates, according to analysis by Statkraft Italy manager, Bernardo Ricci Armani.\n“These actors demonstrate interest in PPAs in Italy, especially for projects close to construction for which a market solution makes sense, as opposed to immobilising the project while awaiting the Fer X incentives,” he said.\nBut energy lawyer Giovanni Battista Conte said it was mainly short-term PPAs being concluded. \n“Large energy consumers are avoiding long-term PPAs for the time being as these corporates expect the prices to drop,” he said.\nThis is an online version of a feature story published in Montel’s Energy Transition Weekly on 12 July.",
        "sentiment": "Bullish"
    },
    {
        "input": "Spanish power prices may treble to EUR 90-MWh – Repsol CEO (Montel) Spanish power prices may soar to as much as EUR 90/MWh over the coming quarters, compared with an average of just over EUR 30/MWh in the second quarter, Repsol’s CEO said on Wednesday. “I don’t have a crystal ball [but] what we have seen [for the next quarters] is something close to EUR 75-90/MWh,” Josu Jon Imaz said during a call with analysts to present the firm’s interim results.\nThe low-price environment seen during the first half of the year would not be the new normal in Spain, he said, pointing to “extraordinary bearish drivers”.\nSpanish hydropower production soared in January-June with rainfall “significantly higher” than the past 30-year average, Imaz said, noting that prices therefore dropped “in a significant way”.\nBaseload power prices in Spain averaged EUR 39.12/MWh in the first half of the year and EUR 33.35/MWh in the second quarter, compared with EUR 66.81/MWh in the month of July to date.\n“Market is getting tough”Meanwhile, Repsol saw worsening conditions in the power market due to the green boom in Spain.\n“The market is getting tough in Europe and particularly in Spain, but we are capturing in a good way the opportunities we have in the market,” Imaz said.\nRepsol will rely more on wind than on solar for new renewable plants in Spain, he said, pointing to growing concerns over cannibalisation, which occurs when assets produce at the same time, reducing prices in the hours they operate.\nSolar production is concentrated in the central hours of the day, when the sun is shining, while the wind production is more distributed over the whole day, Imaz added.\n“We are very confident about new wind projects in Spain. And in solar projects we are going to be more selective, more opportunistic,” he said.",
        "sentiment": "Bullish"
    },
    {
        "input": "RWE’s power output drops 13% in H1, led by gas (Montel) German utility RWE’s power generation dropped 12.9% year on year to 58.9 TWh in January-June as a slump output from its fossil-fuelled plants offset rising production from renewables. The company’s gas fired output – which in H1 of last year contributed the lion’s share or 33% of RWE’s power generation – fell from 21.6 TWh to 15.6 TWh this year, company data showed late on Tuesday.\nThe company cited “market price driven lower generation volumes” in its core gas markets Germany, UK and the Netherlands.\nHard coal output in the Netherlands and Belgium, the last countries where RWE still burns the fuel, roughly halved to 1.5 TWh during the period under review, with the company also pointing to market prices for lowering volumes.\nThe German front year power contract, the European benchmark, averaged 151/MWh during the first half of 2023, compared with around EUR 86/MWh this year, making selling power into the market less attractive.\nOutput at RWE’s lignite plants – which the company only operates in Germany – dropped 18% to 15 TWh, with RWE pointing to the end of operations of its Neurath D and E units (600 MW each) and the end of a reserve scheme in the first quarter of 2024.\nRWE has vowed to exit lignite-fired power generation in Germany by 2030.\nWith the shutdown of the Emsland A nuclear power plant (1.3 GW) on 15 April, the majority of the 2.6 TWh of nuclear power that the company still produced in the first half of 2023 was lost.\nRWE holds a minority stake in the Dutch Borssele reactor (485 MW) and thus still recorded 369 GWh of nuclear output in the first half of 2024.\nGreen power generationRWE’s generation from renewables rose nearly 19% to 26.2 TWh in January-June, reaching 44.5% of the company’s overall output, the data showed. This compares to a share of only 33% in the first half of last year.\nRWE cited better wind conditions across all countries for its offshore wind fleet, while solar and onshore wind output benefited from commissioning of new capacities.\nAs of 30 June 2024, RWE had installed a total of 3.5 GW of offshore wind, unchanged year on year, while onshore wind rose 0.6 GW to 8.5 GW over the 12 months to 30 June, and solar gained 1.2 GW to reach 4.8 GW.\nRWE usually publishes generation data ahead of its financial report, which for the second quarter is due 14 August.",
        "sentiment": "Neutral"
    },
    {
        "input": "SEE POWER – Hupx regains premium as SEE supply improves (Montel) The price for Thursday delivery on the day-ahead power exchange Hupx closed at EUR 197.44/MWh, putting it back at a premium to its Balkan counterparts, which were under less pressure amid improving regional supply. The expected return of some regional units following unplanned outages, combined with forecasts for stronger hydropower output in southeast Europe (SEE), offered a little relief for most Balkan power exchanges.\nHowever, these factors did not relieve the pressure on the Hungarian power market, with the spot price rising considerably from the previous session’s EUR 75.01/MWh. Forecasts for lower wind generation in Germany, which often drives the dynamics of the Hungarian market, contributed to the hike.\nA technical error in the Czech Republic on Wednesday, which risked a full EU market decoupling, is also likely to have contributed to the Hungarian spot’s rise. \nThe Hungarian front-month was also bullish, last seen trading at EUR 104.45/MWh, a EUR 5.75 session-on-session increase.\nThe Hungarian market has recently been under a heavy bullish influence amid cross-border curtailments and heatwave-driven high demand. \nImproving supplySEE power markets kicked off the week at a bullish pace following unplanned maintenance on a 650 MW unit at Romania’s Cernavoda nuclear plant. \nThe outage weighed on supply and triggered price spikes across the flow-based market coupling members, impacting not only Romania, but also Greece and Bulgaria.\nThe latest data on the European TSO body Entso-E’s platform indicated that the unit will partly return on 25 July at 09:00 CET, but will only return fully at midnight on Thursday.\nThe Cernavoda outage led to Hungary losing its earlier premium over its Balkan counterparts, but this changed again during Wednesday’s session. Another expected unit return could offer some additional relief for Hungary.\n“In Hungary, if Dunamenti G3 [a gas-fired power unit] comes back as planned on 11 August, that could ease some of the tightness as well,” noted Gabor Szatmari, CEE territory manager at Montel Analytics.\nSupply tightness is set to ease in the next few days as a result of increased hydropower output. On Wednesday, Romania’s National Hydro Institute forecast a rise in run-of-river production, with torrential rain expected.  Hydropower generation is, however, set to remain below seasonal norms, data from Montel Analytics show.\nIn Serbia, a 348 MW unit at the coal-fired power plant known as TENT will be returning online after undergoing extensive works, according to a ministry statement published on Wednesday.\nFar-curve gainsMeanwhile, moderate gains in the gas market supported far-curve contracts. \nThe front-quarter product last traded at EUR 98.00/MWh, rising by EUR 3 from the previous day.\nThe Hungarian front-year contract also posted moderate gains, trading last at EUR 97.00/MWh, up from Tuesday’s closing value of EUR 95.25/MWh.",
        "sentiment": "Bullish"
    },
    {
        "input": "PGE plans to launch 2 gas units (1.4 GW) by October (Montel) PGE will launch two gas-fired units – with a total capacity of 1.4 GW – in northwest Poland by October, following delays in construction, the Polish state-owned utility said late on Tuesday. The 683 MW Dolna Odra 9 will start production on 15 August, while the twin unit 10 will fire up on 30 September.\nInitially, the two units were due to launch at the end of 2023, and then in April this year.\nThe new launch dates are result of a settlement with contractors General Electric, Polimex Mostostal and GE Vernova, PGE said in a market message on the Warsaw Stock Exchange.\nPolish state-controlled PGE has 18 GW of installed capacity, most of which comprises lignite and coal-fired power plants.",
        "sentiment": "Bearish"
    },
    {
        "input": "Reservoir content Switzerland week 30- 79.4% (+3.5) (Montel) GWh week 30% wk 30% wk 29% wk 28Valais2,98373.366.158.9Graubünden1,68485.185.582.7Ticino1,10288.588.286.3Other areas1,29781.179.477.0Total Switzerland7.06679.475.971.3River flow in the Rhine by Rheinfeldenm3/s at 12:00 CET MondayInterpolated avg 1933-2021% of average1,663 (1,673)1,387 (1,429)120 (117)\nNote: Previous week in brackets\nSource: Swiss Federal Office of Energy",
        "sentiment": "Neutral"
    },
    {
        "input": "Verbund hedges 51% of 2025 output at EUR 121.90-MWh (Montel) Austrian utility Verbund had hedged 51% of its 2025 hydropower generation at EUR 121.90/MWh in the April-June period, up from 45% at EUR 126.60/MWh in the previous three months, it said on Thursday. By the end of the first half of last year, Verbund had sold 44% of its 2024 output at EUR 155.60/MWh.\nFor the current year, the Austrian utility had now sold 88% of its planned annual hydropower output of 27.2 TWh at EUR 123/MWh, up from 77% at EUR 129.50/MWh from the previous quarter.\nFor 2026, the company had hedged 33% of production at EUR 78.70/MWh by the end of Q2, up from 32% at EUR 79.40/MWh in the prior three-month period.\nAustria’s day-ahead power contract had averaged EUR 67.71/MWh on Epex Spot in H1, down roughly 40% compared to the same period last year.\nEnergy prices have generally fallen since they peaked in summer 2022 due to gas supply fears amid Russia’s war on Ukraine.\nIn Europe’s largest power market, the German Cal 25 contract last closed at EUR 90.65/MWh on Wednesday, down from EUR 97.34/MWh at the end of last year.\nPower generation risesMeanwhile, Verbund’s overall power generation rose 17.6% year on year to 18.9 TWh in the January-June period, of which hydropower accounted for 17.3 TWh, up 14.9%.\nDespite higher generation, the company’s hydropower segment saw earnings before interest, tax, depreciation and amortisation (Ebitda) dive 24.4% on the year to EUR 1.5bn.\nIt pointed to lower achieved prices for production, which slid by EUR 68.80/MWh to EUR 113.30/MWh.\nVerbund’s sales segment, which includes trading, returned to profit in H1 seeing Ebitda total EUR 15.9m, compared with a EUR 143m loss in the same period last year, “mainly due to lower procurement costs for electricity and gas”.\nHowever, overall group Ebitda fell 21.9% year on year to EUR 1.8bn, mainly due to “a weaker energy market environment”.\nFor full-year 2024, the company forecast Ebitda of EUR 3-3.3bn, up from a previous EUR 2.8-3.3bn range.",
        "sentiment": "Neutral"
    },
    {
        "input": "TotalEnergies launches 100 MW battery project in Germany (Montel) TotalEnergies will proceed to invest EUR 75m in a 100 MW battery storage project in Dahlem, eastern Germany, the French energy company said on Wednesday. The project, due to launch in the second half of 2026, comes amid growing demand for storing energy generated from intermittent renewable sources such as wind and solar.\nThe batteries would be provided by Saft, while German firms acquired by TotalEnergies, Kyon Energy and Quadra Energy, would respectively manage the development of the project and the sale of flexibility provided.\n“This investment decision reflects the acceleration of our integrated development in the Germany electricity market, the largest in Europe,” said Stephane Michel, senior vice president for gas, renewables and power at TotalEnergies.",
        "sentiment": "Neutral"
    },
    {
        "input": "TotalEnergies buys stake in Dutch offshore wind project (Montel) French energy company TotalEnergies has acquired a 50% stake in a 795 MW offshore wind farm under construction in the Netherlands from Germany developer RWE, the former said on Wednesday. Its share would power electrolysers with a cumulative capacity of 350 MW to generate about 40,000 tonnes per year of renewable hydrogen for its refineries in northern Europe, which should reduce the refineries’ CO2 emissions by 400,000t per year, according to the statement.\nThe company plans to decarbonise its European refineries’ hydrogen and cut its CO2 emissions by around 5m tonnes per year by 2030, as part of its goal to reduce net greenhouse gas emissions from its oil and gas operations 40% by 2030, compared with 2015 levels.\nThe OranjeWind offshore wind project is located about 53km off the Dutch coast in the North Sea. Construction is scheduled to start in 2026, with full commissioning expected in early 2028.\nRWE was awarded the project in a tender in 2022 and at that point committed to developing electrolysers, to which TotalEnergies would now also contribute, the latter said.\nThe project would also support the stability of the Dutch grid with its electric boilers and battery storage, TotalEnergies added.",
        "sentiment": "Neutral"
    },
    {
        "input": "Statkraft will not sell hydro assets despite write-downs – CEO (Montel) Statkraft has no plans to sell its hydropower plants in Albania and Turkey despite the units’ major impairments during the second quarter, the Norwegian utility’s CEO said on Tuesday. In Q2, Statkraft wrote down the value of its two hydropower plants in Albania (169 MW) by NOK 2.2bn (EUR 184m), while two hydropower plants in Turkey (122 MW) were written down by NOK 993m amid a reduction in the units’ expected power production.\nHowever, the investments were not a mistake and the company was holding onto the plants, Birgitte Ringstad Vartdal told Montel.\n“Values are adjusted over time. These are important hydropower plants and any assessment [of the investment] should wait until 25 years have passed,” she said.\nThe cut in expected output at the plants was due to lower water supply amid climate change and more farming locally, said CFO Anna Nord Bjercke.\nThe company also posted a NOK 838m impairment on its German wind power operations and NOK 347m on Indian hydropower for Q2.\nThe write-downs meant the company posted a net loss of NOK 992m in the second quarter.\n(EUR 1 = NOK 11.97)",
        "sentiment": "Neutral"
    },
    {
        "input": "“Highly unstable” French political situation clouds energy policy (Montel) The “highly unstable” political situation in France is creating energy policy uncertainty, said a legal expert, after president Emmanuel Macron announced he would not name a new government until after the Olympics. The most serious issue was not the failure to appoint a new prime minister but “the failure to appoint a PM with a clear energy and climate roadmap with a majority to support them”, energy lawyer Arnaud Gossement told Montel.\n“For several years now, the government has hesitated regarding targets and resources for energy, climate and biodiversity,” he said, adding that this “[created] uncertainty for those involved”.\nHis comments came after Macron said yesterday evening that appointing a new prime minister before the middle of next month would “create disorder”, despite the left-wing coalition New Popular Front (NFP) – the largest group in parliament after recent elections having put forward a candidate.\n“The question remained what majority can be found… so that a French government can pass reforms, pass a budget and move the country forward,” said Macron. \n“Need clear head”“The next major decisions are not expected before September and it would be better to take them with a clear head,” Jules Nyssen, head of the SER renewables lobby, told Montel.\nThe country faces political deadlock that could cloud the country’s energy policy after the NFP unexpectedly won the most seats in the second round of the general election earlier this month but failed to secure an outright majority.\nThe far-right National Rally (RN) party, which had hoped to gain an absolute majority after topping the first round, came in third behind Macron’s centrist group Ensemble.\nA new government meant there could be a revision of France’s energy and climate laws to create new renewables targets as the NFP was keen to deploy green units at a faster pace, Montel reported earlier in July.",
        "sentiment": "Neutral"
    }
]