[
    {
        "title":"20 GW German gas units won’t have big price impact – analysts",
        "subtitle":"\n              (Montel) The plans of Germany’s expected new government to bring 20 GW of gas-fired power generation capacity online by 2030 will have a minor impact on prices, Berlin-based experts from Montel Analytics said on Monday.\n            ",
        "body":"\n“I have little hope that they would significantly reduce electricity prices in situations of scarcity, such as a dunkelflaute [a period of low wind and solar output],” said Matthis Brinkhaus, senior analyst at Montel.\nGermany is set for a new government coalition following elections last month, and the Christian Democrats (CDU\/CSU) and Social Democrats (SPD) announced the power plant plan over the weekend, Montel reported earlier. Achieving the reduction of power prices is set to be a key government goal. \nBrinkhaus said that because the proposed gas-fired plants would need to make their money in a limited number of running hours, they might bid into the day-ahead market with a premium that would “not necessarily reflect the marginal costs”.\nLow single digitsThe outgoing government planned to bring 10 GW of new gas-fired capacity online, and the additional volume foreseen under the new plan should see power prices dampened by a low single-digit percentage, according to Montel Analytics calculations.\nBrinkhaus expected increased import and storage capacity to be a bigger driver for reducing power prices.\nHowever, the Berlin-based Enervis consultancy saw a possible price impact of more than EUR 10\/MWh by 2030, since investors were waiting for such a scheme to bring gas-fired projects forward, senior consultant Tim Hoefer said.\nThe EEX exchange’s 2030 power price for Germany last settled at EUR 67.20\/MWh.\nTight scheduleBuilding 20 GW of new capacity by 2030 also seemed “rather unrealistic”, said Christoph Maurer, managing director of Aachen-based consultancy Consentec.\nThe 20 GW was closer to actual supply security needs than the outgoing government’s 10 GW target, but the latter was also aiming for a capacity market to finance additional units, according to Maurer.\nA capacity market scheme – which pays units for their availability in the market – would probably be easier to negotiate with the European Commission in terms of state aid, said Maurer.\nHoefer also said that gaining EC approval could be problematic, adding that the gas-fired units would need to fit in with decarbonisation plans.\nGermany is aiming to achieve climate neutrality in 2045, with a key element of the plan being the strong expansion of wind and solar power generation capacity, which needs to be accompanied by back-up capacity for times of very low renewables generation.\n",
        "datetime":"2025-03-10T15:10:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]