[
    {
        "title":"Alpiq’s trading unit earnings drop 44% in 2024",
        "subtitle":"\n              (Montel) Swiss utility Alpiq’s trading unit saw its earnings before interest, taxes, depreciation and amortisation (Ebitda) fall 44% last year to CHF 30.1m (EUR 32.1m).\n            ",
        "body":"\nAlpiq cited an “extraordinary previous year of high prices and trading opportunities” as the reason for the flagging earnings in its annual results on Wednesday.\nMeanwhile, the utility’s earnings in the assets segment, which comprises its power generation, fell from over CHF 1bn in 2023 to CHF 972.1m in 2024.\n“Lower energy prices and less volatility had a negative effect on the result; this effect was noticeable across all main operating markets and ancillary services,” it added.\nStill, the company noted increased production at most power plants, with total generation reaching 17.3 TWh in 2024 compared with 16.8 TWh in 2023.\nIn Alpiq’s origination segment, including direct marketing of third-party renewables units, the Ebitda roughly halved from CHF 169m to CHF 86.5m, with the company citing reduced volatility and market price levels as reason for the decline.\nOn a group level, the company’s Ebitda fell almost 19% last year to CHF 962.4m.\nEUR 1 = CHF 0.94\n",
        "datetime":"2025-02-26T07:01:28",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]