[
    {
        "title":"Analysts sceptical of German plans to return reserve power plants",
        "subtitle":"\n              (Montel) German plans to reduce electricity prices by returning retired power plants to reserves outside the market would likely prove counterproductive, analysts have told Montel.\n            ",
        "body":"\nGermany’s Christian Union (CDU\/CSU) and Social Democrats agreed the plans at the weekend’s exploratory talks to form the country’s next government.\nThey envision allowing power plants – many coal-fired – that recently entered reserves to return to the market to swell supply and dampen price spikes. \nYet many were withdrawn from the market because they were unprofitable, said Christoph Maurer, managing director of Aachen-based consultancy Consentec.\nThey were likely to occupy the expensive end of the merit order that selects which units operate on a given day, probably having “limited” impact on prices, he added.\nThe plan could only have a “very limited” effect on a futures market signalling a declining price outlook for years to come, said Tim Hoefer, a consultant at Berlin analysis firm Enervis.\nIn the medium term, it could have the opposite effect. “There is a risk that investments in battery storage and flexible consumption will be reduced and incentives for the construction and operation of power plants intended for the market will continue to decline,” he said.\nDepress prices?The relevant plants are contained in Germany’s capacity and grid reserves.\nThe former has 1.2 GW of power plant capacity that can only be activated if the day-ahead market cannot find sufficient supply to settle.\nThe latter includes plants used by network operators to stabilise grid imbalances.\nThe return of 7 GW of hard coal-fired plants could be expected to depress German prices by around 3-6% over the period 2025-2027, said Montel Analytics analyst Alex Schmitt, which was “maybe not quite as considerable” as the CDU\/CSU and SPD perhaps imagined.\nThe plants would have little incentive to return to market, given they received payments to remain on standby within reserves, the analysts said.\n“Allowing them to participate in the market again while retaining the remuneration would be very problematic,” Maurer added.\nNew units neededPressure to revive reserve power plants was “understandable”, said Christoph Mueller, head of grid operator Amprion.\n“We have been observing ever more frequent price peaks since 2024. Some have led to large consumers temporarily suspending production,” he added.\nThe reserve units were a kind of insurance for security of supply, but ultimately Germany needed to align its long-delayed power plant strategy with a “consistent reserve strategy”, he added. \n“We must immediately work with all stakeholders involved to define the reserves beyond 2030.”\nThe previous government had planned to tender for a fleet of 10.5 GW gas-fired power plants capable of switching their fuel to renewable hydrogen. The CDU\/CSU and SPD have aimed for 20 GW of gas-fired units without specifying a decarbonisation plan.\n",
        "datetime":"2025-03-11T13:18:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]