[
    {
        "title":"Balancing power prices crash to EUR -10,000 in Denmark, Sweden",
        "subtitle":"\n              (Montel) Balancing power prices in parts of Sweden and Denmark plunged to a record low EUR -10,000\/MWh on Sunday, as the new joint Nordic market for automated reserves continue to spur volatility.\n            ",
        "body":"\nPrices for down-regulation – where market participants get paid to reduce production or increase consumption – hit their lowest between 10:00-11:00 CET on Sunday in eastern Denmark (DK2), as well as the southern Swedish bidding zones SE3 and SE4, Nord Pool data showed.\nThis meant consumers that participated in the market would be paid EUR 10,000\/MWh to consume power, said Jakob Bendixen at consultancy Our New Energy on LinkedIn.\n“Boiling a kettle of water for one hour (2 kW) would pay you EUR 20,” he added.\nHigh volatilitySunday’s crash followed record prices for up-regulation of EUR 4,827\/MWh in western Denmark (DK1) last Thursday, confirming fears among market participants that the move to a joint model for automated frequency reserves would cause more volatility.\nHowever, Danish TSO Energinet told Montel on Friday that the price spike last week was caused by a fault in the Norwegian grid that reduced flows over the interconnector to Denmark.\nThis was a fault that could have also occurred under the former system of national manual frequency reserves, Energinet said.\nThe TSO has yet to comment on yesterday’s price movements.\n",
        "datetime":"2025-03-10T06:58:13",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]