[
    {
        "title":"Baltic nations to join Picasso balancing platform in April",
        "subtitle":"\n              (Montel) Estonia and Latvia plan to join the joint European power balancing platform Picasso in early April, their TSOs said on Wednesday, while Lithuania's Litgrid will join already now.\n            ",
        "body":"\nEstonia planned to join the platform on 9 April, said the country’s TSO Elering in a statement, where it added that all Baltic and Finnish TSOs were currently working to connect with the pan-European platform as soon as possible.\nLatvia’s TSO AST said in a separate statement it planned to join the platform on 10 April, while Litgrid said it had joined the platform now.\nInitially, only the imbalance netting with other TSOs would be available through the LitPol interconnector to Poland, said Litgrid in a separate statement on Wednesday afternoon.\nFrom 16 April, up to 30 MW of capacity over the 350 MW Estlink 1 power cable between Estonia and Finland would also be made available for Picasso, said Elering.\nFinland said last month it planned to join Picasso in March, following several delays. Last month, Norway postponed its entry to 2026 or 2027.\nThe Picasso platform was launched in 2022 with the aim of supporting balancing markets by sharing capacity between European countries, though last year several countries delayed entry amid concerns the algorithm caused price spikes.\nUpdates story published at 12:10 CET with new information from Litgrid, saying Lithuania will join Picasso now.\n",
        "datetime":"2025-03-05T13:29:51",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]