[
    {
        "title":"Batteries must complement German solar buildout – industry",
        "subtitle":"\n              (Montel) The next German government needs to ensure that investment in solar generation is complemented by development of battery capacity to ensure it does not go to waste, industry executives said on Tuesday.\n            ",
        "body":"\nThe comments came during an annual infrastructure event organised by energy lobby BDEW. Several participants used the gathering – which followed the weekend’s national elections – to urge the next government to think systematically when expanding Germany’s energy system.\nInstalled solar capacity rose sharply last month to top 100 GW, according to energy regulator BNA, with 16.2 GW of that installed in 2024.\nPlanned developmentHowever, the speakers on Tuesday cautioned that rushing to build out solar would not have an impact on Germany’s overall energy mix if there were not sufficient battery capacity to store excess generation, or if solar parks were built far away from high-use consumers.\n“Lawmakers, or BNA, could help us in this legislative period to better manage the pressure on the grid,” said Stefan Kapferer, CEO of TSO 50 Hertz.\n“At the moment, the thing we need least for the success of the energy transition is the addition of 20 GW of solar every year.”\nConstruction of renewables capacity has been brisk in recent years, said the speakers. However, connectors need to be built to push that power to the industrial south of the country, with eastern Germany lacking sufficient heavy consumers.\nSpeakers said data centres were being built in the region, which were using some of the excess power, but there was still a mismatch between supply and demand on days with high renewable generation.\nThe CEO of utility Leag, Adolf Roesch, said his company is investing in large-scale storage, but noted that Germany needs reliable baseload.\n“Large-scale storage will not ensure that we can get by during a “dunkelflaute” [when lulls in solar and wind output occur simultaneously],” he said. “For that situation, we’ll still need baseload, and we don’t have that today.”\nThe outgoing government has been pushing a plan to build 10.5 GW of new gas-fired and hydrogen-ready power plants by 2030, but the measure never advanced to parliament after snap elections were called.\nThe likely next chancellor, Friedrich Merz, has said he wants to build 50 new gas-fired power plants as quickly as possible.\n",
        "datetime":"2025-02-25T13:53:42",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]