[
    {
        "title":"Belgium cuts H2 network subsidies as demand lags – report",
        "subtitle":"\n              (Montel) Belgium will slash subsidies for a hydrogen network but remains open to future investment if demand picks up, energy minister Mathieu Bihet said on Tuesday.\n            ",
        "body":"\nThe government planned to save EUR 246m between 2025-2029 by cutting funding initially earmarked for the development of hydrogen transport infrastructure, Belgian daily L’Echo reported.\nThe move effectively eliminated most of the funding allocated by the previous government, although the first phase of the project would still receive EUR 95m from the EU recovery plan.\n“[Hydrogen] backbone projects are facing delays across Europe as green hydrogen remains significantly more expensive than fossil fuels,” Bihet said during a parliamentary hearing.\n“There’s no point in rolling over budgets year after year due to a lack of demand – or worse, building pipelines that remain empty. That would be a real failure,” the minister said.\nHowever, the government would reassess the sector’s needs “based on industrial conditions and the progress of private hydrogen projects,” Bihet said. A meeting with Fluxys, Belgium’s hydrogen network operator, was planned in the coming weeks.\n“If demand materialises in the medium term, we will explore ways to finance the infrastructure efficiently,” Bihet added.\n",
        "datetime":"2025-03-12T06:52:18",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]