[
    {
        "title":"BP cancels 500 MW HyGreen hydrogen project",
        "subtitle":"\n              (Montel) BP has scrapped plans for its HyGreen project in Teesside, northeast England, which was set to become one of the UK’s largest green hydrogen facilities upon completion, the energy company confirmed to Montel on Wednesday.\n            ",
        "body":"\nThe plant was due to have 500 MW of electrolyser capacity by 2030, with the first 80 MW phase originally scheduled to start operations in 2025.\nThe move comes as the UK government hopes that green hydrogen – which is produced using renewable energy – will help achieve its climate goals for net-zero emissions. \nIt also follows BP’s decision to cut low-carbon investments under pressure from several large shareholders, including Elliott Management.\nDespite being shortlisted for UK government subsidies, HyGreen failed to secure funding in the first Hydrogen Allocation Round.\nIts planning application expired in February 2025, and key agreements with potential hydrogen buyers never progressed. \nBP has said it is still moving forward with its 1.2 GW blue hydrogen project, H2Teesside, with the first 500 MW phase currently under permitting. A final decision is expected from the UK government within six months.\nGreen hydrogen is produced using renewable energy in the electrolysis process, whereas blue hydrogen relies on natural gas with an intent to capture and store the CO2 emissions.\nBP’s decision to cancel the green hydrogen project follows similar announcements by other companies in Europe in recent months.\nAlmost one in five European hydrogen projects were scrapped last year due to high costs coupled with a failure to obtain funding and a lack of demand, according to a recent survey from Westwood Global Energy Group, an energy market research and intelligence firm.\n",
        "datetime":"2025-03-05T11:39:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]