[
    {
        "title":"BP shuns green aims, plans USD 10bn hike in oil, gas investment",
        "subtitle":"\n              (Montel) UK energy major BP will slash spending on low-carbon activities by more than USD 5bn\/year up to 2027 in a move away from previously stated green goals, while increasing spending on oil and gas by around USD 10bn. \n            ",
        "body":"\nThe firm would focus on growing “top tier” offshore wind and solar platforms and limit further projects in hydrogen and carbon capture and storage, it added in a statement on Wednesday.\nIt said it would lower operational emissions in a range of 45–50% by 2030 compared with levels in 2019.\nIn contrast, BP would grow its production to 2.3-2.5m barrels of oil equivalent in 2030 with capacity increasing to 2035, it said.\nShareholder pressureBP has faced pressure from shareholders, including activist shareholder Elliot Management, to improve profits and return to its core business after it fell behind rivals such as Shell, with the latter increasing its investment in conventional fuels.\nLast October, BP abandoned its goal of reducing oil and gas production by 2030, which led environmental groups to accuse it of prioritising profit over the planet.\nThe company had been targeting a cut in production of oil and gas by 40% by 2030, while significantly boosting investment in renewables.\nEarlier this month, BP reported a 36% decline in net profits to USD 9bn in 2024.\n",
        "datetime":"2025-02-26T11:28:04",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]