[
    {
        "title":"Brent oil hits 5-month low on Opec+ supply increase",
        "subtitle":"\n              (Montel) Oil prices fell on Tuesday – with Brent hitting a five-month low and WTI a three-month low – after Opec+ confirmed its return of supplies, while new US tariffs and the Russia-Ukraine turmoil added to uncertainty.\n            ",
        "body":"\nThe front-month contract for Brent crude North Sea oil was last seen down USD 1.01 at USD 70.61\/bbl, while the WTI equivalent dropped USD 0.82 to USD 67.54\/bbl.\nEarlier, Brent hit its lowest point since 1 October of USD 70.50\/bbl, while WTI fell to its lowest point since 10 December of USD 67.78\/bbl after both contracts settled down about 2% yesterday and were on track for a third consecutive session of falls.\n“The oil market is dealing with competing forces at the moment in the form of tariffs on one side and the likelihood of increased production on the other,” Tim Waterer, chief market analyst at trading firm KCM, told Montel.\n“It is these expected increases on the supply side having the greater say when it comes to crude prices.”\nOn Monday, oil producer alliance Opec+ confirmed its plan announced in December to start gradually phasing out production cuts of 2.2m bbl\/day on a monthly basis from April until the end of September 2026, whilst maintaining additional voluntary production cuts of around 1.7m bbl\/day until then.\nHowever, the group said it “remains adaptable to evolving conditions” and that the increase may be “paused or reversed subject to market conditions”.\nTariffs beginBrent is trading close to 5% down for the year. Waterer said that the current oil prices were probably lower than where Opec+ would like them to be from a margin standpoint.\nHe said US president Donald Trump had “made it clear that he wants to see lower oil prices and one wonders whether Opec+ members such as Saudi Arabia and Russia may be taking relations with the US into account when making decisions about adding supply”.\nThis came after Trump confirmed that his 25% tariffs on Canada and Mexico would begin today and he also imposed an additional 10% tariff on Chinese imports on top of a 10% levy imposed last month.\n“Tariff measures from the US on Canada may well constrict supply but these worries are being more than offset by the prospect of Opec+ ramping up production come April,” said Waterer.\nGeopolitical jittersTony Sycamore, market analyst at IG trading platform, also pointed to the US “investigating lifting sanctions on Russia” as another factor weighing on oil prices.\nMarket participants were also assessing recent geopolitical events after an unprecedented clash in the Oval Office on Friday between Trump, his vice president JD Vance and Ukrainian president Volodymyr Zelensky.\nYesterday, the US announced it was pausing military aid to Ukraine.\nAjay Parmar global analytics director at Icis, told Montel that even if a deal was reached with Russia, “we think it is unlikely to lead to a significant increase in Russian oil flows” due to traders’ caution.\n",
        "datetime":"2025-03-04T09:33:52",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OIL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]