[
    {
        "title":"Brussels warns 5 EU nations over missing 2030 energy plans",
        "subtitle":"\n              (Montel) The European Commission has sent final warnings to five EU countries for failing to submit their plans showing how they will achieve their 2030 energy and climate targets, it said on Wednesday.\n            ",
        "body":"\nBelgium, Croatia, Estonia, Poland and Slovakia have still not submitted their final national energy and climate plans, which were required by 30 June last year.\nThe EC needs the plans from all 27 EU countries to assess whether the bloc is on track collectively to meet its overall 2030 energy and climate targets, which include sourcing at least 42.5% of its energy from renewable sources.\nThe five countries have two months to respond. If the EC is not satisfied with the responses, it can decide to refer the cases to the EU Court of Justice.\nLast November, the EC sent first warnings to 13 EU countries for failing to submit their final plans. \nAustria, Bulgaria, Cyprus, the Czech Republic, Greece, Malta, Portugal and Slovenia have since complied, leaving only five national plans missing.\nLacking ambitionThe EC’s assessment of EU countries’ draft plans in December 2023 found that they were not ambitious enough collectively to meet several of the bloc’s key targets.\nFor example, they would only cut greenhouse gas emissions by 51%, compared with the binding target of at least 55%.\nThey would also only lead to around 39% of energy being sourced from renewables by 2030, compared to the target of 42.5%.\nIt urged EU countries to ensure their final plans would cover these gaps. \n",
        "datetime":"2025-03-12T12:50:31",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]