[
    {
        "title":"Carbon slides below EUR 70-t for first time this year",
        "subtitle":"\n              (Montel) Europe’s benchmark carbon price plunged to below EUR 70\/t for the first time in nine weeks on Tuesday morning, pressured by macroeconomic factors and the prospect of less demand for carbon-intensive power generation with milder weather ahead.\n            ",
        "body":"\nThe Dec 25 EUA slumped to its lowest level since 24 December, at EUR 69.16\/t, on Ice Endex. It was last seen changing hands at EUR 69.25\/t, down EUR 2.30 on the day.\nCarbon prices have shed around 20% since the end of January amid concerns that US tariffs on imports could start a trade war that would slow global economic growth.\nTariffs on goods entering the US from China, Canada and Mexico have come into force, with China and Canada unveiling fresh retaliatory measures. The US president, Donald Trump, has warned of the tariffs since his inauguration on 20 January.\nMarket participants are “pricing in the impact of potential US tariffs on the EU economy”, said Yan Qin, principal analyst at consultancy ClearBlue Markets.\n“This has prompted some investors to reduce their length in [EUAs] and broader European assets as we see the aggressive selling in EU\/UK ETS since yesterday,” said Qin.\nShe said the break below a key support level of EUR 71\/t triggered further technical selling. \n“The rise in the EUA price since the end of December is not much due to fundamentals, and not the same for the drop back to December levels. This is all about investor positioning.”\nStock markets also tumbled after Trump confirmed that his administration’s 25% tariffs on Canada and Mexico would begin today, while also imposing an additional 10% tariff on Chinese imports on top of a 10% levy imposed last month. \nMilder weatherOne trader cited milder temperatures ahead for contributing to the bearish sentiment.\nTemperatures across Europe are expected to rise from near normal levels to a peak of 5C above average by the end of the week, according to Montel Analytics. Above-average weather is likely to dent demand for heating, pressuring both gas and carbon prices.\nMeanwhile, the speculative investors’ net long position in carbon allowances is still relatively high at 50.3m tonnes, despite two consecutive weekly reductions, according to the latest Ice report on the commitment of traders from last week.\n“[The] question now is what’s fair price once [investor] funds are washed out,” the trader said.\nClearBlue Markets expects the Dec 25 EUA to end the first quarter of this year at around EUR 70\/t.\n",
        "datetime":"2025-03-04T11:14:48",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]