[
    {
        "title":"Change to 15-min trading to curb power liquidity – analysts",
        "subtitle":"\n              (Montel) The introduction of 15-minute windows for intraday power trading in Spain – as opposed to the 60 minutes currently – was set to curb liquidity, several analysts told Montel on Wednesday.\n            ",
        "body":"\nThe change, to be introduced in Spain and the Nordic region from next Tuesday and other European countries from June – should enable market participants to balance intermittent renewable generation “more precisely” but they would need to make fewer transactions, said Jean-Paul Harreman, director at Montel Analytics.\nUltimately, there could be “lower liquidity in intraday auctions”, he added.\nProgressive problemMeanwhile, progressive implementation of the new measure over the next three months would cause a “decoupling” between bids in the daily market – still in hourly blocks until 11 June – and those in the intraday market – which would move to 15-minute blocks next week – said Rodrigo Garcia, an analyst at Optimize Energy.\n“Matching hourly blocks with quarter hourly blocks is not always easy”, which could compound the liquidity issue, he added.\nBoth analysts also pointed to additional operational hurdles for traders amid increased volumes of data due to the change to 15-minute trading blocks.\nThe above issues along with the absence of portfolio bidding – common in other European markets and which allows producers to group their generation or purchase units instead of making individual bids – meant “more operational complexity, potential price volatility and reduced market liquidity”, said Harreman.\n",
        "datetime":"2025-03-12T16:45:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]