[
    {
        "title":"Contractual spat puts German LNG terminal Stade at risk",
        "subtitle":"\n              (Montel) A dispute between two contract parties threatens the launch of the already delayed German LNG terminal Stade, with both parties accusing each other of failing to fulfill obligations.\n            ",
        "body":"\nThe first LNG imports were initially planned before last winter following the arrival of the floating terminal (FSRU) Energos Force – with a grid injection capacity of 4.7 bcm\/year – on 15 March 2024.\n“Due to the continuous failure to fulfill contractual obligations by Hanseatic Energy Hub (HEH), the FSRU project Stade has no prospect of successful completion,” Deutsche Energy Terminal (DET) said.\nState-owned DET said it cancelled its contracts with HEH for failing to prove the technical completion of the structure connecting the ship to the gas grid. “This was necessary to avert unforeseeable growing financial damage to DET and its shareholder, the Federal Republic of Germany.”\nBerlin established DET in January 2023 to accelerate imports of LNG in a bid to diversify German gas procurement and compensate for the loss of Russian pipeline gas.\n“Completely unfounded”HEH, meanwhile, claims to have fulfilled contractual obligations and sees the connection infrastructure ready to operate. However, it is still waiting for DET to pay outstanding bills, it said. Industry sources mention an amount of around EUR 50m.\nAn HEH spokeswoman described DET’s contract cancellation as “completely unfounded” and stated that “due to a massive loss of trust on our part, we have issued a termination”.\nEvelin Wadephul, head of the Cuxhaven Trade Supervisory Office, told Montel that from a regulatory approval standpoint, “there is nothing to prevent the terminal from being put into operation”.\nHEH remained in talks with DET and Germany’s ministry of economy and climate action. DET said it will \"inform about the further course of action in Stade in due time”.\n",
        "datetime":"2025-03-20T09:43:18",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]