[
    {
        "title":"Croatia, Slovenia warn of rise in energy system cyberattacks",
        "subtitle":"\n              (Montel) Croatia and Slovenia are experiencing an increase in the complexity and overall amount of cyberattacks on their energy systems, local security sources have told Montel.\n            ",
        "body":"\n“We are detecting an increase in the number and sophistication of attacks [on the Croatian energy infrastructure] by the most dangerous attackers – state-sponsored groups,” a source from a local company with experience of the issues, who wished to remain anonymous, told Montel on Tuesday.\nThe source said the number of attacks had increased since Kresimir Kristic, the IT security head of Croatia’s state-owned utility Hep, told an industry event last September that the company was facing up to 10m incidents per hour that may impact the country’s energy security.\nThe energy infrastructure in neighbouring Slovenia has also been increasingly exposed to cyberattacks, a source at Slovenia’s government information security office told Montel. The source, who wished to remain anonymous, pointed to a growing number of incidents reported, especially since 2022.\n“The electricity sector is primarily a target due to the importance of the system and the services it provides and consequently also because the systems are increasingly digitalised and therefore more vulnerable,” the source added.\nNew cybersecurity projectIn response to the attacks, 13 energy companies in Slovenia and Croatia, including Slovenia’s power TSO Eles, recently started the Artificial Intelligence for Slovenian Electro-Energy Sector Security Operation Centre project.\nThe project aims to enhance cyber resilience, improve the detection of and response to cyberattacks and protect critical European infrastructure from advanced cyber threats, Eles said last week.\nAdditional reporting by Valerija Hozjan and Peter Palcec\n",
        "datetime":"2025-03-11T15:05:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRANSMISSION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]