[
    {
        "title":"Croatia preparing CFD incentives for geothermal projects",
        "subtitle":"\n              (Montel) Croatia is preparing a contract for difference (CFD) financing model to incentivise geothermal investments, the country’s economy minister Ante Susnjar told journalists at an industry conference in Zagreb on Tuesday.\n            ",
        "body":"\nThe recently updated national energy and climate plan (NECP) drew criticism for envisaging only 68 MW of geothermal capacity by 2030, despite there being potential for far higher. However, investors say the authorities need to hurry if even this goal is to be met.\nSusnjar provided little detail about the CFD model but said that it has been discussed with the energy market operator Hrote and the regulator, Hera.\nHowever, he noted that Croatia expects the EU to start funding geothermal projects from 2027. “Until then, we have the financial capacity to finance the projects that will be ready,” Susnjar said.\nInvestors’ concerns“We need to sign CFDs as soon as next year if we are to build the most advanced projects and connect them to the grid by 2030,” Dragutin Domitrovic – the CEO of IGeoPen, a subsidiary of the UK’s Star Energy – told Montel.\nIGeoPen is developing a 10-15 MW geothermal power plant in northeastern Croatia, while Croatia’s Enna Next and Turkey’s Soyak are also developing geothermal projects with a combined capacity of 118 MW.\nUnder current regulations, Croatian projects that are already in the construction phase do not qualify for incentives. After signing a CFD, investors have four years to build the project.\nDomitrovic also pointed out that investors are still waiting for the energy regulator to adopt a new grid connection fee, which could have a significant impact on the cost of new projects. Lobby groups said that several GW of capacity in the pipeline are on hold because of this uncertainty.\n",
        "datetime":"2025-03-04T16:03:24",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]