[
    {
        "title":"Danish H2 plan unlikely to undermine Norway cables – analysts",
        "subtitle":"\n              (Montel) Denmark’s ambition to produce green hydrogen will unlikely undermine the viability of renewing two ageing power cables between Norway as feared by its energy minister, analysts said.\n            ",
        "body":"\nDenmark aims for 4-6 GW of electrolysis capacity for renewable hydrogen by 2030 and 9 GW by 2035.\nHowever, Norway’s energy minister, Terje Aasland, recently expressed concerns that increased hydrogen production in Denmark would boost its demand for power exports from Norway, putting a plan to renew the cables between the countries at risk.\n“The scenario the [Norwegian] minister is presenting is not realistic,” chief analyst Sigbjorn Seland at StormGeo told Montel.\nHe said Denmark would expand its offshore wind capacity to help produce the green hydrogen rather than import more electricity from Norway - meaning it would not lead to the decline in Norwegian reservoir levels the minister fears.\nDenmark was more likely to be less dependent on imports from neighbouring countries like Norway. In return, Norway would probably be able to import more cheap electricity from Denmark during hours with high wind power output, he said.\nProfitabilityChief analyst Tor Reier Lilleholt at Volue Insight said the Norwegian energy minister’s concerns appeared unwarranted because Denmark would want to ensure that producing green hydrogen would be profitable for the companies involved.\n“The reason why you can invest in hydrogen is that someone wants to buy it, and that there is an abundance of [power at] low prices. If there is not an abundance of [power at] low prices, then it will not be profitable to build hydrogen production” he said.\n",
        "datetime":"2025-03-12T11:53:31",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]