[
    {
        "title":"Danish electrolyser producer files for bankruptcy protection",
        "subtitle":"\n              (Montel) Danish electrolyser producer Green Hydrogen Systems will file for bankruptcy protection due to serious financial difficulties, it said late on Sunday.\n            ",
        "body":"\nThe group had struggled financially for some time but the situation deteriorated recently after it failed to attract a targeted DKK 300m (EUR 40m) through a share issue, it added in a statement to the Copenhagen Stock Exchange, where it is listed.\nGreen Hydrogen Systems said it had experienced a significantly slower than expected market adoption of its hydrogen technology, while at the same suffering from overall adverse market developments for green hydrogen, typically produced from excess renewables.\nThe aim of the restructuring was to explore whether a basis could be established which allows for all or part of the company’s operations to continue, it said.\nThe company was founded in the Danish city of Kolding in 2007.\nGreen hydrogen was seen as a key plank of Europe’s energy transition but the high costs of implementing the technology are hampering development.\n(EUR 1 = DKK 7.46)\n",
        "datetime":"2025-03-10T06:48:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]