[
    {
        "title":"Data centre boom to boost role of gas in Italy – Snam CEO",
        "subtitle":"\n              (Montel) The rapid growth of data centres in Italy will boost electricity consumption and the role of gas-fired power generation and gas infrastructure, said the CEO of gas TSO Snam.\n            ",
        "body":"\nStefano Venier said the anticipated surge in power demand will require stable energy sources, such as nuclear or gas.\nWith nuclear power still in long-term planning, gas-fired combined cycle turbines (CCGTs) remain the primary option for ensuring grid stability, he said late on Wednesday during a call with analysts on the company’s full-year 2024 earnings.\n“The flexibility that gas pipelines and storage facilities provide combined with the CCGTs will make the difference to fulfil this additional demand,” Venier said.\nPower demand surgeEarlier this year, power TSO Terna said that the current 30 GW of data centre connection requests in Italy could increase national power demand by 240 TWh, nearly doubling the country’s current total consumption. \nThe increased reliance on gas-fired power plants is expected to drive demand for both gas transportation and storage, Venier said.\nAs renewable energy penetration grows, managing supply fluctuations becomes more challenging, “and the sole solutions we have for offsetting this volatility and maintaining the electricity system stable is to use thermal generation” powered by gas supported by a sizeable storage system in Italy, he added.\nIn February, Italy saw a 22% year-on-year increase in gas withdrawals due to higher thermal generation demand, mirroring trends seen in Germany, he noted.\nItaly’s gas stocks were last seen at 45.5%, more than 10 percentage points above Europe’s 34.5%, Gas Infrastructure Europe data showed.\n",
        "datetime":"2025-03-20T06:21:21",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CONSUMPTION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]