[
    {
        "title":"Draghi warns of “urgent”, escalating energy cost crisis in EU",
        "subtitle":"\n              (Montel) The need to address high energy costs in Europe has become “even more urgent” over the last six months, former Italian prime minister and European Central Bank president Mario Draghi said on Tuesday.\n            ",
        "body":"\nDraghi presented a competitiveness report at the behest of the European Commission in September.\nSince then, the situation has become more pressing. Wholesale gas prices in Europe rose by an average of over 40% between September and February, and in the last week by another 15%, Draghi told the Italian parliament.\nHe emphasised the need to increase Europe’s purchasing power in the gas market, as it is the world’s largest consumer. Improved coordination among countries and more flexible gas storage management could prevent demand rigidity, he added, noting that a similar situation occurred in 2022.\nDraghi also highlighted the need for greater transparency and oversight in gas markets, which are currently “dominated by a few financial companies”.\nDearer than USWholesale electricity prices remain high in Europe, up to three times those in the US. To lower costs, Draghi suggested increasing the share of green energy in the generation mix, using contracts for difference, and promoting power purchase agreements.\nDraghi urged the swift implementation of the EC’s energy reforms. He also warned that “decarbonisation is at risk”, as are the survival of some industrial sectors and the development of new technologies, such as data centres, which consume large amounts of energy.\n",
        "datetime":"2025-03-18T11:23:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]