[
    {
        "title":"EC approves Belgian state aid for nuclear lifetime extensions",
        "subtitle":"\n              (Montel) The European Commission has approved Belgian State aid for the extension of the running lives of the country’s Doel 4 (1 GW) and Tihange 3 (1 GW) nuclear reactors by another 10 years.\n            ",
        "body":"\nBelgium was initially set to close its seven nuclear reactors by 2025. But in March 2022, the government decided to keep its two newest nuclear power plants running until 2035, in the context of the energy crisis and the outbreak of the war in Ukraine.\nIn its announcement on Friday, the EC said it completed an “in-depth investigation” to assess the “need, appropriateness and proportionality” of Belgium’s plans to support the lifetime extension of the reactors.\nTo ensure there was “no distortion on the functioning of the electricity market”, the EC made Belgium transfer decision making regarding the modulation of the reactors for economic reasons to an independent energy manager, among other measures.\nNuclear reactors can ramp their power output up and down, or modulate, to respond to market signals.\nNew joint ventureA joint venture between Electrabel, a French energy firm Engie subsidiary, and the Belgian government, called BE-NUC, owns 89.8% of the Doel 4 and Tihange 3 reactors. Luminus, a subsidiary of French utility EDF, owns the remaining 10.2%.\nThe independent energy manager would sell BE-NUC’s share of electricity on the market.\nCertain financial arrangements were also modified, including “[limiting] the exposure of the Belgian State to the high costs of unexpected outages”, the EC said.\nEarlier this month, Belgium’s new coalition government unveiled its political programme, including plans to extend the running time of the Doel 4 and Tihange 3 plants by an additional 10 years, to 2045.\nEngie said at the time that such a move was “not currently under consideration”.\n",
        "datetime":"2025-02-24T07:17:44",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]