[
    {
        "title":"EC aims to delay CBAM purchase obligation by 1 year to 2027",
        "subtitle":"\n              (Montel) The European Commission wants to delay companies’ certificate purchasing obligation under the EU carbon border adjustment mechanism (CBAM) from 2026 to 2027, according to a leaked draft document seen by Montel.\n            ",
        "body":"\nCompanies should “only be obliged” to purchase CBAM certificates in 2027 for emissions from goods imported in 2026, according to the proposal, to give them sufficient time to adapt.\n“Companies will still be on the hook for 2026 emissions but won’t need to fully account for them until 2027,” Dan Maleski, senior environmental markets advisor at Redshaw Advisors, told Montel.\nThe 2027 price of CBAM certificates to cover emissions from goods imported into the EU in 2026 should reflect the price of EU ETS allowances in 2026, according to the draft document. The current EUA benchmark, the Dec 25, was last seen trading at EUR 72.48\/t.\nCBAM, set to launch in 2026, covers imports of electricity, iron and steel, aluminium, hydrogen, fertilisers and cement.\nEUA price impact?“This delay doesn’t remove the financial burden, it just shifts when it hits,” said Maleski. “For this reason, we don’t expect any short-term EUA price impact… because liability doesn’t go away and anyone pre-hedging has no reason to change their approach.”\nSimon Goess, managing director at German consultancy Carboneer, said it would be interesting to see if the proposed delay affected the phase-out of free allowances in the EU ETS, currently set to end by 2034.\nHe said EU producers could be disadvantaged if there was “a delay of the obligation to purchase CBAM certificates from 2026 to 2027” without “an equivalent change in the EU ETS regulation”.\nThe EC has been looking at ways to simplify CBAM, including suggestions earlier this month of exempting 80% of eligible EU companies by raising the threshold for inclusion.\nThe latest draft document has proposed new exemption thresholds for small importers, including a threshold of 50 tonnes of covered goods and 100 tonnes of embedded carbon dioxide, which are expected to exempt around 90% of importers from obligations.\nOther new proposals include the introduction of tougher penalties for deliberate non-compliance and a reduction in quarterly certificate holding requirements.\n",
        "datetime":"2025-02-24T12:10:04",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]