[
    {
        "title":"EC cancels presentation of Russian fuels phase-out plan",
        "subtitle":"\n              (Montel) The European Commission has cancelled plans to present a roadmap on 26 March on how the bloc will phase out Russian fossil fuels by 2027, according to its latest agenda.\n            ",
        "body":"\n“We have no new timing to share,” a spokeswoman for the EC told Montel, who noted work on the roadmap nevertheless “continues”.\nEnergy commissioner Dan Jorgensen reiterated last week that Europe needed to be independent of Russian fossil fuels, as such purchases were “indirectly helping Putin finance his war”.\n“Since the war began, we have imported fossil fuels from Russia for an amount equal to the cost price of 2,400 F35 fighter jets. This will obviously not stand,” he said.\nThe roadmap, which was announced in November 2024 by Jorgensen, was initially scheduled for 26 February, but was postponed in January to 26 March.\nIn its competitiveness compass strategy paper unveiled in January, the EC said the roadmap would set out “lawful measures towards ending Russian energy imports”.\nThe roadmap was intended to deliver the EC’s RePowerEU plan introduced in 2022 in response to Russia’s full-scale invasion of Ukraine in February that year. At the time, the EC said it wanted to end Russian gas imports by 2027. \nRussian pipeline gas imports to the EU have plummeted since the war began but LNG imports from the country hit a record high 20bcm in 2024.\nSecurity plansMeanwhile, the EC still plans to publish the EU’s preparedness union strategy on 26 March, which aims to develop a common, cross-sector approach to tackle security threats across the bloc.\nIt will be followed on 1 April by its new European internal security strategy, which seeks to protect critical infrastructure, enhance cybersecurity and tackle hybrid threats amid recent attacks on European power and data cables.\n",
        "datetime":"2025-03-05T11:00:50",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]