[
    {
        "title":"EC consults on new state-aid framework for decarbonisation",
        "subtitle":"\n              (Montel) The European Commission has launched a market consultation on a new state aid framework that is part of its strategy to improve the competitiveness of industry while helping it to decarbonise, it said on Tuesday. \n            ",
        "body":"\nThe consultation will be addressed to member states and industry stakeholders, and will run until 25 April.\nThe new framework was unveiled in February as part of the EC’s clean industrial deal, and seeks to make state aid rules simpler and its delivery faster, as part of the attempt to increase renewable energy generation.\nUnder the proposed rules, industry would be required to use green hydrogen over low-carbon hydrogen – which can be produced from nuclear or fossil fuels with carbon capture – in order to qualify for state aid. \nNuclear includedNuclear energy, which was not mentioned in an earlier draft of the new rules, will also be considered for state aid, an EU official said in a briefing on Tuesday.  It was included in the final document “to reassure everyone”, he said. \n“We don’t have system guidelines [for nuclear] but we have cases where we have allowed it,” he said, citing the earlier provision of EU aid to Belgium to prolong the lifespan of existing reactors, and to the Czech Republic for the construction of a new nuclear plant. \nNuclear plants’ eligibility for state aid boiled down to “very individual cases”, the official said, and involved major investment that required detailed legal and economic assessment. \nFollowing the consultation, the new rules are set to be adopted in June, and to be in force until 2030.\n",
        "datetime":"2025-03-11T13:22:35",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]