[
    {
        "title":"EC eyes EUR 100bn for Industrial Decarbonisation Bank",
        "subtitle":"\n              (Montel) The European Commission is to propose an “Industrial Decarbonisation Bank” with potentially EUR 100bn in funding for projects offering the biggest emission cuts, it said on Wednesday.\n            ",
        "body":"\nThe goal was to complement the EU ETS carbon price signal to help energy-intensive industries invest to decarbonise while remaining competitive, the EC said in its clean industrial deal strategy.\nThe proposal would come in the second quarter of next year, after running a pilot this year with EUR 1bn of funding.\nThe priority would be to select projects offering the biggest emission reductions across sectors using any low-carbon or renewable technologies, while ensuring a fair distribution across the 27-nation bloc, the EC said.  \nThe support could be given as carbon contracts for difference, for example.\nGermany, the EU’s biggest economy, has promoted the push for decarbonisation investments without harming industrial growth by way of a government guarantee to cover extra costs.\nFunding sourcesOf the potential EUR 100bn funding, around EUR 20bn would come from the ETS Innovation Fund this year, EU climate commissioner Wopke Hoekstra told reporters in Brussels.\nThe Innovation Fund is financed by selling EU ETS allowances (EUAs).\nAround EUR 30bn could come from voluntary contributions by EU countries, and another EUR 33bn from taking 10% of revenues from EUAs due to be auctioned between 2028 and 2037, said Hoekstra.\nThere were also plans to leverage EUR 2.5bn from the InvestEU fund by a factor of 10 to bring the total available to more than EUR 100bn, he said.  \nThe InvestEU fund uses EU budget guarantees to leverage public and private funds to support the bloc’s energy transitions and plans to end Russian energy imports. \n",
        "datetime":"2025-02-26T14:16:43",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]