[
    {
        "title":"EC mulls nuclear subsidies as part of new industrial deal",
        "subtitle":"\n              (Montel) The European Commission is considering subsidies for nuclear energy under simpler state-aid rules as part of its strategy to improve the competitiveness of industry, while helping it reach decarbonisation goals, it said on Wednesday. \n            ",
        "body":"\n“Fully recognising the member states’ right to decide on the energy mix, the commission will assess the state aid for nuclear supply chains,” the EC said in its so-called clean industrial deal published today, with the new framework set to be adopted in June. \nUnder a previous draft of the state-aid framework seen last week, the EC said it would favour clean technologies to support the decarbonisation of industries, with no mention of nuclear. \n“We don’t explicitly mention nuclear energy in the clean industrial deal. We don’t give it specific treatment but [nuclear] is considered as part of the broader clean technology concept,” an EU official told reporters late on Tuesday.\nNuclear could not, for example, be excluded as a source of producing low-carbon hydrogen, she added, with the latter seen as a key plank of decarbonising the bloc’s energy sector. \n“We want to set out the production of low-carbon hydrogen in a pragmatic way,” said the official. \n“We are firmly committed to the principle of technological neutrality because this is about the uptake of clean tech renewables and everything that we need for the decarbonisation.”\nNuclear assessmentAnother EU official said the commission would assess the needs of the nuclear sector given the different objectives set out by member states, under an illustrative nuclear programme announced by energy commissioner Dan Jorgensen last year.\nHe was referring to those that had “indicated the contribution of nuclear to their electricity production”.\nBrussels also wanted to introduce measures to aid the development of small modular reactors, he added.\n“This demonstrates that we are emphasising measures to promote the roll out of renewables but we also integrate nuclear in our thinking of the action plan.” \nA raft of measures have been set out today in the EU’s clean industrial deal, including ways to lower energy prices.\n",
        "datetime":"2025-02-26T12:49:56",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]