[
    {
        "title":"EC mulls support for PPAs to bridge green energy gap",
        "subtitle":"\n              European Commission plans to support adoption of clean energy power purchase agreements (PPAs) could address concerns about supply not being available during periods of intermittent green output, experts told Montel.\n            ",
        "body":"\nThe European Commission’s Clean Industrial Act is paving the way for PPAs to be fortified with clean back-up power in a bid to provide consistent coverage through periods of low renewable energy output. \nWho pays?Industrial appetite for PPAs has been restrained by the burden of who pays for electricity during the hours when renewable energy output recedes.\nTopping up the periods when renewables were unavailable was generally more expensive than the baseload price of power for a year, proving an unattractive burden for industries already straining to remain globally competitive, critics said. \nAs part of its clean industry plan, the EU’s executive is seeking member states’ opinions on a “clean flexibility instrument” based on PPAs and industry commitment to consume clean electricity.\nThis could lead to the introduction of mechanisms addressing the limitations of standard renewable PPAs by supporting so-called 24\/7 PPAs that guaranteed consistent clean power delivery regardless of intermittent generation conditions, experts said.\n“The EC has understood that renewables offer the lowest average cost of energy and as a result, they are pushing for mechanisms that would allow this low average cost to be passed on to the end consumer,” said Placido Ostos, senior analyst at LevelTen Energy.\nThe EC currently has “no particular solutions in mind” and is “seeking something which bridges the gap” between a company’s power needs and available renewable energy supply, Stephen Woodhouse, director of consultancy Afry, told Montel.\nClosing the gapOne option could be to auction measures that cover the price difference between standard and 24\/7 PPAs, said EnergyTag’s executive director Killian Daly.\nThe flexibility that could compete to close the gap could mean battery storage systems or even a reduction in another consumer’s demand. \n“They should present a policy instrument that incentivises clean flexibility PPAs provided that industry commits to buying clean power,” Daly said.\nSuch a mechanism would transfer market volatility risk from industrial buyers to suppliers, while making hedging solutions economically viable.\nThe market would then find the most cost-efficient way of combining the cheapest source of variable renewable generation with the most locally efficient form of flexibility.\n“The common thread that today connects up the entire European regulatory universe is the need to put green energy where and when it’s needed and making sure the network isn’t bottlenecked,” said Dario Gallanti, partner at Spanish PPA consultancy Our New Energy.\nSince this is not happening, support mechanisms need to be found to “make it possible”.\n“Better planning”“Better planning of consumption also with software and service providers” was also needed, said energy lawyer Svenja Bartels at Roedl and Partner.\nIndividual “member states will adopt the measures they feel are suitable, which means that also Italy will work on instruments allowing the market to grow”.\nAnother of the responses could be instruments like “demand response by way of a PPA”, said Bartels.\nThis is an online version of an article published in Montel’s Energy Transition Weekly last Friday.\n",
        "datetime":"2025-03-12T14:18:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]