[
    {
        "title":"EC proposes gas storage extension to 2027 with flexibility",
        "subtitle":"\n              (Montel) The European Commission on Wednesday proposed extending its gas storage regulation until the end of 2027, though called for member states to introduce flexibility measures during the refilling months leading up to winter.\n            ",
        "body":"\n“We are recommending this flexibility today to avoid market distortions in the current situation and reduce the stress in the market,” said energy commissioner Dan Jorgensen in a statement. \nUnder the proposal, the EC would keep a mandatory target to fill underground storage to 90% of capacity by 1 November for both 2026 and 2027. \nThis would be come with usual intermediary targets that would be non-binding for the months leading up to 1 November. \n“The continuing tight situation in the global gas market calls for an extension of these provisions beyond 2025,” the EC said. \nIndicative targets“[Intermediary] targets are indicative and should allow for storage filling in such a way that there is sufficient flexibility available for market participants throughout the year,” the EC said.\nThe overall framework must be “flexible enough during the filling season to allow a swift reaction to constantly changing market conditions and in particular to take advantage of the best purchasing conditions,” it added.\nIn recent weeks, the rules introduced in 2022 as one of the EC’s emergency measures following Russia’s full-scale invasion of Ukraine, have come under fire as some said the rules had distorted the market by pushing summer gas prices significantly above their winter counterparts. \nThe proposal will now be submitted to the European parliament and the EU council for approval. \n",
        "datetime":"2025-03-05T12:55:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]