[
    {
        "title":"EC sets out quick way to approval for power capacity mechanisms",
        "subtitle":"\n              (Montel) The European Commission on Tuesday set out how national governments should design their electricity capacity remuneration mechanisms to achieve their swift approval, in its draft guidelines for state aid aimed at supporting decarbonisation.\n            ",
        "body":"\nThis would involve choosing between a strategic reserve or a market-wide central buyer capacity mechanism model, complying with specific criteria for each option as set out in the draft guidelines, and having a fixed time limit for them.  \nIf some of these criteria are not met, the EC said it may have to use its standard state-aid guidelines for climate and energy to assess if proposed mechanisms comply with EU rules. The implication is that this would take longer.\nA criterion that applies to both options is that only a generation reliability shortfall identified in the latest available European resource adequacy assessment approved by EU energy regulatory agency Acer can be used to justify needing a national capacity mechanism.\nAnother that applies to the market-wide mechanism is that it must be open to applicants across national borders.\nCapacity mechanisms and strategic reserves involve governments paying generators – or potentially demand-side response or storage units – to be available when needed to ensure security of supply.\nThe rising share of variable and intermittent renewable generation in the electricity mix has increased interest in such mechanisms.\nEight EU countries had active mechanisms in 2024, covering two thirds of EU power demand, an analysis by Acer found. Two more were making payments under legacy contracts. Acer estimated the total cost of such mechanisms at EUR 6.5bn last year.\nMinisterial debateEU energy ministers are to discuss the role of capacity mechanisms in reducing energy costs at their council meeting on Monday in Brussels, according to a preparation note from the Polish EU presidency.\nThis will be part of the debate on the EC’s affordable energy action plan unveiled last month.\nThe EC is consulting with national governments and stakeholders on its simplified state-aid guidelines until 25 April, and plans to adopt them in June. They would remain in force until the end of 2030.\n",
        "datetime":"2025-03-11T16:00:51",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]