[
    {
        "title":"EC sets out ways to lower energy prices in competitiveness boost",
        "subtitle":"\n              (Montel) The European Commission has set out eight ways to lower energy prices and keep EU industry competitive in its affordable energy action plan published on Wednesday.\n            ",
        "body":"\nThese include making final electricity bills more affordable, bringing down electricity supply costs, ensuring fair, competitive wholesale gas prices, promoting investments in energy efficiency and further integrating EU energy markets.\nThey also include governments working with low-carbon and renewable energy producers and energy-intensive industries to agree commitments to promote a more favourable, predictable investment climate. \nThe final two actions are focused on improving energy security and preparedness for price crises.\nThe EC said it would propose updates in early 2026 to the EU’s energy security rules to help reduce price volatility.\nIt would also provide ad hoc guidance as needed to help governments and grid operators to encourage reducing demand at peak times and\/or shifting it to other times.\nLower taxesThe specific measures within these broad actions include the EC urging national governments to agree on updates to EU energy tax rules it proposed in 2021. These aim to end tax breaks for fossil fuels and allow governments to lower taxes on electricity.\nChanges to EU tax rules must be agreed unanimously by all 27 national governments.\nThe EC also plans to promote more efficient power grid tariffs and to increase regulatory oversight of gas markets.\nTo help decouple end-use user electricity prices from volatile fossil fuel prices, the EC would promote long-term contracts such as power purchase agreements with de-risking instruments such as European Investment Bank guarantees.\nThe EC presented the affordable action plan alongside a clean industrial deal strategy as part of its response to Europe’s high energy prices relative to competing regions in America and Asia. \n",
        "datetime":"2025-02-26T11:39:23",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]