[
    {
        "title":"EC to help Ukraine buy gas, integrate with EU power market",
        "subtitle":"\n              (Montel) The European Commission will help Ukraine buy gas and fully integrate its power market with the EU’s, it said as it unveiled a new support package intended to improve energy security in the war-torn country.\n            ",
        "body":"\nThe EC would use EU funds, particularly the Ukraine Facility set up to provide financial support from 2024 to 2027, to ensure the country has “ample gas reserves”, it said on Sunday, without giving details.\nUkraine’s gas storage levels have more than halved on the year to reach a record low of 2.39bcm, or just 7.3% of capacity, Montel reported last week.\nThe plans to help fully integrate the power markets of Ukraine and Moldova into the EU’s by spring 2027 relied on Ukraine rapidly fulfilling its commitments to update legal, regulatory and public service obligations, the EC said.\nThe support package would also speed up renewable energy investments, adding up to 1.5 GW of power generation capacity, which would represent a 25% increase from the current level.\nThe EU has already provided more than EUR 2bn to help Ukraine improve the resilience of its energy system since Russia’s invasion three years ago.\nSince September, support provided by the bloc has helped to repair 1.8 GW of thermal power plant capacity, roll out wind and solar projects, and increase Ukraine’s commercial capacity to import electricity from the EU to 2.1 GW from 1.7 GW, plus an emergency buffer of an extra 250 MW, the EC said.\nThe EC and Ukraine have also agreed to cooperate more on developing renewable gases to improve energy security for the EU and support investment in Ukraine.\nEnergy independenceRussian attacks against Ukrainian energy infrastructure showed why achieving energy independence was so important, and why it was a strategic goal for both the EU and Ukraine, said EU energy commissioner Dan Jorgensen in a statement on the new support package.\n“More homegrown renewables and better interconnections amongst us is the best guarantee for a better and safer future together,” he said.\nThe EC is due to publish a roadmap on 26 March outlining how the EU can phase out its remaining Russian energy imports by 2027. \n",
        "datetime":"2025-02-24T10:26:18",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]