[
    {
        "title":"EC to propose gas storage rule extension until 2027 – source",
        "subtitle":"\n              (Montel) The European Commission is planning to make a proposal to the EU Council in early March to extend the bloc’s gas storage regulation from the start of 2026 until the end of 2027, a source close to the matter told Montel.\n            ",
        "body":"\nThe extension until the end of 2027 would allow the EC to revise in parallel its wider security of gas supply regulation next year, the source said.  \nThere would be no major changes to the regulation, the source added.\nEnergy commissioner Dan Jorgensen, while presenting the EC’s clean industrial deal today, confirmed plans to extend the rules.\nHowever, he declined to comment on any change to storage rules before December this year, when the current refilling rules are expected to expire. \nCalls for flexibilityAccording to the existing rules, EU-wide storage must reach 90% of capacity by 1 November, with intermediary targets for February, May, July and September. \nSome member states had been calling for more flexible targets, saying the rules had been distorting the market by pushing summer gas prices significantly above winter prices.\nLast week, a draft document of the clean industrial deal had suggested the refilling goals would be made more flexible.\n",
        "datetime":"2025-02-26T14:48:11",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]