[
    {
        "title":"EC to offer EUR 1bn from ETS in 2025 for rapid emission cuts",
        "subtitle":"\n              (Montel) The European Commission plans to earmark EUR 1bn from existing emissions trading system (ETS) revenues this year for a pilot auction scheme to fund projects which cut industrial emissions rapidly, it said on Wednesday.\n            ",
        "body":"\nThe pilot would prioritise projects offering the biggest emission reductions across sectors using any low-carbon or renewable energies, the EC said in its clean industrial deal strategy.\nThe measure was part of the EC’s efforts to help European industry remain competitive in the face of soaring energy costs while decarbonising to meet the bloc’s goal of having a net-zero emission economy by 2050.\nIt was not likely to affect the supply balance of ETS allowances in the market as it relied on existing auction revenues, consultancy ClearBlue Markets told Montel last week.\nAttracting investmentThe new funding facility was intended to complement the ETS carbon price in driving investment decisions and helping to bridge any gaps for both capital and operational spending, the EC said.\nIt was also preparing a steel and metals action plan for this spring to set out ways for this specific sector to remain competitive while cutting emissions. This sector is both energy intensive and currently relies heavily on gas for its processes, as well as being a key raw material for renewable energies such as wind turbines.\nBy the end of this year the EC plans to propose an Industrial Decarbonisation Accelerator Act. This would focus on reducing the administrative burden for energy-intensive companies wanting to cut their emissions, for example by simplifying the reporting required and streamlining the permits and approvals needed to switch to lower carbon processes.\nIn early 2026 the EC plans to present an electrification action plan and European grids package intended to help increase the share of low-carbon and renewable electricity in final energy demand.\nThis share has remained at 23% overall for the economy and around 33% in industry for almost the past decade, according to electricity lobby Eurelectric. \n",
        "datetime":"2025-02-26T10:38:43",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]