[
    {
        "title":"EDF to present new reactor plan using subsidies by year end",
        "subtitle":"\n              (Montel) State-owned EDF will present a plan to develop new generation nuclear power reactors by the end of the year with more details about timing and financing costs including subsidies.\n            ",
        "body":"\nThe presentation later this year follows a meeting of the country’s Council for Nuclear Policy on Monday, said the office of the French president, Emmanuel Macron.\nThe utility initially estimated that its plan to build six European pressurised reactors by 2050 would cost EUR 51.7bn (in 2020 euros), before raising the figure to EUR 67.4bn in June 2023.\nHowever, in January, France’s court of auditors warned that the cost of the reactors would “likely exceed EUR 100bn”, including financing costs.\nLast month, EDF CEO Luc Remont said the company would make a final investment decision for the six newbuilds by the second half of next year.\nFinancing with subsidiesThe Council also confirmed that France planned to subsidise the output of the new reactors via a contract for difference (CFD) that would “guarantee a maximum price of EUR 100\/MWh (in 2024 euros)”, said a statement from Macron’s office.\nFrance would offer EDF a reduced interest rate loan “covering at least half of the construction costs,” it added.\nThe government had “taken its inspiration” from the Czech Republic whose plans to support the construction and operation of a new 1.2 GW reactor via a 40-year CFD and a state loan to cover most of the construction cost were approved by the European Commission last April.\nFrance already has one operational EPR, the 1.6 GW unit 3 at the Flamanville power plant. However, it had cost overruns of billions of euros and was over a decade behind schedule when it launched last year.\nAdditional reporting by Elise Wu.\n",
        "datetime":"2025-03-18T08:40:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]