[
    {
        "title":"EDP halves green capacity buildout goal for 2026 – CEO",
        "subtitle":"\n              (Montel) Portuguese utility EDP expects to build 1.5 GW of renewables capacity in 2026, or 50% of the total initially earmarked, CEO Miguel Stilwell said late on Wednesday.\n            ",
        "body":"\nStilwell added that EDP planned to build 2 GW of green capacity globally in 2025, with 90% already under construction, during an analyst call late on Wednesday to present the 2024 results of its renewables subsidiary EDPR.\nBoth estimates were significantly below the firm’s 3 GW\/year goal for 2025-26. \nThe firm aimed at “moderating the pace of investment” in green assets, prioritising “returns over volume”, Stilwell said. Most of the growth will come from Europe and the US, he added.\nProfits downParent company EDP posted EUR 801m in net profits in 2024, a 16% drop on the year, due to EDPR’s exit from green projects in Colombia, the company said in its 2024 results report on Thursday. Earnings would have risen by 8% to EUR 1.4bn without that one-off, the company said.\nEDP’s renewables generation totalled 54.6 TWh in 2024, up by 12% on the year, with 95% of the firm’s total output coming from green sources.\nCombined with a 62% year-on-year decrease in thermal generation to 2.8 TWh, this led to a 64% reduction in EDP’s CO2 emissions, which reached an all-time low of 29 gCO2\/kWh, the firm said.\n",
        "datetime":"2025-02-27T09:29:11",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]