[
    {
        "title":"EIB to offer EUR 500m in guarantees for PPAs in EU pilot",
        "subtitle":"\n              (Montel) The European Investment Bank is set to offer EUR 500m in guarantees for long-term power purchase agreements (PPAs) in a pilot scheme with the European Commission this year.\n            ",
        "body":"\nThe exact amount would be confirmed later, and the goal was to reduce counterparty risk and so make PPAs accessible to more industrial consumers, the EC said in its affordable energy action plan released on Wednesday.\nThe EC said it would work with the EIB to promote PPAs, including cross-border options, in a “technology-neutral way”.\n“Effective” CFDsBy the end of this year, it would also give EU national governments guidance on how to design “effective” contracts for difference (CFDs), including how to combine them with PPAs.\nTwo-way CFDs involve governments agreeing to guarantee a particular price for output from a supported energy project developer. If the market price falls below this strike price, the government makes up the difference. If the market price exceeds it, the developer must pay the government the difference.\nPPAs are long-term commercial contracts between a producer and an end-user for agreed volumes and prices.\nThey provided a method to decouple electricity prices for end-users from high and volatile gas prices by offering long-term stability to both parties, the EC said.\nThe affordable energy action plan included eight approaches to lowering the EU’s prices as the bloc seeks to maintain its competitiveness while moving to a net-zero emission economy. \n",
        "datetime":"2025-02-26T14:50:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]