[
    {
        "title":"Engie trading arm profit plunges 33% to EUR 2.4bn in 2024",
        "subtitle":"\n              (Montel) Engie’s trading unit earnings before interest and taxes (Ebit) fell by a third to EUR 2.4bn last year as a “normalisation of the market” led to lower volatility than in 2023, the French utility said on Thursday.\n            ",
        "body":"\nHowever, slightly colder temperatures than the previous year in France resulted in EUR 28m higher gas sales for the trading, distribution and retail divisions altogether, the firm said in its full-year financial report.\nEnergy companies across Europe saw their trading earnings drop last year after exceptional results in 2023 in the wake of the 2022 European energy price crisis caused by the Russian war in Ukraine and record-low French nuclear output.\nThe trading arm’s lower results impacted Engie’s overall Ebit excluding nuclear, which was down 5.6% year on year to EUR 8.9bn, although this effect was “partly offset” by the renewables, networks and retail operation, the firm said.\nDespite “reduced volatility and lower energy prices,” Engie raised its target for its Ebit excluding nuclear to EUR 8.0-9.0bn this year, from EUR 7.9-8.9bn previously, with estimates of EUR 8.2-9.2bn next year and EUR 9-10bn in 2027.\nNuclear and renewablesThe group’s Ebit including nuclear rose 3% last year to EUR 10.3bn, thanks to a more than doubling of the nuclear branch’s earnings to EUR 1.4bn.\nMeanwhile, the company posted a 7% Ebit increase for its renewable energy segment to EUR 2.2bn amid “exceptional” weather conditions in France and Portugal as well as 4.2 GW of new capacity across the world to 46 GW.\nThe utility now targeted 95 GW of installed renewable and battery storage capacity by 2030, compared to 90 GW previously, so 80 GW of renewables, 10 GW of battery storage capacity and 5 GW of either or both. It said it would invest up to EUR 18bn in renewables, battery storage and power grids in 2025-27.\nConversely, the Ebit of the flexible generation unit – mainly gas-fired plants, hydropower and batteries – dropped 3% to EUR 1.5bn, mainly due to the impact of the windfall profit tax in France and lower use of gas-fired plants in Europe.\nThe Ebit of gas distribution division grew by 15% to EUR 2.5bn, driven by tariff increases for gas networks in France and Romania, Engie said. This was partially offset by reduced gas exports from France to Germany and lower storage profits amid lower volatility on the wholesale markets, it added.\nUpdates story published at 09:02 CET with more results.\n",
        "datetime":"2025-02-27T09:12:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]