[
    {
        "title":"Epex Spot boosts GO auction offering to meet demand",
        "subtitle":"\n              (Montel) The European Power Exchange (Epex Spot) has increased its monthly auction offering for guarantees of origin (GOs) in order to meet demand, it said in a statement on Tuesday.\n            ",
        "body":"\nTwo auctions took place in February in which certificates for more than 300 GWh were traded by 70 registered participants, it added.\nMore than 10 TWh has been sold at the marketplace for GOs since its launch in September 2022, making it the biggest multilateral spot market for trading GOs in Europe, the exchange said.\nLast year, Epex Spot added renewable thermal biomass and nuclear GOs to the auction.\nThe bi-monthly auctions are expected to boost liquidity and yield competitive market signals, market participants said.\n“We are always committed to develop the market design, support the energy transition and to respond to the market’s needs,” said Emine Duygu Sisman, head of environmental markets at Epex Spot.\n“The growing participation and attractive pricing conditions demonstrate the increasing demand for certified green energy across Europe,” she said.\n",
        "datetime":"2025-03-11T10:29:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GOS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]