[
    {
        "title":"EU countries mull more flexible gas storage deadline",
        "subtitle":"\n              (Montel) EU member states are considering changing the deadline to fill gas stocks to 90% of capacity from 1 November to any time from 1 October to 1 December, according to a document from the EU Council. \n            ",
        "body":"\nThe document released late on Friday is the first draft response from the council to the European Commission’s proposal earlier this month to extend its gas storage regulation by another two years until the end of 2027.  \nUnder the EC’s proposal, the mandatory target to fill underground storage to 90% of capacity by 1 November would be maintained for both 2026 and 2027. This would come with the usual intermediary targets that would be non-binding for the months leading up to 1 November. \nThe EC also recommended member states introduce flexibility measures during the refilling months leading up to winter, including in 2025. This was to address concerns that the rules had distorted the market by pushing summer gas prices significantly above their winter counterparts. \nIntermediary targetsThe council’s draft response amended the EC’s proposal by placing more focus on meeting the 90% filling target than on intermediary targets. \nThe document said member states “shall take the necessary measures to meet the filling targets and enforce upon market participants the storage obligations, which are required to meet them, including by imposing sufficiently deterrent sanctions and fines on those market participants”. \nIt also recommended moving the deadline for member states to inform the EC that they cannot meet the 90% filling target from 1 November to 1 December.   \nThe Polish presidency of the EU aims to move as swiftly as possible on the EC’s proposal, with the hope of reaching an informal agreement with the European Parliament by the end of June, a diplomatic source told Montel on Friday. The aim was to “send signals to the market” and “stabilise prices on this market”, he said.\nThe council and the parliament must agree on a common text for the proposal before it can become binding.\nSwift action neededAt a meeting of the EU Council on Monday, Italian energy minister Gilberto Pichetto Fratin stressed the importance of swift action in revising the storage regulation “to ensure greater flexibility in filling obligations and prevent speculation that widens the spread between winter and summer prices”.\nIn February, Italy issued a decree to advance gas storage auctions, offering 5bcm of capacity to accelerate stock replenishment ahead of the filling season for winter 2025-26 and optimise the summer-winter price spread.\nTSO Snam held four auctions over the past month to encourage gas stock filling but they have been largely unsuccessful as European summer-winter gas price spreads remain inverted, providing no incentive to book storage capacity.\nThe Summer 2025 contract at the Dutch TTF hub was last seen trading at EUR 41.44\/MWh, while next winter’s contract was seen at EUR 39.37\/MWh on Ice Endex.\nUpdates published article to include new comments from Gilberto Pichetto Fratin.\n",
        "datetime":"2025-03-17T10:28:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]