[
    {
        "title":"EU defence plan should include energy infrastructure – Italy",
        "subtitle":"\n              (Montel) The EU’s ReArm Europe plan should include funding for the protection of strategic energy infrastructure, Italy’s deputy energy minister Vannia Gava said on Tuesday.\n            ",
        "body":"\nThe European Commission earlier today unveiled the plan in a letter to member states. It comprises a set of proposals aimed at increasing defence expenditure among EU nations to enhance the continent’s defence capabilities and support Ukraine.\n“Any defence investments should also focus on the security of strategic energy infrastructure,” Gava said in a statement, adding that gas and oil pipelines in the Mediterranean, along with undersea cables, LNG terminals and power grids, were essential for the energy supply and economic stability of both Italy and Europe.\nHowever, this infrastructure was increasingly exposed to threats, including cyberattacks, Gava said.\nIf the protection of energy infrastructure was not prioritised, both national and European systems could be exposed to significant risks, potentially impacting citizens and businesses, she added.\nUp to EUR 800bn“ReArm Europe could mobilise close to EUR 800bn for a safe and resilient Europe,” said EC president Ursula von der Leyen in a statement. “This is a moment for Europe. And we are ready to step up.”\nThe plan also includes EUR 150bn in loans for defence investments, the EC said.\nOn Thursday, EU leaders will meet in Brussels for an extraordinary summit dedicated to defence and Ukraine.\n",
        "datetime":"2025-03-04T15:24:38",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]