[
    {
        "title":"EU energy prices could fall by year’s end on new supply – Acer",
        "subtitle":"\n              (Montel) EU gas and electricity prices are expected to fall within two years and possibly by the end of 2025 as supply and demand fundamentals change, EU energy regulatory agency Acer said on Monday.\n            ",
        "body":"\n“New global LNG supply, growth in renewables capacity and potentially new forms of electricity demand and supply flexibility” were expected to lower energy prices and help the EU improve its global industrial competitiveness, Acer said in its latest annual market monitoring report.\nHowever, the immediate outlook for global gas market supplies was tight, and lower EU storage levels coming out of this winter implied higher demand for injecting gas into storage before next winter. These conditions could keep European gas prices high throughout this summer, it said.\nEnergy remained significantly more expensive for Europeans than for Americans in 2024, Acer said. This was despite European prices falling to their lowest level since 2021, the year before Russian pipeline gas imports dropped dramatically because of the war in Ukraine.\nWholesale day-ahead power prices for the 27 EU countries plus Norway averaged EUR 81\/MWh in 2024, down 16% on the year before, but still nearly twice as high as average US prices, Acer said.\nMeanwhile, European benchmark Dutch TTF gas hub prices averaged EUR 34\/MWh in 2024, down 17% on the year but still around five times the equivalent US benchmark Henry Hub average.\nLower pricesBringing down high electricity prices would require expanding cheap renewable generation capacity and reducing demand peaks and price spikes through more flexibility, market integration and resource sharing, Acer said.\nMeanwhile, the best way to reduce gas prices in the long term was to switch from gas to electricity, it said.\nGas accounted for 13% (341 TWh) of EU electricity production in 2024, and Europe was still “significantly reliant” on imported oil and gas, Acer said.\nThe EU stopped importing around 15bcm\/year of Russian gas via Ukraine at the end of 2024 when the gas transit agreement with Gazprom expired, which contributed to the current tight gas market conditions.\nThere was enough import and transport infrastructure capacity to replace these volumes with LNG, said Acer. However, reaching affected markets in Austria and Slovakia, for example, would involve higher cross-border transport costs.\nAcer director Christian Zinglersen will present the report to EU energy ministers in Brussels later on Monday, after they have discussed the European Commission’s affordable energy action plan. This plan is intended to help lower prices for industry and households while continuing to decarbonise the economy.\nAcer also plans to report on the dynamics of the global LNG market in May. \n",
        "datetime":"2025-03-17T08:26:27",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]