[
    {
        "title":"EU imports of Russian gas rise 11% in February",
        "subtitle":"\n              (Montel) European imports of Russian pipeline gas and LNG rose by 11% in February, amid an upturn in regional demand and efforts to supply the beleaguered Moldovan breakaway region of Transnistria, industry data showed on Wednesday.\n            ",
        "body":"\nEU-27 countries imported an estimated 126mcm\/day of gas from Russia last month, up by around 12mcm\/day from January.\nIt received 52.1mcm\/day of gas via Russia’s last remaining pipeline to the continent – the TurkStream route to southeast Europe – which was a monthly increase of 10.4%, according to data published by European gas TSO group Entso-G.\nExports via the Sudzha crossing between Russia and Ukraine – which averaged a little over 40mcm\/day last year – remained at zero following the expiry of Gazprom’s five-year transit deal at the beginning of the year.\n“It seems like TurkStream is now at [full] capacity and most of the additional flows could be going to Transnistria, which lost Russian flows via Ukraine from January due to “debts”,” said Yuriy Onyshkiv, a Kyiv-based senior gas analyst at LSEG.\nIn late January, Moldovan gas operator Moldovagaz signed a deal to lend 3mcm of natural gas to the breakaway Transnistria region to help it cope with the energy crisis after the halt of Russian gas supplies, Montel reported.\nDemand increase“Also, there was some uptick across the Balkans, amid a tad higher demand in February versus January,” Onyshkiv said, noting Hungary and Slovakia did not appear to have taken more gas via the route last month.\n“Spiking regional prices appear to be behind the additional flow, driven by cold temperatures, low storage, demand in Moldova and some outflow to Ukraine,” said Rystad Energy analyst Christoph Halser.\nAt the same time, European imports of Russian LNG rose by 10.7% from the previous month to 74.3mcm\/day, according to ship-tracking data from consultancy Kpler.\nFrance was the largest importer of Russian LNG, with deliveries accounting for 48% of the total, or 34mcm\/day, followed Belgium with 21mcm\/day and Spain and the Netherlands, both with 7mcm\/day.\nAt the end of this month, the EU will ban reloading services for Russian LNG in EU territory to send to other regions, under sanctions imposed in response to Russia’s invasion of Ukraine.\n",
        "datetime":"2025-03-05T10:07:13",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]