[
    {
        "title":"EU must boost energy security amid LNG shortfall – IEA",
        "subtitle":"\n              (Montel) European governments must “work harder than ever” to increase the continent’s energy security over the next two years amid the prospect of a tight global gas market, according to the International Energy Agency (IEA).\n            ",
        "body":"\n“European energy systems face a challenging year ahead as the continent emerges from this winter with lower-than-average levels of gas in storage,” the Paris-based agency said on Sunday.\nIt said options included signing long-term contracts “to provide more stable supplies and strengthening the transatlantic partnership on LNG trade”.\nEU gas storage was last seen just below 41% full, 23.1 percentage points lower on the year, according to Gas Infrastructure Europe.\nThe IEA said global gas markets were unlikely to loosen up until well into 2026 when a “huge wave of new LNG supply” would begin to hit international markets.\nGas remained “essential” for the continent’s energy security, despite “clear signs of structural [demand] decline”, it said. Last year marked the fifth consecutive year of annual declines in European gas demand, with an 8% fall from 2023.\nHowever, waiting for new planned LNG capacities was “not a viable strategy” for European economies, the IEA warned, with new projects in the US and Qatar set to come online gradually from 2026.\nMore gas requiredInstead, the EU needed to implement additional measures to strengthen energy security and to pay “particular attention” to gas supply resilience, according to the agency.\nAlthough it expected global LNG supply to rise 5% this year compared to 1.5% in 2024, meeting EU gas storage targets before next winter would require “much bigger inflows of gas than in the two previous years”.\nSince Russia’s 2022 invasion of Ukraine, the EU has rolled out measures to tame volatile energy prices and protect consumers, including gas storage obligations and joint gas purchasing.\n“We will have a heated summer, with fierce competition for every drop of LNG,” Greg Molnar, an IEA gas analyst who co-authored the comment, said on LinkedIn.\nEarlier this month, he told Montel that Europe could require around 45% more gas this summer to meet injection targets.\nEurope’s benchmark front-month TTF gas contract last traded down by EUR 1.81 at EUR 45.39\/MWh on Ice Endex. Earlier, it fell to EUR 45.21\/MWh, its lowest on a rolling basis since 10 January. \n",
        "datetime":"2025-02-24T11:48:27",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]