[
    {
        "title":"EU set to miss 2030 wind capacity target – lobby",
        "subtitle":"\n              (Montel) The EU will fall well short of its target of increasing wind capacity across the bloc to 425 GW by the end of the decade after it installed only 12.9 GW last year, less than half the required amount, lobby WindEurope said on Thursday.\n            ",
        "body":"\nTo reach the 2030 target, the EU needed to add 36 GW on average per year from 2025 to 2030, the lobby said in an annual report and five-year outlook.\nYet the region was set to add 23 GW a year on average and only 17 .5 GW this year, according to the lobby’s forecasts.\nThe lack of new capacity in 2024 was due to grid bottlenecks, permit issues and challenging financial conditions, it said.\nBottlenecksThe report said that “grids are now the biggest bottleneck to deploying wind energy at scale”, and urged countries to invest in strengthening their grids .\nIt also said that a move away from the “first come, first served approach to managing connection queues” was urgently needed.\nGermany commissioned the most capacity last year, adding 4 GW, of which around 80% was onshore. The UK and France added 1.9 GW and 1.7 GW, respectively.\nWindEurope’s bleak outlook for 2030 came despite EU governments having awarded a record 36.6 GW of new wind capacity across 12 countries last year.\nThe EU had 231 GW of installed wind capacity at the end of 2024, 210 GW of which was onshore.\nUnder the REPowerEU plan, the bloc is aiming to cover 42.5% of its final energy consumption with renewables by 2030. Wind’s portion of this targeted green contribution would be 425 GW, according to the lobby’s calculations.\nLast year, wind farms in the EU generated 475 TWh, covering 19% of the bloc’s total electricity demand.\n",
        "datetime":"2025-02-27T05:00:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]