[
    {
        "title":"EU to compete for “every drop of LNG” this summer – IEA",
        "subtitle":"\n              (Montel) European LNG demand over the summer will outstrip global production growth, leading to intense competition for the fuel, an International Energy Agency (IEA) gas analyst said on Tuesday.\n            ",
        "body":"\nThe region would need around 25bcm more LNG between April and October than last year, Gergerly Molnar added in a post on LinkedIn, with the additional volume required to rebuild the EU’s depleted storage facilities and hit the 90% fill target by 1 November.  \n“This is more than the expected increase in global LNG supply over this period, indicating that the summer market could be rather tight, with strong competition for every drop of LNG,” he added.\nLast month, the IEA had forecast a 21bcm year-on-year increase in European LNG imports across the whole of 2024.\nHowever, with EU gas storage levels currently below 41% full, Europe would need to inject 20bcm extra to reach its target, Molnar said.\nAdditionally, piped imports of natural gas were set to decrease over the period, with 8bcm less coming through Ukraine and Norwegian supply 3bcm down, he added, while UK gas production would fall 10%.\nMeanwhile, EU gas exports to Ukraine were set to jump this summer, with storage there at historical lows.\nEuropean price premiumLNG market tightness was already being priced in, with European gas hubs offering a premium to Asian equivalents for the remainder of the year, according to Spark Commodities data, with the EU having competed with Asia for the chilled fuel to substitute for a lack of Russia gas flows since the start of the Ukraine war.\nHowever, the premium had narrowed this week to its lowest at around USD 0.15\/MMbtu as European prices continued to fall, while Asia’s were increasing.\nThe EU’s LNG imports had already jumped this year, with January and February deliveries 10% higher than in 2023, according to Kpler data.\n",
        "datetime":"2025-02-25T12:39:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]