[
    {
        "title":"EU won’t “shoot itself in foot” with US LNG tariffs",
        "subtitle":"\n              (Montel) The EU was likely to avoid imposing tariffs on US LNG in retaliation for president Donald Trump’s looming trade war, as the chilled fuel remained crucial for the bloc, analysts told Montel’s bi-monthly Spanish podcast.\n            ",
        "body":"\nAny response involving EU tariffs on US LNG “would be like shooting itself in the foot”, Paula Di Mattia, analyst for European gas at Icis, told Energia al Dia, with her comments coming amid Washington’s threat of tariffs to bridge an estimated USD 236bn trade deficit with the bloc.\n“That [EU retaliation] is not going to happen, especially given Europe’s position, which is so dependent on LNG and especially on American LNG,” she added, with Trump calling on the EU to take even more US LNG to tackle its deficit.\nBefore the invasion of Ukraine in 2022, Europe relied on Russian gas to cover around 40% of its demand but it has been diversifying its supply and has become heavily reliant on the likes of US LNG.\nIndustry strugglesIgnacio Urbasos, a researcher at Spain’s think tank Elcano, also ruled out potential tariffs on US LNG, telling the podcast that industry was already struggling with high energy prices.\nEurope could see, in turn, an increase in imports to “appease” the new Trump administration.\nHowever, energy cooperation between the US and the EU to phase out Russian energy seemed to have foundered with the end of president Joe Biden’s term, he added.\n“For many European capitals, what was once a secure supply has changed its profile and now shows greater [geopolitical] risks.”\nCountries could seek alternative LNG sources, such as Qatar, which still had a “large part” of its new production capacity uncontracted, with it due to come online later this decade, Urbasos said.\n“Delicate situation”Yet, it all came against the backdrop of a “delicate” supply situation in Europe, with storage levels just above 40%, said Icis’s Di Mattia.\nIt also meant Europe “is not in a position to sanction Russian LNG”, as its energy security was currently “insufficient”, she added, in reference to ongoing talks to extend sanctions to the chilled fuel amid the Ukraine war.\n",
        "datetime":"2025-02-26T14:07:45",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]