[
    {
        "title":"EUR 150-MWh could trigger German reserve usage – politician",
        "subtitle":"\n              (Montel) German day-ahead prices of EUR 150\/MWh could be the trigger for calling up reserve capacity to the market under plans being mulled by the likely next government, a conservative politician told Montel on Wednesday.\n            ",
        "body":"\nThe plan – laid out in exploratory talks that could lead to a new government headed by the centre-right Christian Democrats (CDU) and the centre-left Social Democrats – would see coal-fired power plants that recently entered the reserves return to the market to boost supply and reduce price spikes.\n“Concretely, the proposal calls for reserve capacity to be activated when the day-ahead market price rises above a set level for multiple hours,” Andreas Lenz of the Christian Social Union in Bavaria, a sister party to the CDU, told Montel.\nHe named EUR 150\/MWh as a possible “situation of extreme price spikes” at which the reserves could be activated to stabilise the market.\nHowever, he also noted that returning the power plants to the market would not be possible without some effort under current law.\nExpensive to operateEnergy experts have shown scepticism since the plan was dropped at the weekend, noting that many of the reserve plants in question recently left the market because they were unprofitable. Because they are expensive to operate, they are some of the last plants that would be turned on in times of high need and might only lower prices by around 3-6% in 2025-2027, the experts noted.\nBut Lenz notes that the extra capacity could have made a difference in recent cases where day-ahead prices spiked into the EUR 900-1,000\/MWh zone.\nSo far this year, the average day-ahead price traded at or above the threshold of EUR 150\/MWh on 10 days. Overall, 314 hours have been affected.\n",
        "datetime":"2025-03-12T13:39:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]