[
    {
        "title":"Europe’s daily power price volatility falls in 2024 – Acer",
        "subtitle":"\n              (Montel) European within-day power prices varied by more than EUR 50\/MWh on 70% of days in 2024, down from 77% of days in 2023 and 88% in 2022, EU energy regulatory agency Acer said on Monday.\n            ",
        "body":"\nHowever, the volatility level for the 27 EU countries plus Norway was still seven times the 10% of days recorded in 2020 and 2019, Acer said. The volatility was driven by gas price fluctuations and variations in renewable energy output.\nCoal and gas-fired power generation was still essential for meeting peak demand in 2024, but the role of gas as the marginal power price setter was slowly declining as the share of renewables generation increased, it said.\nAcer calculated that electricity day-ahead prices were above gas-fired power generation costs for 39.5% of hours in 2024, down only slightly from 40.1% of hours in 2023 but well below the 72.1% of hours in 2020.\nPower-gas correlation weakensAcer said the overall correlation between day-ahead electricity and gas prices weakened during the two years between 2022 and 2024 in 10 selected EU countries as the share of renewable energy grew.  \nMonth-ahead prices, however, generally remained strongly correlated over the same period in the 10 countries, showing the continued importance of gas in forward electricity prices, it said.  \nThe 10 countries selected were Austria, Belgium, Czechia, France, Germany, Hungary, Italy, the Netherlands, Poland and Spain.\nOverall, Acer found that countries with more low-carbon and renewable electricity capacity, plus less industrial activity, had lower correlations between gas and electricity prices.\nReducing the role of gas in power markets further would involve finding other ways to meet or manage peak power demand and seasonal balancing requirements, it said.\nDecoupling end-user electricity prices from gas prices and reducing power price volatility are key energy policy priorities for the European Commission. \n",
        "datetime":"2025-03-17T10:44:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]