[
    {
        "title":"Evolving geopolitics may lead Germany to back French nuclear",
        "subtitle":"\n              (Montel) Germany’s evolving stance on atomic energy combined with a US-induced geopolitical shift is likely to pave the way for greater EU support for France’s nuclear power ambitions, analysts told Montel.\n            ",
        "body":"\n“The change in the geopolitical situation and Germany’s election are consolidating the Franco-German relationship, which had taken a bit of a beating,” said Olga Givernet, an MP with French president Emmanuel Macron’s centrist Renaissance party and former energy minister.\nShe was referring to the pro-nuclear stance of Germany’s likely future chancellor, Friedrich Merz, after last month’s election, as well as Europe’s new focus on defence amid US president Donald Trump’s chaotic return to power. \n“We hope to converge more on energy policies and see more flexibility regarding nuclear power,” she added, regarding Germany’s long-standing opposition to nuclear.\nFrance would try to capitalise on the geopolitical shift to intensify its nuclear diplomacy in Europe, which it has pursued in the Nuclear Alliance, a coalition of 14 pro-nuclear EU countries, said Yves Marignac, spokesman for think tank NegaWatt.\nGermany softens The country has long pushed for nuclear power to be recognised alongside renewables in EU climate objectives and for it to be eligible for similar subsidies. But these demands have met strong opposition from Germany, which closed its last reactors in 2023, and others in Europe, including Luxembourg, Austria and Ireland.\nThe new German government would “likely take a much more neutral stance on French nuclear than the last one,” said Christoph Maurer, managing director of German consulting firm Consentec. \n“They might even agree on some kind of technology-neutral EU funding mechanism for decarbonised energy, which could cover nuclear.”\nGerman fears that Trump might “weaponise” US LNG exports as part of his trade war could weaken resistance to nuclear power, Maurer said. “Relying on a European energy source might be seen more favourably than it was even just a few weeks ago.”\nGermany’s stance on nuclear power had already softened since Russia’s invasion of Ukraine, Maurer said. Before the war, it relied on Russia for 55% of its gas imports.\nA key shift occurred in 2022 when Germany accepted nuclear being classified as a “green” investment under certain conditions in the EU’s taxonomy framework.\nContentious fundingMore recently, the EU has included nuclear in its state aid framework. While the proposed rules prioritise green hydrogen over low-carbon hydrogen for subsidies, nuclear – initially absent from the draft – was added to the final version. \nHowever, nuclear funding remained contentious, with the European Investment Bank (EIB) still prioritising renewables over nuclear in its climate strategy, said Teva Meyer, lecturer in geopolitics at France’s University of Haute-Alsace.\nA Franco-German reconciliation on nuclear energy depended on the country’s ongoing coalition negotiations to form a government, Meyer said, while Luxembourg and Austria could block pro-nuclear decisions if unanimity was required.\n",
        "datetime":"2025-03-13T11:56:43",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]