[
    {
        "title":"Experts split on new EU rules’ impact on sustainability, GOs",
        "subtitle":"\n              (Montel) The European Commission’s latest set of regulatory proposals has sparked mixed reactions among market experts regarding its potential impact on corporate sustainability and guarantees of origin (GOs).\n            ",
        "body":"\nUnder the Omnibus package, which aims to streamline sustainability reporting and reduce administrative burdens for EU corporations, many companies that were originally subject to the Corporate Sustainability Reporting Directive (CSRD) will no longer need to comply.\nThe package “could see the CSRD coverage reduced to 10,000 companies… just 20% of the original [number],” Mary Polovtseva, senior analyst at consultancy Veyt, told Montel. “Such regulatory backpedalling could transform the EU sustainability framework and lessen the bullish impact by potentially reducing the expected corporate GO demand.”\nWhen the regulation becomes effective, there could be “some [GO] forward contract price corrections to reflect a somewhat bearish sentiment, whereas current-year contracts could gain in liquidity ahead of the general disclosure deadline on 31 March”, she said.\nDeclining GO demandIn the long-term, this could reduce demand for GOs by eliminating the legislation-driven corporate demand that would have otherwise entered the market, Polovtseva added.\nMatteo Melotti, an energy expert at Italian consultancy Fedabo, told Montel the impact on GOs remains “marginal”, as the market is currently characterised by a structural surplus of certificates compared to current demand, further fuelled by the destruction of industrial demand and the year-on-year expansion of renewables.\n“More significant macro trends, such as widespread drought conditions or chronically disappointing wind energy performance, remain more impactful,” he said.\nMany companies that are not legally obliged to report may choose not to engage in sustainability disclosures, slowing overall adoption, Stella Volpini of Fedabo’s ESG team told Montel.\nMarket the main driverHowever, “we expect that companies which had already taken steps to comply with the CSRD will continue on this path, regardless of the Omnibus proposal,” Volpini said, adding that the main driver for decarbonisation remains the market, rather than the regulation.\nHans Petter Kildal, CEO of Norwegian consultancy Becour, said that despite the extension of compliance timelines for some companies, the EU proposals ease the administrative burden for many companies, which were “wasting resources on doing the paperwork”.\nHe also said he expected larger corporations to still demand sustainability data from their supply chains, indirectly pressuring smaller firms to continue reporting.\nKildal argued that GOs are becoming deeply embedded in corporate sustainability strategies, serving as a reliable tool for documenting renewable energy usage and emissions reductions.\n“GOs are like tectonic plates slowly moving under our feet into the way large corporations think, operate and report,” Kildal said. “At [the] current low prices, companies have no reason to opt out, as GOs are a convenient tool for documenting origin.”\n",
        "datetime":"2025-03-04T10:04:50",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GOS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]