[
    {
        "title":"Extending EU gas storage targets to spur volatility – lobby",
        "subtitle":"\n              (Montel) An extension of EU-wide gas storage targets to 2026 would result in increased price volatility, Energy Traders Europe warned on Monday, instead calling for an end to the regulation in December.\n            ",
        "body":"\n“The risk of further intervention… by member states in how they choose to apply obligations will deter commercial storage filling,” the traders’ lobby said.\nThis was in response to plans by the European Commission to extend its gas storage regulation in 2026, but with more flexible filling targets. \nSome member states had previously criticised the current filling targets for distorting the market by pushing summer gas prices significantly above winter prices.\nAccording to the existing rules, which expire at the end of the year, EU-wide storage must reach 90% of capacity by 1 November, with intermediary targets to be met in February, May, July and September. \nThe targets were introduced in 2022 as part the EU’s emergency measures in response to Russia’s full-scale invasion of Ukraine.\nMarket distortionEnergy Traders Europe said it was concerned about the “distortive nature” of the current rules, noting the continued emphasis on storage filling, rather than a broader approach to energy security, had contributed to a “concentration of activity in this area”.\n“Member states are trapped between having a very expensive form of security, or saving money but leaving storage underfilled,” said Doug Wood, chairman of the gas committee at Energy Traders Europe.\n“The most helpful action now would be to restore some calm by ruling out a possible extension of storage obligations to 2026 and beyond,” Wood said. \nA spokesperson for the German economy ministry told Montel earlier this month that it also supported “less rigid” storage level requirements.\n“The European Commission has indicated that it will address this issue,” the spokesperson added.\nNew EU gas storage rules could be agreed by June this year, Poland’s minister for industry, Marzena Czarnecka, who represents the EU presidency, said last week.\n",
        "datetime":"2025-02-24T13:32:25",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]