[
    {
        "title":"Fears “magical” 2030 demand target distorting German green build",
        "subtitle":"\n              (Montel) Germany’s projected power demand of 750 TWh\/year by 2030 has sparked questions about the need for revision, amid worries an overinflated figure could distort the country’s green capacity growth goals, experts told Montel. \n            ",
        "body":"\nThey agreed the demand figure – enshrined in law in terms of the nation’s renewables target, ie that 80% of power must come from renewables by the turn of the decade – was set to fall short of projections.\nYet the economics ministry told Montel there was a “broad basis of calculation” supporting the 750 TWh\/year figure, pointing to a series of studies that forecast a 643-886 TWh\/year range by 2030, averaging 753 TWh\/year.\nHowever, Thomas Heilmann, an outgoing lawmaker with the centre-right Christian Democrat (CDU) party, told an audience in January he thought the demand expectations were inflated.\nThis was due to the fact power prices had run much higher than normal over the last few years, restraining demand expectations into the future, he said.\nHigh power prices“The question of how high the power prices are has an effect on the question of how high the power demand will be,” said Heilmann, who is also the chairman of the Climate Union, a CDU group focused on climate goals, with the party set to be the largest in the new coalition government.\nHis office pointed to more recent studies that predicted power demand between 580-660 TWh\/year as “more realistic.”\nLukas Feldhaus of the Thema Consulting Group, meanwhile, said the government demand forecast had been overly optimistic, noting levels had barely budged in recent years.\n“We’ve always been told it hasn’t grown the last five years but now it’s going to start? And then it becomes, “it hasn’t grown the last six years and then the last seven years and so on”,” he told Montel.\n“Magical goal”“It’s always been that there’s this magical goal for 2030… and now the magical goal is actually way too near.”\nIt was interesting that the ongoing green transition had curbed demand in some ways, given more flexible use of energy and greater efficiency, added Feldhaus.\nThese effects might not have been factored in a few years ago, he added.\nNevertheless, having some kind of goal remained useful, “so you can lay out some form of capacity buildout and subsidy plan, otherwise no one is going to be ready to make an investment and expect it to pay off in 20 years”.\nGermany had plans to build up to 10 GW of gas-fired power plants to act as a bridge for growing green energy and also wanted a market for reserve units, but these goals had been in limbo since the governmental collapse late last year.\nGoal important?Wolf-Peter Schill, an energy economist with the German Institute for Economic Research, agreed that a goal was important.\n“I would stick to the absolute renewable expansion paths even if it leads to a slightly too high relative target in 2030. Over time, we need it.”\nFeldhaus was also unconcerned about the necessary impact of the 750 TWh\/year target since there would only have been a misallocation of resources “if we had managed to build all those planned renewables”.\nThere was general agreement the target would eventually be met, just not by 2030, he added.\n",
        "datetime":"2025-03-06T09:39:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]