[
    {
        "title":"Finnish cut to data centre subsidy risks investment – industry",
        "subtitle":"\n              (Montel) The Finnish government’s plan to abolish electricity tax breaks for data centres will damage investment and is proof of an “erratic tax policy”, according to power industry leaders.\n            ",
        "body":"\nThe move announced by finance minister Riikka Purra on Tuesday will remove the lower electricity tax rate of EUR 0.0006\/kWh from data centres, and they will move to the standard rate of EUR 0.0225\/kWh. She did not provide a timeline for when the change will come into effect.\nAround EUR 30m is allocated annually to data centres under this scheme, according to the ministry.\nThe scheme has helped attract IT giants like Microsoft and Google to set up data centres in Finland. British trading firm XTX Markets is planning a data centre in Kajaani by 2026 and Canadian company Bitzero has announced a 500 MW project in Kokemaki.\nBacklashRemoving the incentive would send a negative signal to energy-intensive industries, Joona Turtiainen, director at power industry lobby group Finnish Energy, told Montel.\nHe noted that data centres were moved to the lower tax category to spur investments and the reversal was announced without any prior consultation.\n“The European Commission recently recommended lowering electricity tax rates to the EU minimum to boost competitiveness. Calling the industrial tax rate a subsidy is misleading – it aligns with competing economies,” Turtiainen added.\nData centres also contribute to grid stability through demand response and increasingly supply clean district heating, he said, adding that weakening this could lead to higher heating costs for Finnish consumers.\nSampo Saarinen, business analyst at utility Fortum, said on LinkedIn that the cut was an example of “erratic tax policy” that could undermine the credibility of similar tax incentives in the future.\nGrid strain concernsHowever, former Fingrid CEO Jukka Ruusunen welcomed the ministry’s decision, telling Finnish publication Helsingin Sanomat on Wednesday that there was no justification for the lower tax rate.\nFinnish TSO Fingrid expects the country’s electricity consumption to double over the next decade, with data centres and industry driving 101 TWh of additional demand, according to its latest forecast.\nHowever, demand has already risen faster than expected, putting pressure on the grid in southern Finland. As a result, Fingrid said in January it would restrict new grid connections in some areas up to 2027 until additional transmission capacity is completed.\nFinland’s decision follows a wider trend of increasing scrutiny in Europe on data centre energy use. Ireland imposed a temporary moratorium on new data centres in Dublin due to grid congestion concerns, while Sweden abolished its tax incentives for data centres in 2023.\n",
        "datetime":"2025-03-05T15:10:36",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CONSUMPTION\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]