[
    {
        "title":"Finnish-Baltic gas demand to stagnate in 2025 – traders",
        "subtitle":"\n              (Montel) The strong rebound in Baltic-Finnish gas demand seen over the past two years will probably come to a halt this year, market participants have told Montel.\n            ",
        "body":"\n“Uncertainty in the global economy combined with still relatively high gas prices will have a negative impact on demand from the industrial sector,” Jouni Liimatta, head of trading at Finnish energy company Gasum, told Montel.\nLast year, gas consumption in Lithuania, Latvia, Estonia and Finland grew by 8.5% to 44 TWh, with Lithuania seeing the largest hike of 13% to 17 TWh.\nHowever, it remains well below the 67 TWh consumed in the Finnish-Baltic market in 2021, before Russia’s invasion of Ukraine led to a surge in European gas prices and the cessation of Russian pipeline imports to Finland and the three Baltic states. \nRising renewablesLiimatta said he did not expect consumption to return to its pre-war levels in the coming years.\n“The growing use of renewable energy sources [and of] new electric boilers, for example in industry and heat generation, will drive gas demand lower,” he said.\nMagnus Truupold, power and gas trader at Estonian energy group Alexela, agreed that uncertainty in the markets and increasing renewables output are denting gas demand.\n“I wouldn’t predict a big, or maybe any, increase at all,” he said.\nThe Russian invasion of Ukraine saw the continent’s benchmark TTF front-month contract peak at EUR 342\/MWh in 2022, leading to a drop in demand. The contract was last seen trading at just above EUR 40\/MWh, which is still high from a historical perspective.\nGas prices in the Finnish-Baltic region are trading close to TTF levels, with all of the region’s imports now coming via LNG into Lithuania or Finland.\n",
        "datetime":"2025-03-17T12:49:09",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]