[
    {
        "title":"Gas storage rules face “delicate” EU parliament talks – MEP",
        "subtitle":"\n              (Montel) The European Commission’s proposal to extend binding EU gas storage filling targets by two years until the end of 2027 will prompt “a delicate discussion” in the European Parliament, according to a senior MEP.\n            ",
        "body":"\nThe EU targets were strategic given the geopolitical situation, German centre-right European People’s Party (EPP) member Christian Ehler told reporters ahead of a competitiveness event in the parliament on Wednesday evening.\nBut Germany, for example, had been buying up gas at all costs to meet its target, with dramatic price impacts, he said.\n“So, we have to take a closer look at… the interaction between prices and the storage obligations,” said Ehler, who is the EPP’s spokesman on energy, industry and research.\nBoth the parliament and the EU Council of ministers, representing national governments, must agree on a common text for the proposal before it can become law.\nThe EPP, the parliament’s largest political group, was in principle “very sceptical about substantial market or price interventions”, he said.\nEnergy prices would come down when the EU increased investment in renewables and infrastructure and created clear business cases for decarbonisation projects, he said, adding that policymakers should focus on that.\nPermanent optionThe EC said it wanted to extend the temporary storage filling targets by two years while it reviews the EU’s overall energy security rules, including whether to propose making the targets permanent. It has not proposed any other changes to the current gas storage rules.\nThe EC originally proposed a binding annual target for EU gas storage facilities to be at least 80% full by 1 November in 2022, and at least 90% full by the same deadline for the following three years. \nThe rules included non-binding intermediary targets for February, May, July and September, which the EC updates each year based on information provided by national governments.\nThe emergency, temporary legislation was intended to safeguard the bloc’s winter gas supplies in the wake of Russian pipeline gas imports dropping dramatically after Moscow’s invasion of Ukraine in 2022.\nThe parliament and the EU council reached an informal agreement on the EC’s original proposal in March 2022 in less than two months, when such processes normally take more than a year. This was to ensure the rules were known during the summer filling season ahead of the first binding target.\nThe current rules are due to expire on 31 December, implying the parliament and council must reach an agreement on the extension before then. \n",
        "datetime":"2025-03-06T08:28:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]