[
    {
        "title":"GAS – Prices flat on market jitters ahead of US-Russia talks",
        "subtitle":"\n              (Montel) Benchmark European gas contracts traded flat on Tuesday with the market cautious ahead of a call between Washington and Moscow this afternoon, mulling what the outcome could mean for Russian gas and LNG flows.\n            ",
        "body":"\nThe April contract on the Dutch TTF hub last traded down EUR 0.18 at EUR 41.07\/MWh on Ice Endex, while the UK equivalent was 0.99p lower at 99.95p\/th.\nThe “number one” price driver at the moment was the expected call between US president Donald Trump and Russian counterpart Vladimir Putin, said Kalvi Nou, portfolio manager at Estonian energy group Alexela.\nEasing sanctions?“There seems to be at least some sort of an assumption in the market that there will be some lifting of sanctions in case of a ceasefire in Ukraine.”\nThe EU has sanctioned Russian LNG infrastructure, while gas transit flows via Ukraine – amounting to around 40mcm\/day – have been curtailed since the start of the year as a deal with Moscow expired.\nWhile the market hoped for a positive outcome, Trump warned of further sanctions on Russia if no peace deal to end the Ukraine war was reached, which could send gas prices soaring, Nou said.\n“From a fundamental point of view, Europe is still very short of gas this year. In case there are negative scenarios for the ceasefire talks, I think there is a bullish impact there.”\nInventory concernsEuropean inventories were last pegged at 34.8% full, around 25 percentage points less than the same time last year, Gas Infrastructure Europe data showed.\n“With or without some extra Russian flows Europe has a tough job to fill the inventory target this year,” Nou said, with it set at 90% full by 1 November.\nOn the weather front, temperatures were currently around 2-3C below normal across Europe but were set to rise significantly by the end of the week, reaching 3-6C above average, Montel Analytics data showed.\n“The weather forecast is looking pretty mild in the next two weeks and no anticipation really that any big cold front coming at this point in time. So [the winter] premium is gone,” Nou said.\nNorwegian exports to the rest of Europe were last seen at down 17.7mcm from yesterday at 311.8mcm\/day.\n",
        "datetime":"2025-03-18T11:07:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]