[
    {
        "title":"Germany may face liquidity imbalance with power zone split",
        "subtitle":"\n              (Montel) Splitting Germany into two or more power price zones could create a liquidity imbalance as evidenced by the separation of Austria from the German market in 2018, analysts have warned.\n            ",
        "body":"\nThe joint Austria-Germany price zone, which also included Luxembourg, officially separated in October 2018 to help alleviate grid bottlenecks.\nBut since the split, Austria, as a smaller zone, has lacked the previously available liquidity – which has not recovered to this day.\n“Austria is the best example of why we shouldn’t do this,” said Matthias Stark, head of the renewable energy systems department at the German Renewable Energy Federation (BEE). “The Austrian futures market has practically come to a standstill.”\nFor example, last year’s power futures trading volume of 5,850 TWh in Germany eclipsed the 38.5 TWh traded in Austria, EEX exchange data showed.\nGermany split?The association of European transmission system operators, Entso-E, plans to publish the results of a Europe-wide bidding zone review this spring at the behest of the European regulatory agency Acer.\nGermany is subject to the Bidding Zone Review because current limitations of its grid infrastructure means it struggles to transfer electricity generated by a massive fleet of wind turbines in the north to the consumption-heavy south.\nGermany is adding more north-south interconnections. But bottlenecks continue to occur for neighbouring countries on days of robust wind power generation, with power looping out of the country in the north and returning in the south.\nOne of five possible splitting options proposed by Acer is along the bottlenecks between northern and southern Germany.\nHowever, BEE’s Stark warned that splitting Germany could create problems for utilities and energy-intensive companies looking to hedge their forward positions against sharp price fluctuations in the day-ahead market as seen during the covid pandemic and the energy crisis.\n“If price zones were introduced in Germany now, and problems also arose in the futures market here, how would price hedging for the economy work in the future?”\nHe pointed out that since the split in 2018, hedging in Austria “largely happens based on the German futures market”.\nHe said a split also unsettled potential investors in renewables, because they cannot be sure whether their planned projects would still be in the same price zone and thus under the assumed economic conditions after completion.\nLiquidity lackingAustrian traders recently told Montel that liquidity has not recovered to a satisfactory level even after more than six years.\n“Liquidity is still not as we would like it to be,” said a power trader in Austria. “If the German market is split, this should mainly affect long-term products,” he added.\nCurrently, in Austria, companies orient themselves towards the German market due to the low liquidity and also hedge through Germany, he said.\n“It seems that many still rely on the German contract on the exchange because the Austrian market is too small,” the trader said.\nNevertheless, data from the electricity exchange EEX showed that volumes in Austrian futures products continue to rise following the split, albeit still dwarfed by the German market, said spokeswoman Eileen Hieke.\nShe said Austria power trading volumes have grown 155% since 2019, compared to growth of 125% in Germany. Recently, however, volumes in Austria increased by 36% from 2023 to 2024, below the 60% increase seen in Germany.\nLast year, the EEX warned against splitting the German price zone.\n",
        "datetime":"2025-03-04T12:38:21",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]