[
    {
        "title":"Germany’s rightward shift to slow energy transition – analysts",
        "subtitle":"\n              (Montel) The speed of Germany’s energy transition will likely slow down after the country’s shift to the right in this weekend’s general election but continue in some form, energy industry analysts told Montel on Monday.\n            ",
        "body":"\nCoalition talks will start soon, with incoming chancellor Friedrich Merz of the winning centre-right Christian Democrat alliance (CDU\/CSU) expected to first seek talks with the Social Democrats (SPD) of outgoing chancellor Olaf Scholz.\nIf the party enacts its election manifesto, Tobias Federico, director at Montel Analytics, said there would likely be “a slowdown in the build-out of renewable energy, partially to ensure the economic viability of plants… but also to give emerging storage technologies time to catch up”.\nLess focus on renewablesWolf-Peter Schill, energy economist with the German Institute for Economic Research (DIW), said the CDU win could mean less focus on expanding wind and solar capacity.\nHanns Koenig, managing director for central Europe at Aurora Energy Research, said energy policy may take a backseat in the short term given the results.\nMigration was a hot topic during the campaign, while Merz said on Sunday Europe must boost its defences to “achieve independence from the USA” given the Trump administration clearly “does not care much about the fate of Europe”.\n“It’s foreseeable that energy policy is going to take up a smaller role in the next legislative period and that the focus will be on security and economic competition,” said Koenig.\nMerz has expressed caution about the speed of Germany’s green transition, warning against accelerating the plan to shut down coal plants. Germany aims to phase out coal-fired generation by 2038 at the latest, with the previous government effectively abandoning its aim of 2030 last summer.\nNuclear resistanceHowever, experts said the party had committed itself to enough of the green transition that large parts of the programme, including the goal to have 80% of its power generation from renewable sources by 2030, would remain. That could mean more focus on costs but not a reversal.\nThe CDU would “need to continue some of the energy and climate policies enacted under the last coalition”, said Henning Gloystein, director of energy, climate and resources at Eurasia Group.\nMerz has called for the rapid construction of 50 new gas-fired power plants for supply security as coal is phased out, dropping the previous government’s hydrogen focus.\n“The focus for the [CDU\/CSU] union is clearly on gas-fired power plants, possibly without any concrete hydrogen requirements,” said Lukas Feldhaus of the Thema Consulting Group. “I consider it highly likely that a [CDU]-led government will find a pragmatic way to build new gas power plants.”\nOther CDU aims may be harder to meet. The party has stepped back from the vote it led in 2011 to denuclearise and now wants to reopen power plants, after the last ones were shut in 2023. But Gloystein said these plans were likely to run aground due to a lack of engineers, tight regulations and public resistance.\n",
        "datetime":"2025-02-24T10:51:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]