[
    {
        "title":"German negative power prices set for new record high in Q2",
        "subtitle":"\n              (Montel) Germany is on track to see a 10-year record number of negative prices in the second quarter, with analysts predicting double the number of negative hours seen during Q2 2024, while neighbouring countries face similar trends.\n            ",
        "body":"\nAnalysts said this was due to the country’s record high solar installations of 18 GW last year and low holiday demand due to Easter falling during Q2 this year rather than Q1 like last year. The country reached a record high 100 GW of installed solar power in January, according to energy regulator BNA.\nDuring the second quarter of last year, Germany saw 165 hours of negative prices – the highest for the April-June period since 2015, when Montel started collecting the data, Montel Analytics data showed. This compared with 450 negative priced hours during the whole of last year.\nHowever, consultancy StormGeo told Montel it expected to see as many as 350 hours with prices below zero during Q2 this year. Analysts at consultancy Icis also expected the country to smash last year’s record, predicting 277 negative-priced hours, while Montel Analytics predicted slightly less, at 146.\nEllie Chambers, analyst for EU power at Icis, said she predicted hours to turn negative especially between 10:00-13:00 CET when solar power produces at peak volumes.\nLower prices?The analysts’ forecasts for day-ahead prices during Q2 varied – with predictions of EUR 75\/MWh from StormGeo, EUR 72.69\/MWh from Icis and EUR 62.18\/MWh from Montel Analytics.\nLast year, German day-ahead prices averaged EUR 71.76\/MWh in the second quarter while the Q2 2025 contract last traded at EUR 73.30\/MWh on the EEX exchange.\nTobias Federico, managing director at Montel Analytics, predicted Q2 prices to fall due to the potential for lower gas prices, abundant solar and lower demand during the late Easter holiday.\nPrices should also trend lower during the second quarter in neighbouring France as well as in Italy and Spain amid a surge in solar power expansion, analysts told Montel.\nStructural changeA trader from a French energy producer said that a higher level of public holidays due to Easter and lower industrial demand would pressure prices there in Q2.\n“Negative prices are becoming structural. As the delivery date approaches, weather forecasts, 7-15 days before, will accentuate or smooth out the shape of these prices,” he said.\n“Now, even when the weather is cloudy, so much solar capacity has been installed in almost all countries that the issue will even be whether we can reduce nuclear output enough [to balance the power grid],” he added.\nIn France, the front-quarter futures contract last traded at EUR 47.19\/MWh on the EEX. France’s installed solar capacity grew by 5 GW to 25.3 GW last year, official data showed.\nItalian power prices have averaged EUR 142.51\/MWh since the beginning of the year and could easily drop below an average of EUR 90\/MWh in the April-June period, said Diego Pellegrino, CEO of Italian energy company Eroga Energia.\nThe Q2 contract last traded at EUR 109.33\/MWh on the EEX.\nItaly added about 6.8 GW of new solar capacity in 2024, a 30% increase year on year. However, traders told Montel they did not expect negative hours in Italy “for the time being”.\nSpain spikeMeanwhile in Spain, the number of negative hours could roughly double this year to around 500, Montel reported earlier this year. \nSpain added more than 6.7 GW of new solar capacity last year. Its spot power prices averaged EUR 33.35\/MWh in Q2 2024, while the contract for Q2 2025 baseload last changed hands at EUR 43.60\/MWh, on the EEX.\n",
        "datetime":"2025-03-12T16:04:05",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]