[
    {
        "title":"German parliament passes landmark funding set to aid climate",
        "subtitle":"\n              (Montel) A landmark overhaul of German debt rules that will provide billions for infrastructure, defence and the green transition spending was approved in Germany’s lower house of parliament on Tuesday in a 513-207 vote.\n            ",
        "body":"\nThe constitutional amendment allows the government to direct up to EUR 500bn over the next 12 years to these areas.\nOf that, EUR 100bn will be allocated to a special green transition fund that was also used in 2024 to finance carbon contracts for difference to bridge the gap between current industry processes and future low-carbon ones.\nDefence spending will be partially exempt from budget rules and regional authorities will also see their debt rules relaxed.\nUnusual conditionsThe historic vote progressed under unusual parliamentary circumstances. Although the CDU\/CSU alliance won the general election on 23 February, newly elected representatives will not enter the Bundestag lower house until 25 March.\nHowever, the constitutional change required a two-thirds majority. The incoming parliament saw strong gains by far-right and far-left parties that oppose the budget changes and will together control more than one-third of the Bundestag’s seats.\nThat led incoming chancellor Friedrich Merz to call the vote before the new parliament begins to gain support from the Social Democrats and Greens, which have more than 70% of seats in the outgoing parliament.\nBefore it can be enacted, the measure will need final approval on Friday from the Bundesrat upper house, where it is expected to be approved.\nMerz has denied claims that the unwinding of Germany’s debt brake was a resetting of priorities for the country. However, members of the Green party, which had long called for the change, noted he only came around to it after winning last month’s election.\n",
        "datetime":"2025-03-18T15:14:47",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]