[
    {
        "title":"Germany must rein in energy costs – economist",
        "subtitle":"\n              (Montel) Germany’s biggest energy challenge remained a need to rein in costs, energy economist Marc Oliver Bettzuege told Montel in an interview, even as the country’s likely next government looks set to relax spending limits.\n            ",
        "body":"\n“When money is tight, efficiency has a high priority, and there are certainly elements of German climate policy where efficiency has not been the most important criterion,” said Bettzuege, director of the Institute of Energy Economics (EWI) at the University of Cologne.\n“The questions of which forms of renewable energy should be developed – and how much – are efficiency issues that have not been conclusively clarified.”\nRenewable energy met 55% of German power use last year. The country aims to grow this to 80% by 2030. While the cost of wind turbines and solar panels has plunged over the past two decades, their integration into the German power system remains another matter.\n“One major issue is how to minimise the need to build new electricity grids,” said Bettzuege.\n“The current plans for grid expansion envisage hundreds of billions of euros worth of new transmission and distribution grids. Yet the grid itself has no productivity: it does not provide any additional energy – it only transports it.”\nEverything that decongested Germany’s networks without building additional grids looked especially attractive, Bettzuege said.\nBy example, he pointed to the development of energy storage or the linkage of hydrogen production to areas of high renewable generation that presently cause network bottlenecks.\nLifted debt brakeExploratory talks this past weekend between Germany’s Christian Union (CDU\/CSU) and Social Democrats to form a coalition government foresaw raising EUR 500bn for infrastructure and tax relief.\nThis included plans to stick to the country’s climate goals, cut energy taxes, make best use of renewables and develop technologies like carbon capture and storage as well as hydrogen. \n“There is no climate neutrality scenario for Germany that reaches zero electricity sector emissions without hydrogen. The energy system needs a seasonal storage medium,” Bettzuege said.\n“It is reasonable to assume that back-up with hydrogen will become significantly more expensive than it has been with coal and natural gas to date.”\nGermany would need to increase spending on climate-related investments alone by EUR 51-150bn annually to align the pace of transformation in its economy with a goal of net-zero emissions by 2045, a council of experts reported to the government last month.\nBettzuege, a member of the council, said that while the pace of emissions reductions had improved in recent years, it still fell short of what was needed to hit the government’s targets.\nEnergy still secureBy contrast, Germany’s energy security was less of a pressing problem than costs, Bettzuege said.\n“There are currently no strong indications that security of supply problems could arise.” Peakload consumption had fallen considerably in recent years, potentially curbing the need for backup capacity relative to recent expectations, he added. \nThe CDU\/CSU and SPD are eying the construction of 20 GW of gas-fired power plants to replace a steady loss of coal and nuclear plants in recent years.\nGermany had time to tender for such units, though not much, Bettzuege said.\nLignite-fired generation in the country’s west could likely be prolonged beyond 2030, however limitations on lignite mining in the Rhenish region were likely to limit an extension to 2033 at the latest, he said.\n",
        "datetime":"2025-03-10T14:21:30",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]