[
    {
        "title":"German coal could get reprieve with CDU-led government",
        "subtitle":"\n              (Montel) Pressure to end coal-powered generation in Germany is likely to ease significantly now that Europe’s biggest economy is set to have a centre-right government, with one analyst arguing on Monday the shift opens the door for technologies like carbon capture and storage (CCS).\n            ",
        "body":"\nResults from Sunday’s election show that the Christian Democrats (CDU) took a majority, with over 28% of the vote, and are expected to now seek a coalition with the Social Democrats (SPD).\nThe last government had pushed to end the use of coal for power by 2030, accelerating a legal timeline for the end of its use by 2038. That had often met criticism from eastern German governments, which argued they could not make the transition away from coal at that rate.\nThe argument from the east was looked on sympathetically by CDU leaders, who have argued that Germany cannot shut down baseload capacity too quickly if the country is to maintain a reliable power supply.\n“Merz will immediately drop talk about a coal exit by 2030 and instead try to focus on the actual legal exit date of 2038,” said Henning Gloystein, director of energy, climate and resources at Eurasia Group.\nMalte Kueper, an energy specialist at the German Economic Institute, agreed, adding that “if necessary,” plants that had already been shut down could remain in the country’s reserves for the time being.\nTobias Federico, with Montel Analytics, said he sees the possibility of the next government tinkering with the 2038 deadline even further.\n“A softer version could be possible, in which the remaining hard coal and lignite plants are only removed from the grid much later,” he said, pointing to the end of the 2030s or the early 2040s as options.\nIf the government were to be more aggressive about maintaining capacity, he said he could even see hard coal plants that had been relegated to the reserves being pulled back to grid service.\nAny such moves could mean the power sector will have to start relying more on CCS technologies, Federico said.\nThat might not be such a hard sell, since members of the SPD had already begun discussing CCS with industry and environmental groups last year. But Federico said the new government could go a step further and expand CCS so it would be applied to lignite and hard coal power plants – which is currently not allowed in Germany.\nNo Zone SplitFederico said the CDU would also probably oppose any move to implement a power price zone split in Germany, which several experts have called for to allow better price signaling.\nAdvocates for the introduction of two or more pricing zones say markets get inadequate information, since high renewable generation in the north is not always available for transmission to the industry-heavy south.\n“It would be too likely that the southern price zone would be much more expensive than in the north, but [the south] is the economic centre of Germany and the electoral home of the CDU” and its sister party, the CSU, Federico said.\nNevertheless, it remains to be seen how the next coalition government in Germany will shape energy policy.\nFriedrich Merz, leader of the CDU and set to become Germany’s next chancellor, has already ruled out working with the far-right Alternative for Germany (AfD), which took 20.8% of the vote in Sunday’s elections. The outgoing chancellor, Olaf Scholz, saw his SPD party receive its worst ever result, with 16.4%.\n",
        "datetime":"2025-02-24T11:58:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        COAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]