[
    {
        "title":"Greek gas demand rises 50% to hit record high in early 2025",
        "subtitle":"\n              (Montel) Natural gas demand in Greece hit a record high in the first two months of 2025, surging by nearly 50% on the year to 15.5 TWh, gas TSO Desfa said late on Tuesday.\n            ",
        "body":"\nIn addition, daily domestic gas demand on 24 February hit a new all-time high of 357 GWh, breaking the previous record of 328 GWh set on 15 January.\nThis growth is driven by increased use of gas for electricity production, rising demand from households and businesses, as well as gas exports, Desfa noted, adding that gas remains a key transition fuel, providing flexibility, reliability and security in energy supply.\nGreece’s national energy and climate plan forecasts a 70% decline in natural gas demand by 2050 from 2022 levels, with renewables set to rise and dominate in the country’s energy mix.\nNonetheless, Greece is advocating further expansion of gas infrastructure, such as the Vertical Gas Corridor linking Greek LNG capacity with central and southeastern Europe, as Athens pursues its goal of becoming a regional hub for the fuel.\n",
        "datetime":"2025-03-05T08:45:18",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]