[
    {
        "title":"Greece seeks views on speeding up 3.5 GW battery storage plan",
        "subtitle":"\n              (Montel) Greece aims to offer grid connections for 3.55 GW of standalone battery energy storage system (BESS) capacity, according to a document which has been put forward for public consultations this week.\n            ",
        "body":"\nMost of the new capacity, 2.65 GW, is set to be connected to the transmission grid, with the remainder 0.9 GW allocated for the distribution grid.\nThe additional storage should help the grid security and reduce curtailments when there is an oversupply of intermittent renewable energy, the country’s energy ministry said. The new capacity will not be linked to a government subsidies scheme.\nGreece’s National Energy and Climate Plan (NECP) envisages 4.3 GW of battery energy storage capacity by 2030. \nGrid stabilityThe additional capacity will help ease the strain on the grid in case of renewables oversupply and low consumption, Stella Sarri of the national DSO Hedno told Montel on Tuesday.\nIn 2024, the volume of curtailed green power more than doubled on the year to nearly 900 GWh, accounting for 3.5% of the country’s total renewable generation.\nLarge-scale BESS deployment would help maintain the grid stability and trim curtailments, she said.\nEgyptian energy company Elsewedy announced last month plans to launch Greece’s first standalone BESS with a capacity of 50 MW by the end of the year.\n",
        "datetime":"2025-02-25T14:06:54",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]