[
    {
        "title":"Greece hikes battery storage target to 4.7 GW by 2030",
        "subtitle":"\n              (Montel) Greece aims to offer grid connections for 4.7 GW of battery energy storage system capacity by 2030, 1.2 GW more than earlier planned, in a move aimed at helping balance the grid and reduce curtailments.  \n            ",
        "body":"\nThe latest target, which was published in a decree in Greece’s Official Gazette last week, is significantly above the 3.5 GW one shared just last month. \n“This is not a jump, it’s a jump to the moon,” Efstathios Sideris, the country manager of renewables developer Ecoenergy Greece, said in a LinkedIn post over the weekend.\nThe capacity, to be offered via tenders, will not be linked to a government subsidies scheme.\nAccording to the decree, developers need to submit a collateral of EUR 200,000 per MW of installed capacity to be connected to the transmission grid, and EUR 50,000 per MW for the distribution grid.\nInvestors will have up to 18 months to submit their letter of intent.\nThe new  aim exceeds Greece’s Nationale Energy and Climate Plan target, which envisages 4.3 GW of battery energy storage capacity by 2030. \nRising curtailmentsThe additional BESS capacity should help balance the grid and reduce curtailments in instances of renewables oversupply to under 5% by 2030,  according to Sotiris Kapellos,  chairman of the Hellenic Association of Photovoltaic Companies (Helapco).\nIn 2024, the volume of curtailed renewables more than doubled on the year to nearly 900 GWh, accounting for 3.5% of the country’s total renewable generation, according to data from local DSO Hedno.\nKapellos said that so far this month, Greece has seen a 20% of green curtailments, mostly solar, up from 12% over the same period a year ago.\n",
        "datetime":"2025-03-17T11:39:10",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]