[
    {
        "title":"H2 still key to Germany’s green plans – energy firm",
        "subtitle":"\n              (Montel) Hydrogen will remain a key ingredient in Germany’s energy mix, an executive from energy services firm GE Vernova told Montel, with the company prepared to bid for any contracts that are offered.\n            ",
        "body":"\n“It’s pretty clear that Germany is going to have some type of H2-ready power plant in order to face their coal decommissioning decisions,” said Brice Raisin, vice president of GE Vernova’s gas power business.\nNew capacityEarlier this month, talks between the parties likely to form the next government yielded plans for 20 GW of new gas-powered plants by 2030, but there was no mention of whether those would eventually be converted to run on hydrogen.\nThe main determining factor will be when German hydrogen imports are at a level that can support widespread power generation, Raisin said.\nTechnological hurdlesEnthusiasm for hydrogen has cooled in Germany in recent months as it has become clear that technological hurdles still need to be cleared if it is to build gas-fired powered plants that would eventually be converted to hydrogen.\nIn September, Philipp Nimmermann, economics and energy undersecretary at the economics ministry, told an audience that it was not clear if the technology would ever work. \nHowever, Raisin said there was a clear path forward, noting that GE Vernova has more than 8.5m operating hours of experience with turbines burning fuel mixes ranging from 0-100% hydrogen.\n“The technology to burn hydrogen is not the bottleneck,” he said.\nRaisin said GE Vernova is fine-tuning “micro mixers” that control the flow of hydrogen into a turbine. The technology works, “but will still need several generations of upgrades to guarantee stability and temperature control at the scale needed,” he added.\nHe noted that GE Vernova is prepared to work on pure gas powered turbines if that is what Germany decides it wants.\n“The earlier the decisions are taken, the easier it is for us to be able to commit,” said Raisin.\nChallenging timelineRaisin said that building a large number of power plants built by 2030 is a challenge, with construction expected to take 3-4 years, and planning and permitting often requiring two years in Germany.\n“The government will have to push and help the market to accelerate this permitting process,” he said.\nHowever, he also pointed to other countries building 8 GW of new capacity a year, and noted that companies are making plans to be able to provide the materials and skills Germany needs if it is to build the new plants.\n“We will be ready to provide a significant amount of the 20 GW,” he said. “Once you have a market like this one that develops with clear rules that attract investment, we will want to be part of it.”\n",
        "datetime":"2025-03-17T11:15:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROGEN\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]