[
    {
        "title":"Hungary set to diversify energy supply with gas from Romania",
        "subtitle":"\n              (Montel) Hungary is set to secure natural gas supplies from Romania as it looks to diversify its energy sources, the country’s foreign minister Peter Szijjarto said on Monday.\n            ",
        "body":"\nAt a joint news conference with Romania’s energy minister Sebastian Burduja, Szijjarto said Hungarian gas companies are already negotiating contracts, while Burduja noted that Romania’s 100bcm Neptun Deep gas project in the Black Sea will turn the country into a net exporter.\nThe project is set to be completed by 2027, said Burduja. However, neither of the officials disclosed potential volumes.\nNeptun Deep “will be the only fresh gas source in the region that can contribute to energy diversification”, Szijjarto said after the two signed an agreement on measures to safeguard the security of gas supply.\n“Romania has significant production capacity which will grow in the future, it also has a serious storage capacity… thus, Hungary has a serious interest in finding a basis for gas solidarity with Romania,” he said.\nSzijjarto noted that in 2024 the gas interconnector between the two countries was used to trade a total of 1.8bcm, against total capacity of 2.6bcm\/year.\nAlternative sourcesEfforts by southeast European countries to use gas as a transitional fuel are putting pressure on them to secure alternative sources of supply following Russia’s 2022 invasion of Ukraine, and the subsequent end of gas transit flows via Ukraine in January.\nTwo-thirds of Hungary’s gas imports currently come from Russia. Last year, Hungary imported 7.5bcm of Russian gas via the TurkStream pipeline and additional amounts via Romania. It also produces 1-1.5bcm\/year of gas domestically.\nBurduja said in January that Romania would export around 1bcm of gas from Neptun Deep to a German company via Austria’s OMV, as Europe continues to seek replacements for Russian supply.\n",
        "datetime":"2025-03-10T12:12:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]