[
    {
        "title":"InCommodities to launch battery storage in Germany in 2026",
        "subtitle":"\n              (Montel) Danish energy trader InCommodities is expanding into batteries – with plans to launch its first Germany battery storage unit next year – and aims to manage more renewable projects in the Nordic region, it told Montel.\n            ",
        "body":"\nThe Aarhus-based company has diversified from its core short-term energy trading activities in recent years and it was currently building up a business unit for battery storage, said Andreas Juul Jensen, head of renewables asset management.\nThe group was targeting its first battery in the German market in 2026 and was also looking at possibilities to join battery projects as co-investors, Jensen said.\n“We can see some good synergies from that,” said Jensen, who heads a business unit that now operates 1.2 GW of green projects in Germany and 30 MW in Finland following its launch in 2022.\n“Going forward, we plan to expand our market presence in Germany, also by providing a broader offering for balancing. This can include fixed price deals or management of guarantees of origin (GOs),” he said.\nVolatile marketInCommodities also planned to expand renewable asset management in the Nordic region, where it currently manages production of the 30 MW Morknasskogen wind farm in Finland.\nSuch services would better help companies manage power production in an increasingly volatile market by using balancing and ancillary markets as well as managing sales of GOs, he said.\n“More renewables increase the demand for flexibility, particularly when production deviates from the forecast. Increased dependence on renewables can be expensive when the production is not there,” said Jensen.\nDenmark and other Nordic countries have seen extreme price volatility in the new Nordic market for automated frequency reserves, after it was launched two weeks ago.\n",
        "datetime":"2025-03-17T09:13:52",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]