[
    {
        "title":"Italian industry pushes central gas buying to cut prices",
        "subtitle":"\n              (Montel) Italy’s largest industry association is pushing a centralised gas purchasing system to lower domestic market costs by EUR 2-3\/MWh and generate potential savings of up to EUR 1.3bn a year, according to a document seen by Montel.\n            ",
        "body":"\nConfindustria’s proposal involves securing about 6bcm\/year – roughly the volume imported from northern Europe – and to sell it daily at the TTF benchmark price.\n“By removing distortions from accumulated fixed transport and infrastructure costs, Italy could save EUR 1.3bn annually, boosting competition and European market integration,” said the draft document seen by Montel late on Wednesday.\nThe proposal outlines two measures to be adopted by the country’s energy regulator Arera. The first involves removing entry costs at Passo Gries at the Swiss border – which Confindustria believes influences Italian PSV gas prices.\nHowever, the proposal may breach the EU’s tariff network code, an industry expert told Montel, wishing to speak on condition of anonymity.\n“It’s not possible to apply a different tariff between one entry point and all the others,” the expert said, predicting opposition from the EU’s energy regulator Acer.\nThe second measure aims to secure supply through contracts between the gas TSO Snam and selected companies, which would receive incentives to sell gas daily at European market-based prices. If they generate excess profits, they will have to refund the surplus, according to the document.\nWhile this approach interferes with the market, it is feasible albeit complex and could be less effective than expected, the expert noted.\nWidening price spreadsThe proposals come amid widening PSV-TTF spreads. The PSV-TTF annual average spread hit EUR 2.02\/MWh in 2024, the highest since 2019.\nLast year, Italy imported about 10% of its gas demand, or 6bcm, via Passo Gries.\nItaly’s industry representatives plan to present the proposals to parliament in the coming weeks. \nAn approved measure could be included in Italy’s recently passed energy aid package.\nLast month, Montel reported that Italy was exploring a solution without involving northern European countries.\n",
        "datetime":"2025-03-13T11:34:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]