[
    {
        "title":"Italy PPA growth to persist amid high power prices – analysts",
        "subtitle":"\n              (Montel) Italy’s power purchase agreement (PPA) market will likely maintain its growth trajectory this year, after a 56% jump on the year in 2024 due to companies seeking protection from volatile power prices, industry experts told Montel.\n            ",
        "body":"\nIts PPA market is currently driven by companies that face some of the highest spot and forward market prices in Europe, combined with their need to achieve ambitious decarbonisation objectives, said Alberto Latorre, PPA origination manager at Nadara.\nWith Italy reliant on gas for as much as half of its power production, power prices remain higher than in neighbouring countries, like Germany and France, which benefit from high levels of cheaper wind and nuclear generation, respectively.\nIn 2024, the Italian market saw a 56% increase year on year in deal volumes to 39 PPAs, up from 24 in 2023 and 10 in 2022, according to a recent report from renewable energy consultant Pexapark.\nItaly was the fourth largest PPA market in Europe last year, with a total of 1.06 GW, the Pexapark report noted, behind France in third place, Germany in second with 2 GW and Spain in first with 4.7 GW.\nFaster permittingStructural factors were also driving changes in the Italian energy market, according to Stagnaro.\nLooking ahead, recently introduced regulations providing public sector guarantees for PPAs to protect participants against counterparty risk under certain conditions would likely positively affect the market, he said.\n“This could become a crucial element in Italy’s future energy landscape, particularly given the country’s predominance of small businesses where long-term relationship risks are heightened,\" Stagnaro added.\nWhile market conditions should remain favourable for PPAs this year, Italy’s growth could be affected by new green incentives, including the country’s energy release and Fer X schemes, Latorre said.\n“[Higher energy costs] certainly favour PPAs today and in the short term, especially in the context of an energy crisis which to date has not been properly addressed,” said Francesco Sassi, a research fellow at think tank RIE.\nThis is an online version of an article published in Montel’s EnergyTransition Weekly last Friday.\n",
        "datetime":"2025-03-03T14:50:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]