[
    {
        "title":"Italy’s ERG cuts spending 20%, lowers green targets 7%",
        "subtitle":"\n              (Montel) Italian renewable energy company ERG has cut by 20% its capital expenditure for the 2024-26 period to EUR 1bn and lowered its green energy capacity target by 7%, it said late on Tuesday.\n            ",
        "body":"\nThe decision reflected delays in the approval of Italy’s state scheme to incentivise renewable capacity, known as Fer X, and a cautious approach in the US, as the company awaited clearer policy direction from president Donald Trump’s administration, it added in a statement.\nERG said it cut its 2026 green capacity target to 4.2 GW from the previous 4.5 GW, strengthening its strategy to maximise returns through selective growth.\n“In updating the 2024-26 plan, we have strengthened the selective “value over volume” approach, first introduced last year, by reducing investments for the next two years and focusing on assets currently under construction, organic development and repowering,” said CEO Paolo Merli.\nWind repowering, or refurbishment of existing plants, remains a key pillar of ERG’s strategy, with 269 MW already operational, 29 MW under construction in France and Germany, and an 800 MW project pipeline, including 380 MW already authorised, the company said.\n",
        "datetime":"2025-03-12T08:11:58",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]