[
    {
        "title":"Launch of Greek daily, weekly power futures to limit risk – traders",
        "subtitle":"\n              (Montel) The recent launch of Greek day-ahead and front-week power products on Leipzig-based exchange EEX will help market participants better manage the risk associated with price volatility, said traders.\n            ",
        "body":"\nEEX yesterday launched Greek daily and weekly futures contracts, having announced them in December.\nUntil now, EEX and local power exchange HenEx were only offering monthly, quarterly and annual financial contract products.\n“The Greek forward power market has seen substantial growth in trading volumes over the last few years. The introduction of daily and weekly futures is likely to further boost this trend, adding to the market’s reliability,” said Omiros Vlachos, trading director at Greece’s largest utility PPC.\nIncreased liquidity“Liquidity is expected to increase across the Greek products suite, providing more opportunities for trading and better price discovery,” he added. “These new futures will help market participants hedge against intramonth price volatility and manage more efficiently risks associated with fluctuating power prices.”\nYiannis Papamikrouleas, head of futures trading at Greek gas company Depa, agreed that the development would have a major impact on the local power market. Yesterday was “a unique day for Greece and energy trading”, he said in a LinkedIn post.\nThe flexibility offered by the new short-term contracts could help limit the pressure in the event of price spikes similar to those experienced by Greece last summer, which prompted it to ask the EU to intervene.  \n“Yesterday we saw the first trades on the very first day of our new Greek day futures (a total of 840 MWh),” EEX said on LinkedIn today. \n",
        "datetime":"2025-02-25T12:43:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        FINANCIAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]