[
    {
        "title":"Low participation behind extreme Swedish balancing price – TSO",
        "subtitle":"\n              (Montel) A lack of down-regulation participants in southern Sweden and limited regional import capacity caused balancing prices to hit EUR -10,000\/MWh on Sunday, Anna Jaderstrom, balancing market head at TSO Svenska Kraftnat, said late on Monday.\n            ",
        "body":"\nDown regulation occurs when power producers are paid to reduce output, or consumers to increase consumption, on short notice at times of grid oversupply.\n“The price fell very low due to a lack of bids in the [southern] SE3 and SE4 bidding zones, and because available transmission capacity from the north was insufficient to meet the entire demand for down-regulation in southern Sweden,” Jaderstrom told Montel.\nPrice floorShe referred to an incident on Sunday, when balancing prices in southern Sweden and eastern Denmark hit the technical price floor of EUR -10,000\/MWh between 10:00 and 11:00 CET.\nUp to 1 GW of electricity was down-regulated in Sweden from 10:00-11:00 CET on Sunday, which means companies with balance responsibility, such as power suppliers, had to pay up to SEK 100m that hour to keep grid frequency stable.\nThe TSO said there were enough reserves available in the manual frequency restoration reserve (mFRR) to balance the market. The mFRR, which became both pan-Nordic and automated last week, offers reserves that can be activated within 15 minutes’ notice.\nIncreased volatilityMarket participants have criticised the high volatility of balancing prices since the joint Nordic market’s launch, with western Denmark seeing a record high of EUR 4,827\/MWh for up regulation – where producers are paid to boost output or consumers to reduce consumption – last Thursday. \nJoel Nordstrom, head of electricity markets at steel producer SSAB, said a lack of liquidity in some bidding zones made balancing prices very responsive to sudden changes in supply and demand, and that many seemed to submit bids at the price cap of EUR 10,000\/MWh.\nThis was a consequence of last year’s introduction of flow-based market coupling in the spot market, which reserved more cross-zonal transmission capacity for the day-ahead market over shorter markets.\nAs a result, more reserves now had to be procured locally, where supply is not always sufficient to meet demand.\n“It is a major problem that the cables are fully utilised, so that we can’t just call for Norwegian hydropower to clear the hour,” he said.\n",
        "datetime":"2025-03-11T09:37:04",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]