[
    {
        "title":"New German coalition aims for 20 GW gas units by 2030",
        "subtitle":"\n              (Montel) The proposed new German coalition government of the Christian Democrats (CDU\/CSU) and the Social Democrats (SPD) aims to add 20 GW of gas-fired power plants by 2030, it said in a strategy paper.\n            ",
        "body":"\nThe new power plants were to be primarily built at existing sites and regulated based on a “quickly revised power plant strategy”.\nReserve power plants, meanwhile, would be enabled to participate in the wholesale power market, the parties said in the paper released on Saturday.\nCurrently, reserve units can be used to remedy grid bottlenecks but are not part of the wholesale market.\n“A larger energy supply serves to stabilise and reduce electricity costs,” said the paper.\nPolicy in limboThe previous coalition of Social Democrats, Greens and Liberals failed to pass legislation for a planned 10 GW of gas-fired power plants during their term, with the administration’s collapse late last year leaving vital energy policy in limbo.\nThe CDU emerged as the strongest force in last month’s general election and aimed to form a coalition with the SPD, the third strongest force in the election.\nStarting Thursday, working groups will negotiate the details of the coalition agreement, with everything set to be finalised by Easter.\n",
        "datetime":"2025-03-10T06:43:34",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]