[
    {
        "title":"New Nordic model not cause of EUR -10,000 balancing price",
        "subtitle":"\n              (Montel) Sunday’s extreme balancing power price of EUR -10,000\/MWh in Denmark and Sweden was not caused by an error in the new joint Nordic market model for balancing, said Danish TSO Energinet on Monday.\n            ",
        "body":"\n“This is not an error in our new market. When there are very large imbalances, low liquidity and high prices on the last bids on the merit curve, the price becomes high,” Kia Marie Jerichau, senior director at Energinet, told Montel.\nPrices for down regulation – where producers are paid to cut output or consumers recompensed for boosting consumption – hit a record low of EUR -10,000\/MWh in eastern Denmark (DK2) and the southern Swedish bidding zones S3 and SE4 between 10.00-11.00 CET on Sunday.\nSeveral market participants said on social media that last week’s move to a joint Nordic market for balancing had led to increased price volatility.\nFundamental issuesBut Energinet said both Sunday’s price crash and the EUR 4,827\/MWh spike for up regulation – where producers are paid to boost output or consumers to reduce production – seen in western Denmark (DK1) on Thursday, were caused by fundamental issues, not the new algorithm used to attract automatic bids for frequency reserves.\nSoaring prices on Thursday were caused by an error in the Norwegian power grid, which reduced the power flow to Denmark and thus created a greater need for up regulation, Jerichau said.\n“We are, of course, closely monitoring it and checking for irregularities in pricing and whether our own implementation is functioning correctly,” she added.\n“We are also working to increase transparency and help market participants in the learning process we are all undergoing.”\n",
        "datetime":"2025-03-10T11:39:55",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]