[
    {
        "title":"Nordic joint balancing market may raise prices – industry",
        "subtitle":"\n              (Montel) The launch of a joint Nordic market to balance the power grid on Tuesday could lead to periods of extreme prices, said energy industry leaders, echoing a warning from Sweden’s TSO last month.\n            ",
        "body":"\nThe manual frequency restoration reserve energy activation market (mFRR EAM) is being introduced in Norway, Sweden, Denmark and Finland at 13:00 CET.\nThe new system will enable TSOs to pool reserves that can be activated within 15 minutes to help stabilise grid frequency, in a market that has an increasing proportion of intermittent wind and solar generation, they said in a statement on Monday.\nPrices above EUR 1,000\/MWhHowever, Sjur Jensen, head of Vattenfall’s production management, pointed to simulations from Swedish TSO Svenska Kraftnat for the period 3-16 February.\nHe told the Swedish forum Second Opinion yesterday that the data showed prices above EUR 1,000\/MWh would have occurred almost daily during that period if the regional mFRR had already been in place.\nSvenska Kraftnat warned last month that the launch could lead to higher imbalance prices, since the introduction of flow-based market coupling in the day-ahead market in October last year had prioritised transmission capacity in the spot market over shorter markets.\nBankruptcy risk?Jensen said it was frustrating for market participants to get this information so close to the launch of the new system. There was also a risk that those responsible for balancing, typically power suppliers, would go bankrupt because if it was too expensive to balance the portfolio, he said.\nSweden’s power industry lobby group, Eneriforetagen, said in a consultation document seen by Montel that there was a lack of analysis on how a joint balancing market would impact prices. It had called for a longer testing period before the system was introduced.\nBalancing prices for from 07:00-09:00 CET on Tuesday out-turned at EUR 420\/MWh in the southern Swedish and Danish bidding zones, the highest since Saturday.\nBut the weather would likely turn colder and less windy next week, which could increase the risk of even higher prices then, Kruno Kuljis, head of analysis of trading firm Modity, told Montel late on Monday.\n“Next week, when the load increases and the wind subsides, even higher hydropower production will not be able to cover the balance at all hours. This can then be further exacerbated by mFRR EAM,” he said.\n",
        "datetime":"2025-03-04T10:40:38",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]