[
    {
        "title":"North Macedonia to start building gas link with Greece in H1",
        "subtitle":"\n              (Montel) North Macedonia plans to sign a deal with Greece for a 1.5bcm natural gas interconnector this month and begin construction in the first half of the year, its energy ministry told Montel on Monday.\n            ",
        "body":"\nThe 123km-long hydrogen-ready interconnector, which is part of the country’s efforts to diversify energy sources and use gas as a transitional fuel as it phases out coal, will have the potential to double the capacity if needed.\nGreece has already started construction, while North Macedonia will need to build a 65km-long pipeline on its territory, said the ministry.\n“Our plan is for this gas pipeline to be a transit route for transporting gas from Greece to central Europe, which is why we had signed a memorandum on the Macedonia-Serbia interconnector and a feasibility study is underway,” it added.\nCurrently, North Macedonia has a 0.8bcm\/year gas link with Bulgaria, which it sources from Russia.\nNeed for new baseloadMeanwhile, the country plans to build two gas-fired power plants with a combined capacity of 400 MW to replace 730 MW of coal, which currently supplies two thirds of demand.\n“Until we build new baseload electricity generation capacity, we cannot abandon coal,” said the ministry.\nThe previous government before last April’s general election announced plans to invest EUR 3bn in building 1.7 GW of renewables with the aim of phasing out coal by 2030.\nThe ministry said that by the start of this year, the TSO had issued permits to private investors for the construction of 1 GW of renewables, while there are 9 GW in requests seeking grid connections.\nLast September, it told Montel that the government also plans to invest in state-owned renewables generation capacity in a bid to reduce its dependency on private producers.\n",
        "datetime":"2025-03-03T09:53:25",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        COAL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]