[
    {
        "title":"Norway minister “concerned” about renewing Danish cables",
        "subtitle":"\n              (Montel) Denmark’s increased focus on green hydrogen production raises concerns over the viability of renewing two ageing power interconnectors to Denmark, said Norwegian energy minister Terje Aasland.\n            ",
        "body":"\n“I am afraid that overcapacity [in Denmark] will be locked into hydrogen, where we do not get full utilisation of imports,” he told his Swedish counterpart Ebba Busch in an SMS exchange in December, seen by Montel after a freedom of information request.\n“This concerns me, among other things, related to considerations about reinvestments in Danish cables.”\nBusch told Aasland during the exchange that it “would have catastrophic consequences for everyone else if you start disconnecting from the parts of Europe” but that she understood Norway’s concerns regarding high power prices.\n“I have the same criticism of Germany, which uses our hydropower and our nuclear power as reserve power, which drives up our prices.”\nAasland hits outAasland told Montel his comments related to the fact Denmark was looking to boost green hydrogen production – typically gleaned from excess green power – for sale to Germany.\nAs a result, the country would more use electricity for these purposes, rather than for export to neighbouring countries, he added.\nThe initial exchange occurred shortly after Nordic power prices had soared amid a lack of wind and solar production in Germany.\nSeveral Norwegian opposition parties, as well as many politicians in the ruling Labour party, said at the time that Norway should reject the renewal of the two oldest power links (1 GW combined) to Denmark, which were coming to the end of their lifetimes, to protect domestic consumers.\nTSOs Statnett from Norway and Denmark’s Energinet were currently preparing an application for a potential renewal.\nLast year, Sweden rejected plans for a new 700 MW link to Germany because of the latter’s failure to split up its power market into pricing zones, which could more accurately reflect supply-demand dynamics.\n",
        "datetime":"2025-03-11T07:02:12",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]