[
    {
        "title":"Norway extends retail power price discount to 2030 for households",
        "subtitle":"\n              (Montel) Norway plans to extend a new discounted tariff for retail power prices to 2030 to shield households from high bills and market volatility, the country’s energy ministry said on Monday. \n            ",
        "body":"\nThe controversial fixed-price scheme would be launched from 1 October offering a tariff of NOK 400\/MWh (EUR 34\/MWh), fixed until 1 January 2026 and then amended on an annual basis, it added, with the proposal open for public consultation.\nIt was announced by the minority Labour government in late January as a means of tackling rising public discontent with power market volatility, even though Norway saw its lowest wholesale power prices for four years in 2024.\nHowever, the scheme has been criticised by market experts for potentially undermining investments in energy efficiency and consumer flexibility, though the government said it would consider setting a cap which restricted the deal for consumption below 3,000-5,000 kWh per month.\nA typical Norwegian household uses around 15,000 kWh of electricity a year, though detached houses use 25,000 kWh, according to Statistics Norway.\n(EUR 1 = NOK 11.78)\n",
        "datetime":"2025-03-10T08:32:09",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]