[
    {
        "title":"Norway minister shrugs off criticism of fixed power price",
        "subtitle":"\n              (Montel) Norwegian energy minister Terje Aasland on Tuesday dismissed criticism from neighbouring countries that introducing a fixed retail electricity price would distort the Nordic power market.\n            ",
        "body":"\n“I believe [the fixed price] will not significantly disrupt the market. We have a very large consumption that lies outside what will be covered by it,” Aasland told Montel on the sidelines of the Sparebank 1 Markets energy conference in Oslo.\nThe government’s proposal for a voluntary fixed one-year price of NOK 400\/MWh (EUR 34\/MWh) for all households from 1 October – named Norgespris – has come under fire because it could fail to deter electricity consumption during hours with high demand.\nFinland’s energy minister recently said Norway’s plan could distort the Nordic power market, while Sweden’s energy authority has said it may inflate prices there and also undermine liquidity in the futures market.\nDenmark’s energy lobby, Green Power Denmark, said the proposal represents a form of populism in energy policy that undermine market forces.\nHowever, Aasland said the measure “creates predictability and stability” without having to intervene in the wholesale market.\n“I believe it is a very good solution and a further development of the electricity support scheme,” he said, referring to the reimbursement to households for 90% of spot prices rising above NOK 750\/MWh.\nAasland said the criticism from other Nordic countries did not affect him.\n“When the Swedes mostly have fixed [retail] prices, or there are hybrid solutions for fixed price schemes in Finland, that is also a similar approach. We are now creating a scheme in Norway that secures households. That is the government’s goal, and I think we have come up with a very good solution,” he said.\nEUR 1 = NOK 11.65\n",
        "datetime":"2025-02-25T11:05:53",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]