[
    {
        "title":"Oil majors drop green targets amid push for supply security",
        "subtitle":"\n              (Montel) Oil majors are cutting renewable investments and ramping up investment in fossil fuels, claiming to prioritise affordability and supply security over the energy transition amid momentous geopolitical developments in recent years.\n            ",
        "body":"\nUK energy giant BP was the latest such company to announce, on Wednesday, that it would slash green investments by more than USD 5bn\/year until 2027, while simultaneously increasing spending on oil and gas by around USD 10bn.\nThis followed oil and gas major Shell’s announcement late last month that it would boost investment in fossil fuels, while earlier this month Norway’s Equinor cut its 2030 renewables target by 20% and Danish utility Orsted has axed its 2030 green target to a still undisclosed amount. Last week, Spain’s Repsol announced a “dramatic” cut in its green hydrogen objectives due to “the delay in market development”.\nExecutives from Portuguese oil major Galp said last week that it would be “very selective” in future green investments, and Finnish energy firm Fortum said a fortnight ago it would invest in renewables if sentiment improved after it saw a 20% drop in operating profit.\n“A lot has changed”BP’s CEO Murray Auchincloss said yesterday at its capital markets event in London that the world had changed over the last five years, following global shocks such as the Covid-19 pandemic, recession and Russia’s full-scale invasion of Ukraine.\nCountries were now increasingly prioritising affordability and security of supply, he said.\n“If I rewind back to five years ago there was a lot of optimism in the world and… the energy transition became much more important. It was the number one thing all the nations around the world and all the corporations were thinking about,” he said.\n“[But] a lot has changed since then… the transition is just not being valued as much as it was five years ago.”\nKodak moment?At the International Energy Week yesterday, Emma Pinchbeck, CEO of the independent consultancy firm Climate Change Committee, pointed to the dichotomy oil majors faced between their pro- and anti-green transition investors.\n“They’ve got a real tension between shareholders that are interested in that short-term profit while oil and gas prices are high… and shareholders that are like “Oh God! Are we going to be Kodak?””\nThis was in reference to the Kodak camera company’s failure to embrace digital photography in the 1990s, which led to its decline and eventual bankruptcy in 2012.\n“Bridge to net zero”“This is bad for national and corporate plans for decarbonisation. However, I personally don’t think it’s a disaster,” said the head of research at a large consultancy, who asked to remain anonymous.\n“I think technology, availability, affordability and general social willpower will be behind the net-zero agenda in five years’ time,” he said, noting the transition would also likely accelerate from 2030-35 with the help of established AI and robotics.\nHe said more damage could be done to the environment over the next five years but added: “Perhaps having more gas, more cheaply available makes it a better bridge… to net zero.”\nNGO Greenpeace, meanwhile, said governments should act. “The reality is now it’s up to the government to… ensure companies like BP pay their share for the climate damage they’re causing,” said Charlie Kronick, senior climate adviser for Greenpeace UK.\n",
        "datetime":"2025-02-27T10:06:46",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OIL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]