[
    {
        "title":"Oil prices continue rise on renewed Middle East tensions",
        "subtitle":"\n              (Montel) Oil prices rose for a third consecutive session on Tuesday after geopolitical events in the Middle East drove supply concerns, with Houthi rebels continuing to target Western vessels in the Red Sea and Israel breaching its ceasefire with Hamas.\n            ",
        "body":"\nThe front-month contract for Brent crude North Sea oil was last seen up USD 0.35 at USD 71.42\/bbl, while the WTI equivalent rose USD 0.33 at USD 67.91\/bbl.\n“An element of risk premium is being added to the oil price in response to flaring tensions around the Red Sea,” Tim Waterer, chief market analyst at trading firm KCM told Montel.\nThis comes after US president Donald Trump said on social media that Washington would hold Iran responsible and suffer “dire consequences” for any future attack, with the Houthi rebels backed by Tehran.\nUS airstrikesOver the weekend, the US launched airstrikes against the group, with defence secretary Pete Hegseth saying it would continue to be targeted unless the attacks stop.\nHouthi rebels have been targeting cargo ships in the Red Sea – a key conduit for energy cargoes – since November 2023.\n“The situation in the Red Sea is keeping oil supported at least in the near term, however expectations of greater supply may soon start to play a larger role and could put oil on the back foot again,” added Waterer.\nHis comments came as cartel Opec+ is expected to start gradually adding supply into the market from April, after delaying a decision to unwind production cuts several times last year.\nOpec reversal?However, Ajay Parmar, global analytics director at Icis, told Montel that “our central expectation is that Opec+ will have to reverse course and cancel its planned supply increase as the market cannot absorb these barrels”.\n“If they do actually proceed with this plan to increase supplies, it will likely push oil prices much lower, giving the US the space to implement severe sanctions on Iran without fearing the inevitable impact on prices that this move would have.”\nWaterer also pointed to the breaking of the ceasefire in Gaza to adding “momentum to the oil price today”, after media reports that Israel has launched air strikes across the region targeting Palestine’s Hamas terrorist group.\nA range of better than expected macro data from China released on Monday had also aided oil market sentiment, said market participants.  \nPotential peace deal?Looking ahead, observers will be watching as president Trump is scheduled to speak with Russian counterpart Vladimir Putin later today about a ceasefire deal in Ukraine.\n“Geopolitical factors such as a potential peace deal between Russia and Ukraine could help to lower oil prices to some degree although Russia is still bound by Opec+ production quotas,” said Parmar.\n“[It] will likely mean minimal changes to Russian oil flows even if a peace deal is reached,”\n",
        "datetime":"2025-03-18T07:18:08",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OIL\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]