[
    {
        "title":"Permitting delays possible as Portuguese prime minister loses vote",
        "subtitle":"\n              (Montel) Firms may face permitting delays for energy projects in Portugal after prime minister Luis Montenegro lost a confidence vote in the parliament on Tuesday, following a scandal related to his family business dealings.\n            ",
        "body":"\nThe president, Marcelo Rebelo de Sousa, must now decide whether to call snap elections, which could be held in mid-May, according to local media.\nOne market participant told Montel that he expected to see a possible delay of “up to six months” for projects that need new permits, as the acting government would be unable to take a stance on important energy issues.\n“Transition will continue”However, he was optimistic that a new government would be formed before the summer, and that it would continue the country’s current energy policy without major changes. “The energy transition will continue” in Portugal, he added.\nAmong the pending regulatory issues is the launch of the country’s first offshore wind auction, which is expected this year. \nThis measure has been pending since the conservative Democratic Alliance won the general election a year ago, after the previous socialist premier, Antonio Costa, was forced to resign following a scandal involving green hydrogen. \nThe latest political crisis in Portugal began last month when it was alleged that a firm owned by Montenegro’s family received payments from other companies while he was in office, according to local media.\n",
        "datetime":"2025-03-12T11:17:29",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]