[
    {
        "title":"Plans to tackle 640 GW grid backlog insufficient – Italy lobby",
        "subtitle":"\n              (Montel) Italian TSO Terna’s plans to address a backlog of 640 GW of renewables grid connection requests were much needed but will not be enough, solar association Italia Solare’s president Paolo Viscontini told Montel on Monday.\n            ",
        "body":"\nTerna will shift from its current processing of renewable connection requests by date received to a new strategy that will prioritise projects with a higher chance of swift completion, Mauro Caprabianca, who oversees territorial programming at Terna, said at the Key Energy conference in Rimini on Friday. \nTotal pending connection requests for renewables including battery storage have risen by more than 50% from 400 GW in 2023 to 640 GW currently, according to Ivan Niosi, managing director of renewable generation at Shell Energy Italia. \n“The objective must be to create paths that ensure plants that may be easier to authorise and implement are not blocked” by the current process, Caprabianca said.\nTerna has also created a digital platform to handle the backlog of requests through improved evaluation and coordination with developers and local authorities, he said. \nSolar connection problemsHowever, “the same needs to happen with distribution system operators, as we’re encountering serious connection problems across Italy for photovoltaic plants, even just a few kilowatts,” Viscontini said.\nHe welcomed Terna’s efforts, but stressed the importance of addressing delays “due to public administrations failing to meet required deadlines”. \nNo rejections allowedOf the 640 GW of renewables requests currently in the queue, which exceed Italy’s 2030 green target by five-fold, only 17 GW have received authorisation, and just 2.5 GW are currently under construction, according to industry data presented at the event on Friday.\n“The grid operator is unable today to reject connection requests even when networks are saturated,” Cristina Martorana, partner at law firm Vegas, told the conference. “This right to obtain a connection solution, combined with its low cost, encourages investors to request much more capacity than they actually intend to build.”\nIndustry leaders in recent days have been urging several solutions to address the backlog, including charging a higher fee for connection requests and requiring stronger financial commitments.\nOther European markets have implemented more decisive measures to address similar issues, Niosi said.\nSpain requires capacity auctions for plants above 100 MW, and the UK announced a pause on new connections from January.\n",
        "datetime":"2025-03-10T11:21:06",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]