[
    {
        "title":"Price risk as Italy data centre capacity may double in 2 years",
        "subtitle":"\n              (Montel) Italy’s data centre industry is set to almost double installed capacity in the next two years, the Italian Data Center Association (IDA) said late on Tuesday, which an analyst warned could raise the country’s power prices even further.\n            ",
        "body":"\nBy the end of 2026, capacity should increase to about 913 MW from 513 MW at the end of 2024, said the lobby group that represents data centre builders and operators, while in 2025, capacity should grow about 37% to 701 MW.\n“We have a clear growth path in the coming years,” said Floriano Monteduro, who heads IDA’s energy access and technical committee, during the Key Choice PPA event in Rimini on the Adriatic coast.\nData centres were expanding in Italy to keep up with cloud computing, artificial intelligence, connectivity and digitisation growth, said Davide Macor, vice-president of IDA’s energy access and technical committee.\nIn addition, Italy’s potential as a data centre market was attracting investment due to its strategic geographical position in terms of power interconnectivity, he added. \nIn a slower growth scenario, Italy’s data centres would see installed capacity grow to 766 MW by the end of 2026, up from 638 MW by the end of this year, Macor said, citing data compiled by the Milan Polytechnic university’s Data Centre Observatory.\nPower price pressureHowever, this growth could increase the country’s electricity prices, affecting competitiveness at a time it suffers some of the highest power prices in Europe, said Francesco Sassi, a research fellow at think tank RIE.\n“Additional power demand in the premium EU power market would add some upward pressure on prices, which cannot help the competitiveness of the country’s economy or bolster EU electricity interconnections,” Sassi told Montel.\nRisk factors\nInvestors must consider risk factors such as regulatory frameworks, permit requirements and the status of TSO connections and power supply, Macor said. In Italy, there are currently 30 GW of data centre requests for TSO connectivity, said the IDA.\n“Data centres need to be built near networks and there must be sufficient capacity,\" Macor said, adding that the cost of power and sustainability were Italy’s issues rather than energy availability.\nSassi called for grid upgrades, increased flexibility and renewables buildout to support the data centre capacity increase.\nElectricity consumption by Italy’s data centres is set to more than double to 1.4 GW by 2028 from 2024, experts warned late last year.\n",
        "datetime":"2025-03-05T08:31:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        HYDROPOWER\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        SOLAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        WIND\n                        \n                      \n                    \n                    \n                  "
        ]
    }
]