[
    {
        "title":"Putin ally pushes Nord Stream gas deal backed by US – report",
        "subtitle":"\n              (Montel) A former spy and close friend of Russian president Vladimir Putin has been engineering a plan for Russia’s Nord Stream 2 gas pipeline to supply Europe with the backing of US investors, according to sources, the Financial Times reported on Sunday.\n            ",
        "body":"\nThe efforts towards a deal, according to several people aware of the discussions, were the brainchild of Matthias Warnig, an ex-Stasi officer in East Germany who until 2023 ran Nord Stream 2’s parent company for the Russian gas giant Gazprom, according to the UK business daily.\nWarnig’s plan involved outreach to the team of US president Donald Trump through US businessmen, the people said. \nWhile there have been several expressions of interest, one US-led consortium of investors has drawn up the outlines of a post-sanctions deal with Gazprom, according to one person with direct knowledge of talks who declined to disclose the identity of the prospective investors.\nExplosionsSenior EU officials became aware of the Nord Stream 2 discussion in recent weeks, with concern among country leaders, according to several officials with knowledge of the discussions.\nThree of four of the Nord Stream 1 and 2 pipelines that link Germany to Russia via the Baltic Sea were damaged by explosions in September 2022. \nNord Stream 1 supplied the EU with Russian gas imports before Moscow’s invasion of Ukraine in February 2022. Nord Stream 2’s launch was blocked by German authorities after the invasion.\nNord Stream 2 AG is 51% owned by Russia’s Gazprom and is based in the Swiss city of Zug, where last month a court postponed the decision on bankruptcy of the company to 9 May.\nWarnig denied being involved in discussions with American politicians to the FT, while Dmitry Peskov, Putin’s spokesman, said he had no information of any such talks.\nGazprom declined to comment. A lawyer representing Nord Stream 2 AG in Swiss insolvency proceedings and a court-appointed custodian of Nord Steam 2 creditors did not respond to FT requests for comment.\n",
        "datetime":"2025-03-03T07:20:22",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]