[
    {
        "title":"Rio Tinto’s shift to GOs may have ripple effect – experts",
        "subtitle":"\n              (Montel) News that aluminium giant Rio Tinto has started purchasing guarantees of origin (GOs) to verify its renewable energy usage is being seen as a milestone, and could trigger widespread adoption across energy-intensive industries, experts told Montel.\n            ",
        "body":"\nIn its 2024 annual report last week, Rio Tinto revealed that it had used energy attribute certificates (EACs), including GOs, for some of its global operations.\n“This is certainly very positive news, not only for the EAC market,” said Lu Wang, managing director of Amsterdam-based Clax Commodities. “As [Rio Tinto is one of] the world’s largest aluminium producers, this news hitting headlines will have a ripple effect on other aluminium producers.”\nIt could also lead to Rio Tinto’s supply chain partners adopting similar standards, he added.\nCompanies in power-intensive sectors such as aluminium have claimed in the past that buying EACs increased their costs substantially, which brought challenges as such firms needed affordable energy. \nAdam White, secretary-general of industry lobby Recs Energy Certificate Association, said the news was “encouraging”, noting that it sent a signal to investors to expand renewables, and would help drive the energy transition away from fossil fuels.\n“The more consumers make the active choice to buy renewable energy through EACs, the greater the signal to investors to build more [renewable generation capacity],” White said.\nIcelandic milestoneIn addition, Rio Tinto reported that market-based emissions at its Isal aluminium smelter in Iceland were recorded as zero.\n“We know that aluminium producers in Iceland have been historically resistant to buying EACs to prove their renewable energy procurement, but if Rio Tinto can do it for its Isal smelter… then why not everybody?” White said.\nIcelandic companies have traditionally relied on a location-based approach, claiming their energy consumption is clean due to the country’s 100% green electricity mix. They have been reluctant to adopt a market-based approach that shows emissions linked to purchasing decisions, such as through EACs.\n“Seeing large companies purchase GOs to prove their renewable energy usage is amazing news,” said Caely Renewables analyst Clara Jansen van Rensburg. “This will ensure that all renewable claims are backed by an EU-approved market-based method, reducing the chances of double counting.”\nDriving factorsMarket experts attributed Rio Tinto’s adoption of a market-based approach to a combination of low GO prices, regulatory factors and branding.\n“The development of strict and binding reporting regulations, like [the EU’s] Corporate Sustainability Reporting Directive [CSRD], plays an important role in moving companies towards more sustainable practices,” said White.\nThe timing of Rio Tinto’s procurement aligning with the CSRD suggests that the regulation is already having an impact, said Wang, adding that more producers are likely to adopt this approach.\nGiven that Rio Tinto is targeting net zero by 2050, “regardless of the CSRD, they are certainly focusing on this issue, also from a branding perspective,” Stella Volpini, of the ESG team at Italian consultancy Fedabo, told Montel.\n",
        "datetime":"2025-02-27T11:41:28",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GOS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]