[
    {
        "title":"Romania, Bulgaria launch cross-border intraday power auctions",
        "subtitle":"\n              (Montel) Bulgarian and Romanian power TSOs Eso and Transelectrica and Romanian exchange Opcom have introduced a mechanism for intraday power trading via cross-border auctions, Eso said on Wednesday.\n\n \n            ",
        "body":"\n“The mechanism will encourage competition in the generation, trade and supply of electricity, optimising the allocation of cross-border transmission capacities and ensuring a level playing field for market participants,” it said in a statement.\nRomania had separately introduced intraday cross-border auctions with neighbour Hungary, Opcom said last week, with trading starting yesterday.\nThe inclusion of the Bulgarian-Romanian border in the auctions for capacity in the intraday market was key for the development of competitive market conditions for regional traders, Eso said.\nMarket participants welcomed the announcement, with one trader telling Montel intraday auctions made the optimal use of available transmission resources.\n“Intraday actions are a great tool for enhancing flexibility in power markets and boosting greater market efficiency,” a second trader said.\nLast month, Bulgaria saw an 8% increase in its intraday trading compared to January, with volumes on power exchange Ibex standing at 407 GWh.  \n15-minute moveMeanwhile, intraday trading windows on the Bulgarian-Greek border were set to move to 15-minute products by mid-2025, Eso added, which compared to 60-minute trading windows now.\nThe initiatives were part of TSO group Entso-E’s aim to harmonise the calculation and allocation of cross-border capacities on Europe’s intraday market. \nPower market and grid operators had set 11 June as the launch date for 15-minute trading to be available on all borders as part of Europe’s single day-ahead market coupling (SDAC) initiative. \n",
        "datetime":"2025-03-19T12:48:01",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        TRADING\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]