[
    {
        "title":"Russian gas imports to EU must end – Von Der Leyen",
        "subtitle":"\n              (Montel) The European Commission remains committed to phasing out all Russian gas imports to the EU, its president Ursula von der Leyen said on Sunday.\n            ",
        "body":"\n“This is an absolute must,” she told reporters in Brussels in response to a question about media reports that Russian gas flows could restart via the Nord Stream 2 pipeline to Germany, for example.\nThe EU had been successful in reducing its Russian energy imports in response to Russia’s war on Ukraine, “but we always see that there are loopholes [which] we have to work on,” she said, without giving more details.\nThe EU already prohibits importing Russian coal and seaborne crude oil and refined oil products.\nIt has also reduced Russian gas imports from around 45% before the war started in 2022 to around 18% last year, in part through joint efforts under the EC’s RePowerEU strategy.\nRussian pipeline gas flows were mainly replaced by US LNG imports. The EU has not reduced its Russian LNG imports. \n“The fact that we tried to get rid of the over dependence on Russian gas caused enormous trouble energywise,” von der Leyen said. But the EU had shown that it was possible to do this and to develop an affordable and secure energy market.\nVon der Leyen was presenting her achievements in the first 100 days of her second mandate, which was to have included an action plan on how to phase out Russian energy imports by 2027. This was to be presented by EU energy commissioner Dan Jorgensen.\nBut this plan has been delayed twice already this year and currently does not have even a tentative publication date.\nVon der Leyen did not give any reasons for the delay.\nSecurity urgencyThe EU needed to switch to a “preparedness mindset” to improve its security in a world where “everything has become transactional,” she said.\nShe planned to start specific security-themed meetings with all the EU commissioners to identify and prepare for different threats, including in energy.\n“Four years ago, we saw that [Russia’s] Gazprom was not refilling gas storages as it should, but we did not draw the right conclusions,” said von der Leyen.\nThis had turned out to be “a hybrid attack” on the EU’s energy security “in order to force us not to support Ukraine” in the war, she said.\nA Nato official told Montel last week that the bloc must shift to a “wartime” mindset and spend more money and effort protecting its critical energy infrastructure.\nThe EC is reviewing the EU’s energy security rules and plans to publish its initial views by July.\n",
        "datetime":"2025-03-09T19:00:13",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]