[
    {
        "title":"Russian energy phase-out plan “very soon” – EU commissioner",
        "subtitle":"\n              (Montel) A roadmap to phase out Russian energy imports to Europe will be presented “very soon”, energy commissioner Dan Jorgensen told MEPs in a parliamentary debate late on Wednesday. \n            ",
        "body":"\n“We are working hard on it. I can assure you that we are committed to delivering on this,” he added during the debate on phasing out imports of Russian fossil fuels amid Moscow’s ongoing war in Ukraine. \nJorgensen was responding to MEPs who called for a clearer date for ending purchases of Russian oil and gas, with the EU’s spending on Russian fossil fuels having exceeded its financial aid to Ukraine last year. \nSuch claims were based on a study released last month by NGO the Centre for Research on Energy and Clean Air. \nThe commission would propose “robust European solutions” to protect companies from paying contractual penalties to Russia, in terms of those that cut ties with the supplier, said Jorgensen. \nNuclear diversificationOn nuclear, the commissioner said more efforts were needed to diversify away from Russian nuclear fuels. \n“Today, four out of the five member states operating Russian-designed reactors have supply contracts in place with alternative supplies of nuclear fuel,” he said. \n“But we need to continue our diversification and further strengthen EU capabilities and cooperation with like-minded countries.”  \nThere has been no sanction on Russian gas and LNG imports since the war began in 2022, though Jorgensen said the bloc had been successful in reducing Russian gas making up around 45% of EU imports before the conflict began, to 19% last year.\nThe roadmap announced last November by Jorgensen had its launch delayed twice this year. \n",
        "datetime":"2025-03-13T08:14:45",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]