[
    {
        "title":"Russia supplied a third of French LNG imports in 2024 – TSO",
        "subtitle":"\n              (Montel) Russia accounted for 32% of France’s LNG imports last year, equivalent to around 87 TWh (8.9 bcm), French gas TSO Natran said on Tuesday.\n            ",
        "body":"\n“France serves as an entry point [to Europe] for LNG, and there is inevitably a transit of Russian LNG to European countries,” said Sandrine Meunier, CEO of Natran, previously known as GRTgaz.\nAround 25% of France’s LNG imports were reexported to neighbouring countries, she added.\nLast month, the Institute for Energy Economics and Financial Analysis (IEEFA) reported an 81% rise in France’s Russian LNG imports in 2024.\nAnd in January, a report by German and Ukrainian think tanks and NGOs found that the lack of transparency on the origin of gas once it was injected into the European grid allowed countries to deny responsibility for increasing Russian imports.\nEuropean dependence easingHowever, Meunier said that “the measures taken by the EU have been effective – Europe’s dependence on Russian gas has decreased from 43% in 2021 to 18% in 2024”.\nShe added that the region was “on the right trajectory” to eliminate the use of Russian gas by 2027.\nOverall, France imported 271 TWh (27.7 bcm) of LNG in 2024, down by around 14% year on year, due to “lower consumption and a greater reliance on storage”, Natran said. France accounted for 24% of total European LNG imports last year.\nEarlier today, Meunier called for the filling of French gas storage capacity to start “as soon as possible”. The country’s gas storage levels are currently among the lowest in the EU, at 22%.\n",
        "datetime":"2025-03-04T14:41:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]