[
    {
        "title":"Russia unlikely to halt Ukraine energy attacks – analysts",
        "subtitle":"\n              (Montel) Russia is unlikely to keep its promise to stop attacks on Ukrainian power and gas systems as it retains an advantage, energy analysts told Montel on Wednesday.\n            ",
        "body":"\n“I can’t imagine it would give up on destroying Ukraine power and gas sectors, which are vital for the country’s war effort,” said Maciej Zaniewicz, senior program manager with Warsaw-based Forum Energii think tank.\nRussian president Vladimir Putin late on Tuesday agreed to suspend attacks on Ukraine’s energy infrastructure for a month.\nHowever, Ukrainian media reported that Russian attacks late yesterday left half of the eastern Ukrainian city of Slovyansk without power, while Ukraine reportedly hit oil tanks in the Russian southern city of Kazanskaya.\n“The Russian Federation’s reliability in upholding temporary agreements, without robust guarantees, remains questionable,” said Tsvetomir Nikolov, energy policy analyst with the Sofia-based Center for the Study of Democracy.\nRussia would likely double cyberattacks on Ukrainian energy sector as these would be less risky than missile strikes even if it signed a peace treaty, said Kamil Lipinski, head of the Polish Economic Institute’s energy team.\nMeanwhile, Henning Gloystein, director of energy, climate, and resources at the consultancy Eurasia Group said: “So far, even the cessation of air strikes on energy infrastructure isn’t even. Still, Eurasia Group expects a truce to happen, probably by early May as Moscow will try to gain as much territory as possible.”\nRepairsHowever, a medium-term ceasefire would be necessary to repair damage, said Zaniewicz, with the country’s gas storage units hitting a fresh record low earlier this week.\n“The timeframe for such repairs remains uncertain due to the complexity of assessing the extent of damage,” said Nikolov.\n“Ukraine’s power system is in much better shape now than a year ago, with long-time blackouts happening rarely,” said Zaniewicz.\nHowever, he said Russia could destroy what Ukraine rebuilds during any potential ceasefire in 1-2 days of airstrikes.\n",
        "datetime":"2025-03-19T14:34:19",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]