[
    {
        "title":"Russian gas unlikely to return on ceasefire – Norway minister",
        "subtitle":"\n              (Montel) Russian gas flows to Europe are unlikely to return if a ceasefire agreement is signed between Ukraine and Russia, Norwegian energy minister Terje Aasland said on Tuesday.\n            ",
        "body":"\n“I do not think Russian gas will enter the European market in the coming years,” Aasland told media on the sidelines of the Sparebank 1 Markets energy conference in Oslo. “The reason is that politicians in Europe have been very clear that they do not want to be dependent on Russian gas.”\nNorway replaced Russia as Europe’s largest gas supplier after the latter’s full-scale invasion of Ukraine three years ago.\nRussian flows fell further at the start of the year when a five-year transit agreement with Ukraine expired.\nExperts have told Montel that transit flows via Ukraine would be the most likely route to Europe for any returning Russian gas.\n“European politicians want a reliable and stable long-term supplier of gas,” said Aasland. \n“They have also built several terminals for receiving LNG, and they trust that the Norwegian continental shelf can produce high gas volumes in the coming years. So I don’t think Russian gas will come back.”\n",
        "datetime":"2025-02-25T09:31:24",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]