[
    {
        "title":"RWE’s trading segment earnings halve but beat expectations",
        "subtitle":"\n              (Montel) The trading segment of RWE posted earnings of roughly EUR 700m last year, significantly above its expectations in November, the German utility said on Thursday.\n            ",
        "body":"\nGermany’s biggest power producer was still expecting earnings for the division to come in at the “upper end” of a EUR 100m-500m range by the third quarter of last year.\nThe segment’s earnings before interest, tax, depreciation and amortisation (Ebitda) fell relative to the “exceptional high” year of 2023, which saw its Ebitda hit EUR 1.6bn in the wake of the energy crisis.\nIn terms of group performance, the company’s total Ebitda came in at EUR 5.7bn last year, down from the prior year’s EUR 7.7bn.\nPower generation drops“Our construction projects, totalling more than 12 GW, are progressing as planned,” said CEO Markus Krebber in a statement.\n“Given higher uncertainties in the investment environment, we have raised the requirements for future investments. As a result of stricter risk management and higher return expectations, we will invest less than previously planned through to 2030.”\nRWE’s total power generation fell 9% to just short of 118 TWh in 2024, mostly due to a sharp fall in UK gas-fired generation, the company’s production figures showed. It had 46.1 GW of installed generation capacity across various technologies and countries at the end of last year.  \n",
        "datetime":"2025-03-20T06:15:33",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]