[
    {
        "title":"Slovenia has funding advantage for new nuclear unit – expert",
        "subtitle":"\n              (Montel) Slovenia is in a better position than many other European countries with regard to the financing of a new 1-1.65 GW nuclear power project, Ana Stanic, director of consultancy E&A Law, told Montel on Monday.\n            ",
        "body":"\nShe said that Slovenian utility Gen, which is developing the Jek 2 project, will be able to finance up to a quarter of the construction costs, which are estimated at EUR 9.3-15.4bn.\n“This will significantly reduce borrowing costs,” she said.\nSlovenian firms have already expressed interest in participating in the project as co-investors, which could cover another 25% of the cost.\nThe possible participation of neighbouring countries such as Croatia, which already co-owns the existing 730 MW Krsko nuclear plant, would further reduce borrowing needs.\nThe new unit will be built alongside the Krsko plant, which will simplify administrative procedures such as spatial planning, Stanic said.\nIn February, South Korea’s KHNP withdrew from the bidding to help build the new unit, leaving just the US’s Westinghouse and France’s EDF as bidders.\nHowever, Stanic said that given recent geopolitical developments, Chinese suppliers could also be considered.\n",
        "datetime":"2025-03-10T13:13:49",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]