[
    {
        "title":"Spain braces for return of negative power prices",
        "subtitle":"\n              (Montel) Excess renewables generation is set to drag Spanish power prices into negative territory again in coming sessions, even as soon as Saturday, analysts have told Montel.\n            ",
        "body":"\n“Saturday looks likely to see negative prices in Spain”, with hours of “zero or maybe EUR -1\/MWh”, said Jean-Paul Harreman, director at Montel Analytics.\nThis could be the first instance of below-zero prices in the country since the EUR -0.01\/MWh seen at 14:00-15:00 CET on 20 October, data from the Omie exchange showed. Near-zero prices and green output curtailments became widespread last year, putting the profitability of renewables investments at risk.\nHarreman pointed to increased wind and hydropower production on Saturday in the Iberian nation, coupled with muted demand.\nWind generation is expected to average 15.7 GW on Saturday, 6 GW above the seasonal norm, and hydropower 5.2 GW, or 0.6 GW above normal, according to Montel Analytics. Meanwhile, demand looked poised to average 25.5 GW, around the standard level for this time of year.\nSpain’s gas-fired fleet would only provide “around 2 GW” of generation, similar to the exceptionally low levels seen last year from 4-11 April, when the country started to see negative prices, Harreman said.\nMeanwhile, Iberdrola expected to halve the output of its 1.1 GW Valencian reactor Cofrentes from 09:00-12:00 CET on both Saturday and Sunday, according to Remit data. Spain started to modulate nuclear production in 2023 in a bid to leave more room to integrate renewables.\nNot there yet?Spain was likely to see near-zero prices over the weekend due to increased renewables output, said Jose Carlos Antoniles, power analyst at Spain retailer Fortia Energia.\nFortia’s models did not forecast prices below zero this weekend, but negative prices during peak solar production hours were probably “around the corner, in the coming weeks”, he added.\n“We are raising our warnings, observing the situation,” said Rafael Alcala, partner at consultancy Trebol Energia. He noted, however, that negative price forecasts for this weekend were “not so clear” due to relatively high demand.\n“We do believe there will be very low prices, near EUR 10\/MWh. That’s crystal clear,” Alcala added.\nExport curbsThe green flurry expected in Spain over the weekend looked poised to coincide with cuts to interconnection capacity towards France, so “the excess will not be exported” across the Pyrenees, Harreman said.\nFrance was also set to see strong wind output, potentially leading to negative prices late on Saturday and early on Sunday, “although it may just be able to get rid of the excess if other countries don’t have as much wind,” Harreman said.\n“We expect significant modulation of nuclear reactors in France,” he added.\nFrance often has difficulties transporting decentralised solar and wind generation, as well as southern power flows from Spain. This led to curtailments in the northbound direction during 28% of the hours in 2024.\nAvailable capacity for power exports from Spain to France had already dropped from 2 GW to just 0.5 GW by 08:00 CET on Wednesday, according to TSO data.\n",
        "datetime":"2025-03-06T08:49:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]