[
    {
        "title":"Subsidies could reignite offshore wind in Denmark – RWE",
        "subtitle":"\n              (Montel) Subsidies could reinvigorate Denmark’s offshore wind market as companies shied away from the latest tender for 3 GW of capacity due to rising costs, German utility RWE told Montel.\n            ",
        "body":"\n“In order to ensure a stable and sustainable expansion of offshore wind in Denmark, it is crucial to create predictable framework conditions,” Pernille Asgaard Haaning, CEO of RWE Denmark, said ahead of today’s Montel Danish Energy Day in Aarhus.\n“A solution here could be a two-sided CFD model that would reduce investors' risk, ensure lower financing costs and promote the expansion of renewable energy.”\nShe also called on the government to support the creation of a renewable hydrogen market so wind farms can supply electrolysers with energy, as without that, the country would not have enough demand to justify further wind buildout.\nHaaning urged the government to come up with a more balanced risk sharing between developers and the state, as well as a tender model that better reflects current market conditions.\nShe pointed to state subsidisation via a two-sided CFD model, similar to what has been used in for example the UK, which would guarantee companies a minimum price for their production but also require companies to pay back excess profits to the state.\nRising building costsWhen RWE won a tender to build the 1 GW Thor offshore wind farm in 2021 without receiving subsidies, competition was so fierce that the winner had to be decided by drawing lots.\nSince then, costs to develop offshore wind in Europe has soared due to rising material and financing costs as well as uncertainty in supply chains.\nWhen Denmark launched a tender for 3 GW of capacity last October, no bids were received, prompting authorities to cancel the tender as well as a similar-sized tender planned for the first half of this year.\nThe government is set to present a tender for 2-3 GW of capacity later this year, which will be held in 2026.\nSeveral other Danish market participants have called for the introduction of two-sided CFDs, said the Danish Energy Agency last month.\nHaaning said RWE still saw Denmark as a key market for investments. The company’s 1 GW Thor project, which is its first large-scale project in the country, is expected to start power production in 2027.\n",
        "datetime":"2025-03-13T08:41:58",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        OFFSHORE WIND\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]