[
    {
        "title":"Swedish battery firm Northvolt files for bankruptcy",
        "subtitle":"\n              (Montel) Swedish battery manufacturer Northvolt has filed for bankruptcy after suffering financial losses and struggling to increase its production levels of battery cells, it confirmed on Wednesday.\n            ",
        "body":"\nThe decision follows a reconstruction process the troubled company announced in November.\nNorthvolt said it – and other battery manufacturers – had experienced a series of compounding challenges in recent months that eroded its financial position, including rising capital costs, geopolitical instability, subsequent supply chain disruptions and shifts in market demand.\nThe company had also faced significant internal challenges in its ramp-up of production, it added.\n“This is an incredibly difficult day for everyone at Northvolt. We set out to build something groundbreaking – to drive real change in the battery, EV and wider European industry and accelerate the transition to a green and sustainable future,” said interim chairman Tom Johnstone.\n“The outcome is especially hard considering not only the level of engagement and interest we held with potential partners and investors in recent months, but also the clear improvement and upwards trajectory that we have been seeing in Northvolt’s production in Skelleftea, where cell output from serial production lines has doubled and we have secured a 50% improvement in production yield since September,” he added.\nFollowing the bankruptcy filing, a Swedish court-appointed trustee will now oversee the process, including the sale of the business and its assets and settlement of outstanding obligations, the company said.\n",
        "datetime":"2025-03-12T07:16:51",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                        BATTERIES\/STORAGE\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]