[
    {
        "title":"Swedish lobby calls for investigation into extreme balancing prices",
        "subtitle":"\n              (Montel) Authorities should investigate the recent extreme prices on the joint Nordic balancing reserve market, Sweden’s main energy lobby said on Monday.\n            ",
        "body":"\n“With these price fluctuations occurring without a strained [energy] situation… some form of follow-up must take place,” Magnus Thorstensson, market analyst at Swedenergy, told Montel.\nBalancing prices for reserves that can be activated within 15 minutes’ notice have fluctuated between a record peak of EUR 4,800\/MWh and the technical floor price of EUR -10,000\/MWh since the market was launched two weeks ago.\nThorstensson said the authorities should also take a closer look at how the switch to flow-based market coupling (FBMC) in the day-ahead market from October last year has affected balancing markets.\nThe change has led to more interconnector capacity being reserved for the day-ahead market at the expense of the intraday and balancing markets, resulting in increased local procurement of balancing power, which is often more expensive.\nThe problem is compounded by the fact that capacity allocation under FBMC is based on weather forecasts that are two days old, said Thorstensson. He added that this was “not sustainable with a growing share of weather-based electricity production”.\nMore to comeThe joint Nordic balancing market was likely to see further instances of extreme prices, said Nemer Achour, of Swedish consultancy Sigholm.\nThe main reason was that the switch from manual to automatic activation of bids failed to activate “indivisible” bids, Achour said.\nFor example, in a situation where 3 MW of electricity is needed to balance the system, the automatic algorithm will ignore all bids that are larger. This is probably what happened when prices crashed to the EUR -10,000\/MWh floor in Sweden last week, Achour said.\nSmaller unitsMarket participants would therefore need to split their bids into smaller units to better fit with the new algorithm and help forestall extreme prices, he said.\n“If this situation doesn’t change, we will in a worst-case scenario see balancing-responsible players going bankrupt [due to extreme prices],” Achour added.\n",
        "datetime":"2025-03-17T10:08:59",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]