[
    {
        "title":"Trump could jeopardise EU appetite for US energy – analysts",
        "subtitle":"\n              (Montel) Growing US hostility towards Europe could see the bloc turn its back on fresh transatlantic energy deals, amid concerns about the reliability of a country until now considered a staunch ally, analysts told Montel.\n            ",
        "body":"\n“There’s a sense in Europe that the US is out to divide the EU, that the US wants to do bilateral deals with weaker partners – you have to react to that,” said Henning Gloystein, director of energy, climate and resources at Eurasia Group.\n“It’s started with defence, but it’s spilling into the energy sector,” he said, noting that European governments and energy firms were beginning to question whether they want to be tied to “increasingly hostile US LNG”.\nThe previously close relationship between Europe and the US is in crisis, since newly installed president Donald Trump this month began negotiations with his Russian counterpart Vladimir Putin to end the war in Ukraine – without EU or Ukrainian involvement – while sniping at both Europe and Nato.\nIncoming German chancellor Friedrich Merz warned this week that intervention from Washington was “no less drastic, dramatic and ultimately no less brazen” than the intervention Europe had experienced from Moscow.\nSwitched sides“The US has essentially switched sides, so Europe has not just lost an ally, but gained a [threat],” Gloystein said, noting that this had “shaken” Europe’s energy executives and political leaders.\n“You can’t rely on US LNG if there is a potential for export tariffs being imposed. The marginal price for US LNG is already quite expensive. Now there are also reliability issues,” he said.\nThe US was last year the largest supplier of LNG to the EU-27 countries, shipping 36.2m tonnes (49.2bcm) transatlantic, out of a combined total of 82.5m tonnes imported from all origins, according to Kpler vessel-tracking data.\nNominal US LNG export capacity is set to expand by 38% from 2025 levels to 21.2bn cubic feet per day (600mcm\/day) by 2028, according to latest Energy Information Administration estimates. Much of this output had, until now, been expected to head to Europe, amid efforts to further reduce the continent’s reliance on Russian gas.\nIf it is to avoid increasing reliance on US LNG, Europe would need to seek alternative suppliers or cut its gas usage, analysts said.\n“Norway could extend peak gas production by 5-10 years, but Europe also needs to reduce its gas consumption,” Gloystein said.\n“It won’t affect existing deals, but the Europeans will now be reluctant to sign any new long-term LNG deals with the US,” he said.\nNot a bright futureKatja Yafimava, a senior research fellow with the Oxford Institute for Energy Studies, said there was unlikely to be a near-term impact on US flows, but that there could be a hastening of efforts to ditch gas as a baseload fuel.\n“While the EU, as a whole, will likely increase imports of US LNG, as the new “wave” is coming – not least to try to placate Trump and fight off the threat of US tariffs – it will double down on its decarbonisation policy, leading to progressive reduction of gas demand in the future,” said Yafimava.\n“Overall, this would spell not too bright a future for natural gas in Europe – neither Russian, nor – as time goes by – American,” she added.\n",
        "datetime":"2025-02-25T11:00:24",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        LNG\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]