[
    {
        "title":"TSO group urges better management in Balkan blackout report",
        "subtitle":"\n              (Montel) The European TSO association Entso-E has recommended land management improvements, stronger cooperation between neighbouring countries and greater voltage stability in its final report on the blackout that occurred across several Balkan countries last June.\n            ",
        "body":"\n“The findings highlight the need for strengthened vegetation management procedures to prevent short circuits, extended TSO observability of neighbouring grids to improve situational awareness [and] enhanced voltage stability and overload management measures,” Entso-E said.\n“These recommendations will support ongoing efforts to reinforce operational resilience and safeguard the reliability of Europe’s electricity system,” it added.\nThe detailed report was published late on Tuesday, and listed the body’s main findings and proposals to help avoid a repeat of the event. It was compiled by an expert panel, including Entso-E, various TSOs and EU energy regulator Acer, among others.\nIt follows a preliminary report from last November, which pointed to “insufficient vegetation clearance” as the main reason for the tripping of two overhead lines that led to the blackout.\n",
        "datetime":"2025-02-26T08:47:20",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]