[
    {
        "title":"TSO warns on low French gas storage levels",
        "subtitle":"\n              (Montel) French gas storage levels were currently among the lowest in the EU at 22%, well below the region’s 38% average, the country’s gas TSO said on Tuesday, adding it was time to start refilling underground storage.\n            ",
        "body":"\nAt the same time last year, French gas storage was at 43%, according to data from Gas Infrastructure Europe.\nThe TSO partly attributed the relatively low storage level to a rise in French gas exports to neighbouring countries, including to Belgium, Italy and Switzerland, with these exports jumping 10% year on year to 123 TWh.\nGas suppliers had also made “significant” withdrawals starting in early November 2024, “primarily driven by economic arbitrage opportunities”, said Sandrine Meunier, CEO of Natran, formerly known as GRTgaz.\nTime for a refill“The [filling] process should be started as soon as possible,” Meunier said.\nNonetheless, the market and suppliers appeared confident about storage filling for 2025, she added.\n“Prices are currently not favourable for storage filling. However, prices on the futures market are stable for this summer and will likely continue to stabilise or decrease thereafter,” she told reporters at the firm’s 2024 overview press conference.\nThe TTF contract for Summer 2025 was last seen trading EUR 1.43 above the Winter contract, at EUR 43.13\/MWh.\nEC plansGenerally, the storage filling or injection season runs from April through October, although the “practical start” depended on weather conditions, said Pierre Cotin, a TSO director.“Even if [storage] levels drop to the lower end of the 2018-2023 average, we still have sufficient infrastructure to achieve 90% storage fill by the [1 November] target date,” he said, adding that it was “up to the suppliers to take action”.\nRegarding the European Commission’s plan to propose an extension of the bloc’s gas storage regulation until the end of 2027, Cotin said the TSO was “in favour of maintaining” gas storage targets, although adjustments to the required level or target date could be “considered”.\nDemandLast year, French gas demand dropped around 6% year on year to 361 TWh, in line with data from regional TSO Terega published last month.\nIndustrial gas demand was up 0.8% to 109 TWh, while residential and commercial use fell 0.6% to 235 TWh .\nThe downward trend in gas use would continue this year as energy-saving and efficiency measures had “become engrained in consumption habits”, Meunier said.\nIndustrial demand would likely follow a similar trajectory to last year, she added.\n",
        "datetime":"2025-03-04T14:06:32",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]