[
    {
        "title":"TSOs confirm Nordic balancing market will launch on Tuesday",
        "subtitle":"\n              (Montel) The TSOs of Denmark, Sweden, Norway and Finland confirmed on Monday that they will launch on Tuesday a joint market for power reserves that can be activated with 15 minutes’ notice.\n            ",
        "body":"\nThe weather and grid conditions will allow the TSOs to launch the new manual frequency restoration reserve EAM system according to plan tomorrow, the TSOs said in a statement.\nThe new system will enable them to pool reserves that can be activated within 15 minutes to help stabilise grid frequency, in a market that has an increasing proportion of intermittent wind and solar generation.\nUnder the new joint Nordic scheme, the resolution of such reserves will be divided into 15-minute blocks, instead of the hourly system the individual countries’ balancing markets currently use.\nThe switch to 15-minute blocks is in keeping with the EU’s plans to make the same change across balancing, intraday and spot markets this spring.\nProcurement will also be automatic under the new Nordic system, the statement said.\n",
        "datetime":"2025-03-03T11:52:48",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]