[
    {
        "title":"UK 2032 SMR target unrealistic as nuclear fleet ages – analyst",
        "subtitle":"\n              (Montel) The UK government’s target to roll out small modular reactors (SMRs) by 2032 is “incredibly optimistic” and the ageing nuclear fleet could lead to increased price volatility in the interim, an energy analyst has told Montel.\n            ",
        "body":"\nPrime minister Keir Starmer said earlier this month he expected SMRs to be in operation in the UK by 2032 and to become a common sight across the country.\nHowever, Tom Betts, senior analyst at Aurora Energy Research, said that despite the government relaxing planning restrictions on where SMRs can be built, this deadline is unrealistic.\n“The government expects SMRs on the grid by 2032, but we think that’s incredibly optimistic,” Betts said. “2040s is probably more realistic. This technology hasn’t been proven at scale yet, and as with any new development, there’s a long road ahead.”\nThe UK has turned to SMRs – with smaller, more flexible designs that are easier to deploy than traditional large-scale plants – as its nuclear fleet ages. Nuclear currently supplies about 15% of the country’s electricity. Several reactors, originally designed with 30-year lifespans, are already far beyond that limit.\n“More volatility”Although EDF has extended the lifetimes of four key reactors – Hartlepool, Torness and two at Heysham – these extensions will only last until 2027 and 2030.\nWithout a proven track record and secure financing, it remains uncertain whether SMRs can be deployed in the manner laid out by the government, said Betts.\n“Nuclear is just a much more complex investment than renewables,” Betts said. “For instance, the government has a huge stake in Sizewell C and that’s because private investors aren’t lining up to fund these projects. It’s a risky proposition and the pace of progress is hard to predict.”\nWith projects like the 3.2 GW Hinkley Point C pushed back multiple times, Betts said it is unclear whether SMRs can step in quickly enough to fill the void.\n“There’s no perfect overlap between these reactors shutting down and new reactors coming online. That creates a gap in nuclear capacity by 2030,” he said.\n“And if Hinkley is delayed further, there’s no real backup plan. The market will just adjust by running gas CCGTs [combined cycle gas turbines] more often, meaning more volatility.”\n",
        "datetime":"2025-02-25T14:37:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]