[
    {
        "title":"UK carbon price to spike 23% in 2025 – consultancy",
        "subtitle":"\n              (Montel) The UK’s benchmark carbon contract is set to jump 23% year on year to GBP 41\/t in 2025 on a rolling basis, before rising even more sharply in the coming years, consultancy ClearBlue Markets said on Wednesday.\n            ",
        "body":"\nThe benchmark Dec 25 UKA contract was forecast to settle at GBP 41.23\/t on 15 December, its last trade date, which was GBP 7.79 higher than the settlement of the previous benchmark contract, the Dec 24, it added in a webinar.\nUKA prices were then expected to “significantly pick up” from 2026, said Goda Aglinskaite, senior carbon analyst at ClearBlue.\n“In our most likely scenario we expect the prices to reach around [GBP] 100\/t in 2027 and almost [GBP] 140\/t by 2030,” she added in the presentation.\nThe UK carbon market was anticipated to remain oversupplied by around 0.9m tonnes this year amid higher fossil fuel generation in the first quarter due to cold weather boosting heating demand and lower wind output, according to ClearBlue’s most likely scenario.\nSupply adjustment mechanismHowever, the UKA market was expected to be short by almost 17m tonnes in 2026, with supply tightening due to a phase-out of free allocations for the aviation sector, as well as an assumption that a supply adjustment mechanism would be introduced that year.\nAssuming it was launched next year, ClearBlue expected the mechanism to remove 12.3m tonnes of allowances from the UKA auctions.\nThe consultancy expected the market to become net short by 2028.\nThe mechanism would amend the supply of allowances in the market in response to certain pre-determined criteria and market conditions.\nThe Dec 25 UKA price was last seen GBP 0.92 higher at GBP 46.70\/t.\nEarlier today, the contract hit a four-week high of GBP 47.02\/t following calls by the EU-UK parliamentary partnership assembly on Monday for both groups to give “serious” consideration to linking their respective emission trading schemes.\n",
        "datetime":"2025-03-19T15:56:15",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]