[
    {
        "title":"UK ETS loses GBP 2.9bn in revenue without EU link – study",
        "subtitle":"\n              (Montel) The UK government faces billions of pounds in lost revenues because the national carbon scheme has not pegged prices to the EU ETS, a new study has found.\n            ",
        "body":"\nLooking at fiscal years 2024-25 and 2025-26, the government would have received an additional GBP 2.9bn in revenues had the prices of allowances in the UK ETS been in line with the EU equivalents, according to the Institute for Energy Economics and Financial Analysis (IEEFA).\nThe EU ETS traded at a 51% premium to the UK ETS in fiscal year 2023-24 and a 45% premium in 2024-25 to date, noted the US-based think tank.\n“Lower UK ETS prices are in part because the government lowered the emissions cap in 2023,” IEEFA’s said, noting that the cap was tightened to 931m tonnes of carbon dioxide equivalent.\nAround 53m unallocated allowances are being released into the UK ETS from 2024-2027 to reduce the financial burden of the cap reduction, with the level of free allocation of allowances available to industry increasing from 37% to 40%.\n“These measures contributed to the collapse of UK carbon prices during 2023 and created a sustained discount to the EU ETS throughout 2024,” the think tank explained.\nThe UK officially left the EU ETS in 2021 following its 2016 referendum to leave the EU.\nIn carbon trading on Thursday, the benchmark UK carbon price has a discount of around EUR 21 to the EU equivalent, which was last seen hovering at EUR 67.88\/t.\n“Value erosion”The Office for Budget Responsibility, an independent analysis and forecasting body funded by the UK Treasury, estimated revenues will halve to GBP 6bn in fiscal 2024-25 and 2025-26 due to the “value erosion” of the UK ETS and a lower volume of auctioned UK allowances, according to IEEFA.\n“Had the UK pegged its ETS pricing to the EU equivalent, it would have generated an additional [GBP] 2.9 billion in receipts” in the two fiscal years, it said.\nThe lost revenues due to low UKA prices limit the ability of the UK government and taxpayers to fund climate change mitigation.\nRole of free allowancesAround 38% of emissions captured under the UK ETS were allocated for free in 2023, the value of which – based on average 2022 UKA prices – was GBP 2.8bn, IEEFA’s research found.\n“As it stands, the polluter doesn’t pay.”\nThe UK government plans to extend the first free allocation period from 2021 to 2025 by a year to 2026, with the second free allocation period planned to run from 2027-2030.\nThis is to allow for the second period to coincide with the introduction of a UK Carbon Border Adjustment Mechanism, IEEFA said, which applies the UK ETS price to imports that are covered by the UK scheme.\n“An opportunity exists for the UK government to vastly reduce the number of free allocations for 2027-2030 as the risk of carbon leakage is eliminated.”\n",
        "datetime":"2025-03-06T10:43:09",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]