[
    {
        "title":"UK targets 87% emissions reduction by 2040",
        "subtitle":"\n              (Montel) UK government advisory group the Climate Change Committee (CCC) is targeting an 87% reduction in the country’s emissions from 1990 levels by 2040 in its latest carbon limits for the period 2038-42 presented on Wednesday.\n            ",
        "body":"\nThe advisory group recommended a limit of 535m tonnes of carbon dioxide equivalent (tCO2e), including emissions from international aviation and shipping, in its seventh carbon budget.\nThe government uses carbon budgets to set a legally binding cap on the maximum level of emissions for a five-year period. The cap must be set in law 12 years before that timeframe starts.\nThe latest limit is 45% lower than the committee’s sixth carbon budget level, which in 2020 recommended capping UK emissions at 965m tCO2e between 2033-37, with the aim of a 78% reduction in emissions from 1990 levels.\n“Deliverable” targetThe group said its latest target was “ambitious” and would be “deliverable, provided action is taken rapidly”.\nIt said it expected emissions to fall to a quarter of today’s levels and 87% below 1990 levels by the turn of the decade. Emissions were last seen at half the levels of those in 1990, it added.\nAchieving this level would require a “significant” reduction in emissions across sectors including transport, construction, industry and agriculture, it added.\nIt expected decarbonisation and low-carbon electricity to provide the largest share of emissions reductions, with 60% by 2040.\nRenewables boostThe CCC forecast offshore wind to grow six-fold from 15 GW of capacity in 2023 to 88 GW by 2040. Onshore wind capacity should double to 32 GW and solar capacity to 82 GW in the same period, it said.\nIn November last year, the government committed to an 81% reduction in emissions by 2035, so the CCC said it aligned its latest budget with that goal. The UK is targeting 43-50 GW of offshore wind, 27-29 GW of onshore wind and 45-47 GW of solar power by 2030.\nIt predicted that three-quarters of cars and vans and nearly two-thirds of heavy goods vehicles on the roads being electric by 2040, up from only 2.8% of cars and 1.4% of vans in 2023.\nAround half of UK homes would have heat pumps by then, compared with around 1% in 2023, it said.\n“This budget puts offshore wind right at the heart of the UK’s clean electricity system,” said lobby group RenewableUK.\n“This is vital to meet the upsurge in electricity demand which the CCC predicts we’ll see in the 2030s, as more people take up electric vehicles and heat pumps.”\n",
        "datetime":"2025-02-26T00:01:00",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        CARBON\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        RENEWABLES\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]