[
    {
        "title":"UK “committed” to GB Energy despite funding cut reports",
        "subtitle":"\n              (Montel) The UK government has told Montel it remains “fully committed” to GB Energy, following media reports that the Treasury is considering cutting funding for the state-owned power company.\n            ",
        "body":"\nGB Energy was set up in 2024 to spearhead the nation’s green energy push, but the Financial Times reported on Friday morning that the Treasury is facing “mounting pressure” to reduce funding to the company.\n“Pivot towards defence spending”Citing “people familiar with the discussions”, the FT reported that the government is seeking to “pivot towards greater defence spending” following recent geopolitical developments involving the war in Ukraine, and that GB Energy may be on the chopping block.\nThe UK government initially pledged GBP 8.3bn of funding for GB Energy up to 2029, but only GBP 100m was earmarked for it in October’s autumn budget.\nThe UK government, however, told Montel it is “fully committed to the GBP 8.3bn for GB Energy, which is at the heart of our mission to make Britain a clean energy superpower”.\nIt added that GB Energy is “making rapid progress” by “making Juergen Maier the start-up chair, confirming Aberdeen as HQ, progressing the Great British Energy Bill, and creating an unprecedented partnership with The Crown Estate, which has the potential to leverage up to £60bn of private investment into the UK’s drive for energy independence”.\n",
        "datetime":"2025-03-10T10:23:37",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]