[
    {
        "title":"Ukraine meets Russian energy system ceasefire with caution",
        "subtitle":"\n              (Montel) Russian president Vladimir Putin late on Tuesday agreed to suspend attacks on Ukraine’s energy infrastructure for a month, but market participants in the war-torn country greeted the news with some caution.\n            ",
        "body":"\nDuring a call with US president Donald Trump, Putin said Russian forces would halt strikes on Ukraine’s energy infrastructure for 30 days but failed to agree to an unconditional ceasefire.\n“We agreed to an immediate ceasefire on all energy and infrastructure, with an understanding that we will be working quickly to have a complete ceasefire and ultimately an end to this very horrible war,” Trump said, in a post on Truth Social.\nUkrainian president Volodymyr Zelensky called the news a “positive result”, in a press briefing following the announcement.\n“[But] they are not ready to end this war, and we can see that. They are not ready even for the first step, which is a ceasefire,” he said.\nLingering suspicionUkrainian energy market participants also met the news with some scepticism.\n“Bombing cities is acceptable, yet bombing oil facilities is not – it sounds crazy,” said a Kyiv-based energy trader, during an air-raid attack last night on the capital city.\nYuriy Onyshkiv, a Kyiv-based senior gas analyst at LSEG, also expressed caution.\n“A couple of hours after the call, we got an air raid alert in Kyiv, with machinegun fire outside my flat, shooting down Russian Shahed drones,” he said, adding “I guess the ceasefire has not started yet.”\nSince the beginning of the war, there have been more than 30 “massive” missile and drone attacks on Ukraine’s energy infrastructure, a spokeswoman for the energy ministry told Montel last month.\n“In addition, the energy system has been the target of daily targeted attacks…the consequences of these attacks are significant,” she said, noting that in 2024, 10 GW of generation capacity was lost.\n“There is no place, no region, no type of energy infrastructure that has not been hit during these attacks,” she said.\n",
        "datetime":"2025-03-19T06:55:57",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]