[
    {
        "title":"Uniper won’t go back to Russian gas – CEO",
        "subtitle":"\n              (Montel) German utility Uniper will not buy Russian gas in the future and will use alternative sources, the company’s CEO Michael Lewis told reporters on Tuesday.\n            ",
        "body":"\n“We have terminated our long-term contracts with Gazprom, and [Russian gas] is not part of our future strategy,” said Lewis when presenting the company’s full-year financial results for 2024.\nThe US and Russia have this month been in talks aimed at ending the war in Ukraine, leading to speculation over a potential return of Russian gas flows to Europe via Ukraine.\nUniper previously sourced large quantities of gas from Russian exporter Gazprom through long-term contracts, but the latter stopped deliveries in summer 2022 following the invasion of Ukraine.\nConsequently, Uniper had to procure gas from other sources at record-high prices and at short notice, bringing the company to the brink of financial collapse and leading to its nationalisation.\nDiversified supplyWith financial support from the German government, Uniper then began diversifying its gas procurement portfolio, and “will continue to do so”, said Lewis.\nHowever, the company will not become heavily dependent on US LNG supplies either, said board member Carsten Poppinga.\nOn Tuesday, Norway’s energy minister also said he did not expect a return of Russian gas supply to the EU in the coming years, even in the event of a ceasefire in Ukraine being agreed. \nBefore the start of war in 2022, Russia was Europe’s largest gas supplier and Uniper was one of the main offtakers, and was involved in Gazprom’s Nord Stream pipelines, which were among the major routes from Russia to the EU.\n",
        "datetime":"2025-02-25T13:14:05",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]