[
    {
        "title":"Uniper boosts hedging activity but sees 2024 earnings crash 60%",
        "subtitle":"\n              (Montel) German utility Uniper had increased its power hedging activity at the end of December, though its achieved price was down, while it saw full-year earnings for 2024 dive 63%, it said on Tuesday.\n            ",
        "body":"\nThe company’s forward sales ratio for 2025 domestic generation stood at 80% by year end, 5 percentage points higher than in the third quarter of 2024, though the achieved price decreased EUR 3 to EUR 121\/MWh, it added in its latest full-year financial results.\nCompared to the end of December 2023, meanwhile, the hedging ratio jumped 10 percentage points on a rolling front-year basis.\nFor 2026, the company had hedged 30%, unchanged from Q3. However, the achieved price fell EUR 2 to EUR 86 EUR\/MWh. One year ago, it stood at 5% and EUR 113\/MWh.\nMeanwhile, the utility had sold 5% of its expected 2027 production at 80 EUR\/MWh.\nUniper’s German baseload hedging figures consist of hydropower, of which it operates 2 GW. The hedged output stood at around 2-3 TWh.\nThe benchmark German front-year power contract closed at EUR 88.81\/MWh at the end of December, compared with EUR 95.50\/MWh a year ago.\nNordic hedgingFor its Nordic electricity production from hydropower and nuclear, Uniper had sold 70% of its forecast generation for 2025 at EUR 38\/MWh by the end of December, it said.\nCompared to Q3 figures, the hedging ratio rose 5 percentage points, while the achieved price remained stable at EUR 38\/MWh. Year on year, it rose 40 percentage points, while the price fell EUR 4.\nFor 2026, the utility had sold 40% of baseload production at an average price of EUR 38\/MWh, up 5 percentage points from the end of September and 35 points higher than last year.\nMeanwhile, Uniper had also hedged 25% of its Nordic generation for 2027 at EUR 38\/MWh.\nThe Nordic front-year power contract closed at EUR 36.20\/MWh at the end of December, compared with EUR 45\/MWh a year ago.\nEarnings diveMeanwhile, the firm recorded a significant decline in earnings across several segments, with Uniper attributing this to a decrease in positive contributions from successful hedging transactions at conventional power plants due to lower wholesale prices. \nAdjusted earnings before interest, tax, depreciation and amortisation (Ebitda) at its flexible generation segment slid 58% year on year for the January-December period to EUR 1bn last year.\nOn a group level, adjusted Ebitda fell 63% year on year to EUR 2.6bn, it added.\n",
        "datetime":"2025-02-25T07:23:14",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]