[
    {
        "title":"Uniper trading unit earnings slide 64% amid easing volatility",
        "subtitle":"\n              (Montel) German utility Uniper’s trading arm posted a 64% drop in earnings before interest, tax, depreciation and amortisation (Ebitda) to EUR 1.5bn in 2024, due to lower gas market volatility, it said on Tuesday.\n            ",
        "body":"\nThe Ebitda of its greener commodities segment – which includes trading – dropped to around EUR 1.5bn in 2024, compared with EUR 4.2bn in the previous year, its full-year financial report showed.\nIn 2023, this segment benefited from lower costs to replace lost Russian gas supplies and “unusually high trading results”, it said. However, last year, “an altered market environment” prevented it from achieving the previous year’s “exceptionally positive” results.\nSkyrocketing gas prices in 2022 had pushed Uniper to the brink of bankruptcy, as it had to buy gas at elevated price levels to make up for a loss in Russian supply. The German government stepped in with financial aid to rescue the company. \nLower “price risks”Europe has since offset its Russian gas supply – which met 40% of EU demand before Moscow’s February 2022 invasion of Ukraine – with LNG imports, particularly from the US.\nUniper said “commodity price risks” had since fallen “due to the reduced volatility” in the market.\nIt said the continent’s benchmark front-month TTF gas contract traded in a range of EUR 30-45\/MWh last year – down from its record high above EUR 300\/MWh in 2022.\nThe company increased its power hedging activity at the end of December, though its achieved price was down, while it saw full-year earnings for 2024 dive 63%, Montel reported earlier.\n",
        "datetime":"2025-02-25T08:54:01",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]