[
    {
        "title":"US tariffs on steel imports put energy system at risk – lobby",
        "subtitle":"\n              (Montel) US tariffs on steel imports pose a “genuine threat” to the sector’s future in the EU, with consequent risks for related sectors such as energy, European steel association Eurofer said on Wednesday.\n            ",
        "body":"\n“If European steel disappears, so too does European automotive, European security and defence, energy infrastructure, transportation and others,” Eurofer president Henrik Adam said in response to the US’s decision to impose tariffs of up to 25% on steel and aluminium imports from today.\nEurope’s control over its supply chains in these strategic sectors was at risk, Adam said. \nSteel production is energy intensive, and energy companies rely on steel to help generate and transport their products, from wind turbines to oil and gas pipelines. \nSaturated marketUS blanket protection measures combined with record global excess capacity levels risked the “already saturated” EU market being flooded with cheap steel originally intended for the US market, undercutting local production, Adam said.\n“Our producers already face the highest energy prices while having the highest climate ambition,” he added.\nThe European Commission has said that the EU steel sector needs help to cope with the challenges of decarbonising while boosting its global competitiveness and keeping production in Europe.\nIt plans to unveil an EU action plan for steel and metals next Wednesday that will address how to make low-carbon steel production commercially viable, among other issues.\nEuropean responseMeanwhile, the EC responded to the US tariffs by warning it would impose EU tariffs on a range of US products from 1 April, including boats, bourbon and motorbikes.\nIt will expand the list by mid-April, after consulting on which further products to include.\nThe EC remained open to a negotiated solution, however, as “it is not in our common interest to burden our economies with tariffs,” said its president Ursula von der Leyen.\nShe has asked EU trade commissioner Maros Sefcovic to resume talks with his US counterparts to explore the options.\nSefcovic, who helped Russia and Ukraine negotiate their last five-year agreement on gas transit to the EU in 2019, said there was common ground with the US.\n“In relation to steel and aluminium, we share some of the challenges – for instance, on global overcapacities driven by non-market practices – and the EU is therefore part of the solution, rather than a problem,” he said. \n",
        "datetime":"2025-03-12T13:52:25",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        GAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        POLICY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]