[
    {
        "title":"Vattenfall open to nuclear PPAs for new capacity – CEO",
        "subtitle":"\n              (Montel) Swedish utility Vattenfall is open to signing long-term power purchase agreements (PPAs) linked to new nuclear generation capacity if there is demand for them, according to its CEO Anna Borg.\n            ",
        "body":"\nIt was looking at building new nuclear capacity, she said, without providing further details on where or how much, “and when we do that [we will] have a discussion with industry partners on long-term agreements” linked to it.\nDemand for PPAs with Vattenfall had so far been for new generation capacity, mostly onshore and offshore wind, she told reporters ahead of a competitiveness event organised by the European People’s Party in the European Parliament on Wednesday evening.\nThe demand came mainly from companies with “strong balance sheets”, as PPAs involved “quite a lot of risk over a long period of time”.\nSupporting PPAs with credit guarantees, for example, could make them accessible to smaller companies, she said.\nThe European Commission said last week the European Investment Bank would offer EUR 500m in guarantees for long-term PPAs in a joint pilot scheme this year.\nReduce riskThe goal was to reduce counterparty risk and so make PPAs accessible to more industrial consumers, the EC said in its affordable energy action plan published last week.\nThe EC wants to promote PPAs to give industry access to long-term stability in electricity prices that is not linked to volatile gas prices. It is part of efforts to maintain the EU’s industrial competitiveness with the rest of the world while decarbonising its economy.\nIn January, Vattenfall signed a 15-year PPA with chemicals group LyondellBasell to provide 450 GWh per year from 2028 from the 980 MW Nordlicht 1 offshore wind farm project in the North Sea.\nIt signed another 15-year PPA linked to the same project in August last year with German steel group Salzgitter for around 300 GWh per year. \n",
        "datetime":"2025-03-06T08:44:35",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        PPAS\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]