[
    {
        "title":"Vattenfall could begin building nuclear plant in 2029 – report",
        "subtitle":"\n              (Montel) Swedish utility Vattenfall is planning to start constructing a new nuclear reactor in the country in 2029, which could be completed in 2035 in line with the government’s target, local magazine Affarsvarlden reported on Wednesday.\n            ",
        "body":"\nVattenfall recently told Montel that it would not be able to make a final investment decision on new nuclear generation before 2029 or 2030.\nHowever, internal documents show the utility may be ready to start building immediately after an investment decision is made, with construction potentially taking only 5-6 years, Affarsvarlden reported.\nUnder such a scenario, Vattenfall could be ready to deliver in time for the government’s target of having 2.5 GW of new nuclear capacity online by 2035.\nVattenfall is considering whether to build two large-scale reactors or 3-5 small modular reactors (SMRs), with both options corresponding to installed capacity of around 2 GW, according to the magazine.\nOther factorsThe company told Montel it was too early to give a precise estimate on when new reactors could be online.\n“The final investment decision and subsequent large-scale construction start will be made only when all permits and other conditions, including financing and the EU’s state aid review for state risk-sharing and financing, are in place,” said spokesman Markus Fischer.\n“Since we do not have control over the timing of the permitting processes and are still evaluating four suppliers and their reactor types, it is too early to say exactly when the final investment decision and subsequent construction start will be,” he added.\nThe group has previously said it can take four years to build SMRs and 6-7 years to build conventional reactors.\n",
        "datetime":"2025-02-26T11:34:01",
        "category":[
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        ELECTRICITY\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  ",
            "\n                    \n                    \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                        NUCLEAR\n                        \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                      \n                    \n                    \n                  "
        ]
    }
]