{
    "title": "60-Euro-Marke hält als Unterstützung",
    "date": "2024-10-10 14:55:00",
    "text": "Nach einem schwachen Wochenstart ging es in der vergangenen KW 40 auch im weiteren Wochenverlauf weiter abwärts für die Emissionszertifikate. Der EUA Dez.24-Future schloss mit einem Wochenverlust von 7,5 Prozent bei 61,46 Euro/t CO2. Das Wochenhoch wurde bei 66,97 Euro/t CO2 markiert, das Wochentief lag leicht unterhalb des Wochenschlusskurses bei 61,41 Euro/t CO2.Zum Start in die Handelswoche 41 setzte sich die Schwäche zunächst fort. Am Montag eröffnete der CO2-Dezember-Future bei 61,52 Euro/t CO2 und fiel bis auf 60,06 Euro/t CO2 zurück. Im weiteren Handelsverlauf meldeten sich die CO2-Bullen aber zurück, sodass der Dezember-Future 1,53 Prozent fester bei 62,40 Euro/t CO2 aus dem Handel ging. Am Dienstag übernahmen die CO2-Bären wieder das Handelszepter. Nach einem Höchstpreis bei 61,92 Euro/t CO2 fiel der Kurs im Tagestief bis auf 60,07 Euro/t CO2 zurück und schloss 3,56 Prozent leichter bei 60,18 Euro/t CO2. Auch am Mittwoch blieb zunächst die 60-Euro-Marke im Fokus. Nach einem Low bei 59,95 Euro/t CO2 erholten sich die Preise aber und es ging auf Tagesschlusskursbasis 4,07 Prozent fester bei 62,63 Euro/t CO2 aus dem Handel. Die Hausse wird am Donnerstag fortgesetzt. Am Nachmittag gegen 14:30 Uhr notiert das CO2-Zertifikat 2,6 Prozent im Plus bei 64,26 Euro/t CO2.CO2-Shortpositionen steigen auf 6-MonatshochHintergrund des starken Preisanstiegs der EUAs dürften insbesondere charttechnische Signale auf der 60-Euro-Marke gewesen sein. Angesichts der schwachen Wirtschaftsdaten blicken die spekulativen Marktteilnehmer derweil jedoch weiter pessimistisch auf den europäischen Emissionshandel und haben ihre Netto-Short-Positionen auf 26,2 Mio. EUAs erhöht, das höchste Niveau seit Mitte März. Dies entspricht einem Anstieg der Netto-Short-Position von 6,9 Mio. EUAs im Vergleich zur Vorwoche. Die Short-Positionen der spekulativen Händler stiegen um 3,2 Mio. EUAs auf 66,5 Mio. EUAs, während die Long-Positionen um 3,7 Mio. auf 40,3 Mio. EUAs abgebaut wurden. Dies ging einher mit einem Wochenverlust des Dez. 24-Futures von 7,5 Prozent in der KW 40.UBA untersucht Krisenfestigkeit des EU-ETSIn einem Rechtsgutachten hat das Umweltbundesamt (UBA) die Krisenfestigkeit des europäischen Emissionshandels (EU-ETS) untersucht. Aktuelle Krisen wie der Krieg in der Ukraine und die Corona-Pandemie stellen das EU-ETS vor erhebliche Herausforderungen, besonders bei der Umsetzung der Verpflichtung zur Abgabe von Emissionszertifikaten. Eine Untersuchung der aktuellen Gesetzeslage auf EU- und nationaler Ebene zeigt einen deutlichen Bedarf an Anpassungen, insbesondere im Umgang mit Krisensituationen wie höherer Gewalt, Insolvenzen oder Betriebsstilllegungen. Verbesserungen sollten sich auf klarere Regelungen und das Schließen von Lücken konzentrieren, wobei die Zusammenarbeit zwischen EU- und nationalen Behörden zentral ist. Statt eines reinen Maßnahmenkatalogs wird der Einsatz von Verwaltungsinstrumenten, wie etwa die Sperrung von Zertifikatkonten, als sinnvoll erachtet. So soll den Behörden mehr Spielraum gegeben werden, um die Abgabeverpflichtungen auch in Krisenzeiten sicherzustellen. Derzeit dürfen insolvenzgefährdete Unternehmen ihre Zertifikate verkaufen, ohne zuvor ihre Emissionsverpflichtungen des Vorjahres zu erfüllen. Dieses Vorgehen führt zu einem Überangebot an Zertifikaten, was die Preise belastet. Das UBA empfiehlt daher, nationalen Regierungen zu gestatten, Unternehmen daran zu hindern, Zertifikate zu verkaufen, bevor ihre Emissionen des Vorjahres gedeckt sind.Autor: Tobias Waniek von enerchase "
}