{
    "title": "Abwärtskorrektur nach Jahresendrally",
    "date": "2025-01-09 15:30:00",
    "text": "Der Jahreswechsel war von einem deutlichen Anstieg des Kaufinteresses bei den CO2-Zertifikaten geprägt. Vom Tagestief bei 64,05 Euro/t CO2 am 17. Dezember stieg das Verschmutzungsrecht (EUA Dez.25) in der Spitze am 3. Januar auf 76,35 Euro/t CO2 (plus 19,2 Prozent). Allein in der ersten Handelswoche des neuen Jahres stieg der CO2-Future um 6,3 Prozent auf 76,19 Euro/t CO2 im Wochenschlusskurs.Mit Beginn der zweiten Handelswoche setzte eine Abwärtskorrektur ein. Am Montag fielen die Preise um 2,5 Prozent und schlossen bei 74,32 Euro/t CO2. Am Dienstag setzte sich die Abwärtsbewegung zunächst fort, mit einem Tagestief von 72,91 Euro/t CO2. Gegen Nachmittag stabilisierten sich die Preise, und der Tag endete mit einem minimalen Rückgang von 0,2 Prozent bei 74,18 Euro/t CO2. Den Schwung konnten die CO2-Bullen am Mittwoch nicht mitnehmen. Der CO2-Dezember-Future rutschte auf 72,34 Euro/t CO2 zurück (minus 2,5). Nach dem kräftigen Preisrücksetzer stabilisiert sich der CO2-Markt am Donnerstag. Am Nachmittag gegen 14:30 Uhr notiert das Emissionsrecht 1,2 Prozent fester bei 73 Euro/t CO2.Deutsche Emissionen 2024 auf RekordtiefMit Blick auf das Gesamtjahr zeigte sich der CO2-Handel im Vergleich zum Vorjahr schwächer. Da der EUA Dez. 24 Kontrakt allerdings bereits vor der Jahresrally ausgelaufen ist, nutzen wir an dieser Stelle die Performance des EUA Dez. 25-Kontraktes. Dieser sank im Jahresverlauf um 11,9 Prozent. Der EUA-Spotmarkt lag nach 83,47 Euro/t CO2 in 2023 in 2024 durchschnittlich bei 65,24 Euro/t CO2 (minus 21,8 Prozent).Die Treibhausgasemissionen in Deutschland erreichten 2024 ein Rekordtief von 656 Mio. Tonnen, was einem Rückgang um 3 Prozent im Vergleich zum Vorjahr entspricht. Besonders hervorzuheben ist der starke Rückgang der Emissionen aus der Stromerzeugung, bedingt durch die Stilllegung von Kohlekraftwerken mit einer Kapazität von 6,1 GW. Erneuerbare Energien deckten 55 Prozent des Bruttostromverbrauchs und kompensierten den Kapazitätsverlust weitgehend. Allerdings stiegen die Industrieemissionen leicht um 2 Prozent, während die Emissionen aus dem Bau- und Verkehrssektor nur geringfügig zurückgingen.Bullishes Sentiment aufgrund neuer CoT-DatenDerweil zeigen sich die finanziellen Spieler wieder optimistisch was die Preiserwartung der CO2-Zertifikate entspricht. Die gestern veröffentlichten CoT-Daten zum EUA-Markt mit Datenstand 03.01. zeigen, dass die Netto-Long-Positionen der Investmentfonds von 4,5 Mio. t (Woche bis 27.12.2024) auf 19,6 Mio. t (Woche bis 03.01.2025) angestiegen sind. Der CO2-Markt bleibt jedoch stark mit dem Gasmarkt korreliert. Faktoren wie Temperatur- und Windprognosen spielen eine entscheidende Rolle für die Preisentwicklung. Aktuell haben die Winterrisiken bis Ende Februar aufgrund milder Temperaturprognosen etwas nachgelassen. Dennoch könnten Kälteeinbrüche oder geringere Windgeschwindigkeiten kurzfristig neue Preisimpulse auslösen.EUA-Preise am Primärmarkt steigen auf Vier-MonatshochAm Dienstag fand die erste Primärmarktauktion nach der Winterpause statt, die mit einem Auktionspreis von 71,02 Euro/t CO2 den höchsten Wert seit vier Monaten erreichte. Die Bid-to-Cover-Ratio lag bei 1,37 und damit leicht unter dem Jahresdurchschnitt 2024 von 1,68. Am Mittwoch erzielte die Auktion einen Preis von 71,50 Euro/t CO2 mit einer deutlich höheren Cover-Ratio von 2,27. Am Donnerstag lag der Auktionspreis bei 70,01 Euro/t CO2 bei einer Cover-Ratio von 1,57.Autor: Tobias Waniek "
}