{
    "title": "CO2-Marktbericht KW 17",
    "date": "2024-04-25 15:00:00",
    "text": "Richtungssuche nach bullishen VorwochenAnfang letzter Woche hätten wohl nicht allzu viele Marktteilnehmer auf diese Wochenbilanz gewettet, denn nach dem Kursfeuerwerk vorletzten Donnerstag und Freitag überwog zunächst der positive Grundton. Tatsächlich gaben jedoch die EUAs in der KW 16 im Preis nach und schlossen mit einem Minus von 4,4 Prozent bei 68,52 Euro/t CO2. Im Wochenhoch notierte der CO2 Dez.24-Future bei 74,90 Euro/t CO2. Das Wochentief lag bei 68,10 Euro/t CO2.Stabilisierung nach schwachem WochenstartAm Montag der aktuellen KW 17 hat sich der Preisrückgang weiter fortgesetzt. Nach einer schwachen Eröffnung kam es zur Tagesmitte zunächst aber zu einer Zwischenerholung. Gegen Ende des Handelstages fielen die Notierungen dann wieder deutlich zurück und der EUA Dez.24 schloss 3,09 Prozent leichter bei 66,40 Euro/t CO2. Am Dienstag konnte sich keine Marktpartei klar durchsetzen. Das Verschmutzungsrecht ging nahezu unverändert (minus 0,03 Prozent) bei 66,38 Euro/t CO2 aus dem Handel. Am Mittwoch konnten die CO2-Bären zunächst wieder das Handelszepter übernehmen und das CO2-Zertifikat fiel intraday bis auf 64,75 Euro/MWh zurück. Aus dem Handel ging es 0,71 Prozent fester bei 66,85 Euro/t CO2. Am Donnerstagvormittag bleibt das Kräfteverhältnis bislang im Gleichgewicht. Nach einem bisherigen Handel zwischen 67,78 Euro/t CO2 auf der Ober- und 66,54 Euro/t CO2 auf der Unterseite notiert das Emissionsrecht gegen 11:30 Uhr bei 67 Euro/t CO2.CoT-Report überrascht erneutZu Kaufdruck dürfte am Mittwochnachmittag die Veröffentlichung des „Commitments of Traders“-Report mit Berichtsdatum 19.04. (letzte Woche Freitag) der Börse ICE Endex geführt haben. Denn dieser hielt erneut eine Überraschung parat. Insgesamt hat sich die Netto-Short-Position von minus 24,8 Mio. EUAs in KW 15 auf minus 15,6 Mio. EUAs in KW 16 deutlich abgebaut. Und dies vor dem Hintergrund fallender Preise im Berichtszeitraum. Denn seit Mitte letzter Woche ist das CO2-Zertifikat zur Lieferung im Dezember dieses Jahres vom Hoch bei 74,90 Euro/t CO2 bis zum Tief am Freitag bei 68,10 Euro/t CO2 um rund 12 Prozent gefallen. Aufgrund dieses Preisrutsches hätte man durchaus der Meinung sein können, die Short-Positionen der Investmentfonds wären wieder aufgebaut worden. Das Gegenteil ist jedoch der Fall und lässt den Schluss zu, dass die finanziell starken Spieler eine Trendwende bei den EUAs erwarten und nicht mehr an fallende Notierungen glauben. In der letzten Woche kam es zu einem erheblichen Rückgang der Short-Position von 63 Mio. EUAs in KW 15 auf 50,5 Mio. EUAs in KW 16. Gleichzeitig gab es einen Abbau der Long-Position von 38,2 Mio. EUAs in KW 15 auf 30,9 Mio. EUAs in KW 16 (Gewinnmitnahmen).Primärmarktauktion mit PreisrücksetzerNach dem schwachen Handel am Freitag am Sekundärmarkt, reagierte auch der Primärmarkt am Montag mit Kursrücksetzern. Nach einem Auktionspreis von 67,77 Euro/t CO2 am Freitag, fiel der Kurs der Versteigerung am Montag auf 65,10 Euro/t CO2. Die Bid-to-Cover Ratio war mit 1,56 schwach. Am Dienstag fiel der Auktionspreis weiter auf 64,28 Euro/t CO2 (Cover Ratio: 1,57). Die polnische Versteigerung am Mittwoch erzielte einen Preis von 65,35 Euro/t CO2 (Cover Ratio: 2,00). Bei der Auktion am Donnerstag betrug der Auktionspreis 65,08 Euro/t CO2. Die Cover Ratio lag bei 1,68. Wir sehen insgesamt eine unterdurchschnittliche Cover Ratio im bisherigen Jahresverlauf, was auf eine geringe Nachfrage nach EUAs schließen lässt.Autoren: Tobias Waniek, Stefan Küster"
}