{
    "title": "CO2-Marktbericht KW 21",
    "date": "2024-05-23 15:00:00",
    "text": "Bullenrally in KW 21Während sich die Emissionszertifikate in der ersten Wochenhälfte der vergangenen KW 20 noch schwächer zeigten, konnten die CO2-Bullen zum Wochenausklang die Verluste noch begrenzen und Boden gutmachen. Auf Wochenschlusskursbasis verlor der EUA Dez. 24-Future 1,5 Prozent auf 70,52 Euro/t CO2. Im Wochentief notierte der Kontrakt bei 68,70 Euro/t CO2. Das Wochenhoch wurde bei 71,85 Euro/t CO2 markiert.Kursprung an PfingstmontagAm Pfingstmontag legten die CO2-Zertifikate kräftig um 5,3 Prozent auf 74,24 Euro/t CO2 zu. Trotz des Feiertags stieg das Handelsvolumen im Vergleich zur Vorwoche dabei deutlich an, so dass der Kurssprung nicht auf einen illiquiden Handel zurückzuführen ist. Auch am Dienstag zeigten sich die CO2-Bullen weiter als stärkere Marktpartei und so schloss der CO2 Dez. 24-Future 2,6 Prozent fester bei 76,20 Euro/t CO2. Das bullishe Momentum konnte am Mittwoch weiter aufrechterhalten werden, wenngleich die Kursanstiege im Vergleich zu den Vortagen deutlich nachließen. Für das Verschmutzungsrecht brachte der Handelstag einen Anstieg um 0,5 Prozent auf 76,60 Euro/t CO2. Im Tageshoch notierte der Dezember-Future bei 77,50 Euro/t CO2. Das Hoch des Vortages konnte am Donnerstagnachmittag überwunden werden. Gegen 14 Uhr notieren die EUAs 1,6 Prozent im Plus bei 77,92 Euro/t CO2.Überraschender Anstieg der Netto-Short-PositionDer am Mittwoch von der Ice Endex vorgestellte „Commitments of Traders“-Report (CoT) der EUAs mit Datenstand 17.05. zeigt eine Erhöhung der Netto-Short-Position der Investmentfonds. Zum Ende der KW 20 sind die finanziell starken Hände mit 14 Mio. EUAs netto-short positioniert, nach 11,4 Mio. EUAs in KW 19. Während sich die gesamte Long-Position der Investmentfonds kaum verändert hat (40,2 Mio. EUAs in KW 19 | 40,5 Mio. EUAs in KW 20), zeigt sich wieder ein stärkerer Aufbau der Short-Position von 51,6 Mio. EUAs in KW 19 auf 54,5 Mio. EUAs in KW 20. Ob die Investmentfonds ihre Meinung angesichts der starken Kursanstiege auch in der laufenden Woche beibehalten, zeigt sich erst mit dem nächsten CoT-Report, der am 29. Mai mit Datenstand 25. Mai veröffentlicht wird.Primärmarktauktion zieht anPreis stützend wirkte am Montag die robuste Primärmarktauktion, welche im Vergleich zu Freitag (69,46 Euro/t CO2) deutlich auf 71,24 Euro/t CO2 anstieg und den höchsten Stand seit Jahresbeginn markierte. Die Nachfrage war aufgrund des Feiertags aber gering und so zeigte sich die Bid-to-Cover Ratio mit 1,37 sehr niedrig. Am Dienstag legte die Versteigerung weiter auf 71,80 Euro/t CO2 zu. Die Cover Ratio stieg auf 1,51. Am Mittwoch bei der polnischen Versteigerung kam es erneut zu einem kräftigen Anstieg auf 74,31 Euro/t CO2 (Cover Ratio 1,5). Am Donnerstag lag der Auktionspreis bei 74,90 Euro/t CO2 bei einer schwachen Cover Ratio von 1,31.Autoren: Tobias Waniek, Dennis Warschewitz"
}