{
    "title": "CO2-Marktbericht KW 16",
    "date": "2024-04-18 15:00:00",
    "text": "Geopolitische Unsicherheit sorgt für KurssprüngeIn der vergangenen Handelswoche 15 brannten die Energiemärkte und die EUAs ein Kursfeuerwerk ab, welches in dieser Form schon lange nicht mehr zu sehen war. Insbesondere die geopolitischen Entwicklungen im Russland-Ukraine-Krieg und dem Nahostkonflikt ließen das Kaufinteresse massiv in der zweiten Wochenhälfte ansteigen. Entsprechend schloss der CO2-Dez.24-Future die Handelswoche mit einem Plus von 17,42 Prozent bei 71,64 Euro/t CO2.Volatiles Auf und AbNach dem dynamischen Preissprung in der zweiten Hälfte der vergangenen KW 15 kam es am Montag zu einer Gegenbewegung der Emissionsrechte. Das Verschmutzungsrecht schloss 2,07 Prozent leichter bei 70,16 Euro/t CO2. Am Dienstag dominierten dann wieder die Bullen das Marktgeschehen an den Energiemärkten. Der EUA Dez-24-Future schloss 5,83 Prozent im Plus bei 74,25 Euro/t CO2. Am Mittwoch setzte dann ein kräftiger Kursrücksetzer an den Energiemärkten ein. Der EUA-Future zur Lieferung im Dezember 24 verlor 5,28 Prozent auf 70,33 Euro/t CO2. Das Momentum konnten die Bären am Donnerstagvormittag zunächst aufrechterhalten und es ging bis auf 68,15 Euro/t CO2 im bisherigen Tagestief abwärts. Am Nachmittag zeigen sich die CO2-Zertifikate aber wieder fester und der Dezember-Future notiert gegen 15 Uhr rd. 2,1 Prozent fester bei 71,82 Euro/t CO2.CoT-Report überraschtDer neue „Commitments of Traders“-Report der EUAs an der ICE Endex, mit Berichtsdatum 12.04., hielt am Mittwochmittag eine Überraschung bereit. Trotz des zuletzt stark gestiegenen Preises des EUA-Dez.24-Futures in der KW 15 im Hoch bis auf 71,87 Euro/t CO2 hat sich die Netto-Position der Investmentfonds kaum verändert. Während die finanziell starken Hände in KW 14 mit 25 Mio. EUAs netto-short positioniert waren, beträgt die Netto-Short-Position in KW 15 24,9 Mio. EUAs. Dabei wurden zwar die Short-Positionen etwas abgebaut, von 64,1 Mio. EUAs in KW 14 auf 63 Mio. EUAs in KW 15, aber längst nicht in der Form, wie man es hätte aufgrund des deutlichen Preisanstiegs in KW 15 von immerhin 17,5 Prozent erwarten dürfen. Die Mehrzahl der Marktteilnehmer hat mit einem deutlicheren Rückgang der Short-Position gerechnet. Aber auch die Long-Position der Investmentfonds hat insofern überrascht, als dass diese eben nicht zugenommen hat, sondern ebenfalls von 39,1 Mio. EUAs auf 38,2 Mio. EUAs abgebaut wurde. Dies legt den Schluss nahe, dass Player den Markt verlassen haben. Der Blick auf das rückläufige Open Interest (OI) stützt diese These, denn das OI ist von 303 Mio. Kontrakte auf 290 Mio. Kontrakte abgeschmolzen.Primärmarktauktion mit schwacher Cover RatioAngesichts der Kurssprünge am Sekundärmarkt stiegen auch die Preise der Primärmarktauktion kräftig an. Lag der Auktionspreis am vergangenen Donnerstag noch bei 63,42 Euro/t CO2, stieg dieser bei der Versteigerung am Montag auf 68,17 Euro/t CO2. Die Bid-to-Cover Ratio betrug 1,70. Am Dienstag ging es dann weiter mit den Kursanstiegen. Die Auktion erzielte einen Preis von 70,61 Euro/t CO2, bei einer schwachen Cover Ratio von 1,47. Nach der Pause am Mittwoch aufgrund der nur zweiwöchig stattfinden polnischen Auktion lag der Auktionspreis am Donnerstag bei 67,15 Euro/t CO2. Die Cover Ratio war mit 1,48 erneut schwach.Autoren: Tobias Waniek, Stefan Küster ‍"
}