{
    "title": "CO2-Marktbericht KW 12",
    "date": "2024-03-18 15:00:00",
    "text": "60-Euro-Marke weiter im FokusIn der abgelaufenen KW 11 setzten die Emissionszertifikate ihre Aufwärtsentwicklung auf Wochensicht weiter fort. Dabei sah es bis Donnerstag gar nicht danach aus, denn im Wochentief notierte der CO2 Dez-24-Kontrakt bei 55,02 Euro/t CO2. Steigendes Kaufinteresse sorgte dann auf Wochensicht für ein Plus von 1,5 Prozent auf 59,38 Euro/t CO2. Das Wochenhochlag bei 60,25 Euro/t CO2.Robuster Wochenstart wieder ausgepreistIm Einklang mit dem festeren Energiekomplex legten auch die Emissionsrechte zum Wochenstart weiter zu und nahmen den Schwung der zweiten Hälfte der KW 11 mit. Der EUA Dezember-Future stieg um 3,44 Prozent auf 61,42Euro/t CO2. Am Dienstag folgte ein turbulenter Handelstag mit starken Preisschwankungen in beide Richtungen. Das Verschmutzungsrecht handelte in einer Trading-Range zwischen 62,89 Euro/t CO2 auf der Ober- und 59,50 Euro/tCO2 auf der Unterseite. Schlussendlich ging es nahezu auf demselben Niveau wie am Vortag bei 61,31 Euro/t CO2 aus dem Handel. Nach den kräftigen Kurszuwächsen am Montag und starken Preisschwankungen am Dienstag ohne große Veränderung auf Tagesschlusskursbasis, übernahmen am Mittwoch die Bären wieder das Handelszepter. Das CO2-Zertifikat verlor 2,12 Prozent auf 60,01 Euro/t CO2. Am Donnerstag bleibt das Verkaufsinteresse hoch. Das Verschmutzungsrecht notiert gegen 15 Uhr 0,78 Prozent im Minus bei 59,54 Euro/t CO2.Rückgang der Netto-Short-Position im EU-ETSDer am Mittwoch veröffentlichte \"Commitments of Traders\"-Report der ICE Endex für die EUAs mit dem Berichtsdatum 15.3. zeigt einen weiteren Abbau der Netto-Short-Position der Investmentfonds. Diese hat sich von 33,4 Mio. EUAs (KW 10) auf 29,6 Mio. EUAs (KW 11) um 3,8 Mio. EUAs reduziert. Während sich die gesamten Short-Positionen von 68,1 Mio. EUAs (KW10) auf 65,3 Mio. EUAs (KW 11) weiter abgebaut haben, konnte interessanterweise ein Aufbau der Long-Positionen von 34,7 Mio. EUAs (KW 10) auf 35,7 Mio. EUAs (KW11) beobachtet werden. So birgt nicht nur der Rückgang der Netto-Short-Position das Risiko weiter steigender CO2-Preise, sondern nun scheinen die finanziell starken Hände auch auf die Longseite zu wechseln. Letzte Woche sah das Bild mit einem Rückgang der Long-Position nämlich noch anders aus. Keine CO2-Zertifikatskäufe in letzter MinuteAufgrund der Verschiebung der Compliance-Frist von April auf September ist es in diesem Jahr nicht zu erwarten, dass sogenannte Last-Minute-Käufe den Markt in den nächsten Wochen stützen. Ebenso wurde die Frist für die kostenlose Zuteilung von Zertifikaten vom 28. Februar auf den 30. Juni verschoben. Angesichts der Kombination aus niedrigen Preisen und der Erwartung einer geringeren Zuteilung kostenloser Zertifikate könnten Käufer ihre Zertifikate für 2024 bereits früher erworben haben. Dies spiegelt sich in einem erheblich höheren Handelsvolumen in diesem Jahr im Vergleich zum Vorjahr wider. Im Februar wurden 627 Millionen CO2-Zertifikate gehandelt, während es im Vorjahr zum gleichen Zeitpunkt nur 392 Millionen Zertifikate waren. Die Erwartung, dass EUA-Käufe auf den Sommer verschoben werden, hat sich somit nicht bewahrheitet. CO2-Preise um die 50 Euro pro Tonne könnten dazu genutzt worden sein, um die erforderlichen Zertifikate für Compliance-Zwecke zu erwerben.Nachfrage bei Primärmarktauktion weiter schwachDie Primärmarktauktion erzielte am Montag einen Preis von 59,42Euro/t CO2, bei einer Bid-to-Cover Ratio von 1,72. Am Dienstag sank der Versteigerungspreis auf 59,00 Euro/t CO2 (Cover Ratio: 1,53). Nach der Pause der zweiwöchigen polnischen Auktion am Mittwoch lag der Auktionspreis am Donnerstag bei 58,00 Euro/t CO2 (Cover Ratio: 1,60). In den kommenden zwei Wochen wird das Auktionsangebot am Primärmarkt aufgrund der Osterfeiertageetwas geringer ausfallen.Autoren: Tobias Waniek, Dennis Warschewitz"
}