{
    "title": "CO2-Marktbericht KW 11",
    "date": "2024-03-11 15:00:00",
    "text": "Konsolidierung nach KursrallyNach den kräftigen Kursanstiegen der ersten Wochenhälfte der KW 10, kühlte der CO2-Markt zum Ende der Handelswoche etwas ab. Zur Wochenmittenotierte der EUA Dez-24-Kontrakt im Wochenhoch noch bei 62,80 Euro/t CO2 und damit 11,5 Prozent im Plus. Aus dem Handel ging es am Freitag mit einem dennoch kräftigen Plus von 7,24 Prozent bei 56,31 Euro/t CO2. Insgesamt war die Woche von einer hohen Volatilität geprägt. Mit einem Wochentief bei 53,42 Euro/t CO2 betrug die Handelspanne 9,38 Euro/t CO2.Auf und Ab nach schwachem WochenstartZum Start in die Handelswoche 11 kam es zu einem spürbaren Anstieg des Verkaufsdrucks im Europäischen Emissionshandel. Der CO2 Dez-24-Future schloss 4,05 Prozent leichter bei 56,13 Euro/t CO2. Am Dienstag stabilisierte sich der CO2-Markt dann jedoch wieder. Das Verschmutzungsrecht schloss 1,55 Prozent fester bei 57,00 Euro/t CO2. Das ausgeglichene Kräfteverhältniszeigte sich am Folgetag wiederum daran, dass am Mittwoch wieder die CO2-Bären das Handelszepter übernahmen. Der EUA Dezember-Future verlor 1,98 Prozent auf 55,87 Euro/t CO2. Im Einklang mit dem bisherigen Auf und Ab der Handelswoche nimmt das Verkaufsinteresse am Donnerstag wieder ab. Nach einem bisherigen Tagestief bei 55,02 Euro/t CO2 notiert der EUA-Future zur Lieferung im Dezembergegen 14 Uhr nahezu unverändert bei 55,92 Euro/t CO2.Ausbleibende Impulse durch CoT-ReportDer jeden Mittwoch veröffentlichte „Commitments of Traders“-Report zeigt im jüngsten Bericht mit Datenlage letzte Woche Freitag, dass die Investmentfonds im EU-ETS ihre Short-Position zum Teil abgebaut haben und diese sich von 72,2 Mio. EUAs (KW 9) auf 68 Mio. EUAs (KW 10) reduziert hat. Gleichzeitig wurde auch ein Teil der Long-Position reduziert (von 35,4 Mio. EUAs auf 34,7 Mio. EUAs), so dass die Netto-Short-Position insgesamt nur leicht von 36,8 Mio. EUAs auf 33,4 Mio. EUAs gesunken ist. Ein Großteil der Positionen dürfte während der ersten Wochenhälfte der KW 10 geschlossen worden sein, wodurch die Aufwärtsbewegung zu erklären ist. Die grundsätzlich pessimistische Haltung der Investmentfonds dürfte angesichts der anschließenden Kursrücksetzer aber beibehalten worden sein und insofern liefert der CoT-Report bislang keine neue Richtungsentscheidung.Optionsverfall am MittwochKeine Impulse brachte am Mittwoch der Verfall des Optionskontrakts für März. Auch wenn es sich beim März-Verfall dem Open Interest nach um einen kleinen Verfallsterminhandelt – der Dezember-Verfall ist der wichtigste des Jahres – zeigt sich an diesen Handelstagen häufig eine erhöhte Volatilität. Um 14 Uhr wurde von der Börse ICE Endex der Referenzpreis festgestellt, zu dem die Optionen abgerechnet werden. Die „starken Hände“ des Marktes, also die großen Player, fungieren als Stillhalter der Optionen. Sie haben ein Interesse daran, dass möglichst viele der Optionen wertlos verfallen. Am Finanzmarkt hat sich die „Maximum Pain“-Analyse („Max Pain“) bewährt, bei der das Preisniveau ermittelt wird, zudem der größte Teil der Optionen wertlos verfällt. Das Underlying der EUA-Optionen ist der Dezember-Future-Kontrakt. Überträgt man dieses Verfahren auf die EUA-Optionen, ergab sich ein Max Pain-Level von 70 Euro/t CO2. Aufgrund der hohen Preisdifferenz zum Sekundärmarkt waren das Max Pain-Level in diesem Fall aber weniger relevant. Am 18. März verfällt dann der März-Future.Wenig preisliche Veränderung bei Primärmarktauktion Die Primärmarktauktion erzielte am Montag einen Preis von 54,43 Euro/t CO2, bei einer schwachen Bid-to-Cover Ratio von 1,31. Am Dienstaglag der Versteigerungspreis bei 54,21 Euro/t CO2. Die Cover Ratio stieg auf 1,71. Bei der zweiwöchigen polnischen Auktion am Mittwoch betrug der Preis 54,92 Euro/t CO2 (Cover Ratio: 1,98). Am Dienstag fiel der Auktionspreis auf54,25 Euro/t CO2 zurück (Cover Ratio: 1,81).Autoren: Tobias Waniek, Dennis Warschewitz"
}