{
    "title": "CoT-Report und Optionsverfall im Fokus",
    "date": "2024-06-20 16:35:00",
    "text": "Die vergangene Handelswoche (KW 24) verlief im Vergleich zu den Vorwochen bis Freitag relativ ruhig. Nach einer etwas schwächeren ersten Wochenhälfte und einer leichten Stabilisierung am Donnerstag kam es am Freitag dann zu stärkerem Verkaufsdruck, sodass der EUA-Dez.24-Future bis auf 68,17 Euro/t CO2 zurückfiel (Tages- und Wochentief). Die Woche beendete der Dezember-Future mit einem Wochenverlust von 4,1 Prozent bei 68,53 Euro/t CO2. Das Wochenhoch wurde bei 72,17 Euro/t CO2 markiert.Optionsverfall lässt CO2-Preis ansteigenNach dem starken Kursverlust am vergangenen Freitag (minus 3,3 Prozent) blieb das Verschmutzungsrecht auch zum Start in die neue Handelswoche am Montag unter der 70-Euro-Marke und ging bei 68,16 Euro/t CO2 aus dem Handel (minus 0,5 Prozent). Am Dienstag konnte sich keine Marktpartei durchsetzen. Nach einem Handel zwischen 69,25 Euro/t CO2 auf der Ober- und 67,71 Euro/t CO2 auf der Unterseite schloss der EUA-Dez.24-Future mit einem kleinen Plus von 0,3 Prozent bei 68,38 Euro/t CO2. Ausgelöst vom Verfall der Juni-Optionen kam es am Mittwoch zu einer kräftigen Kursrally, und der EUA-Dez.24-Future schloss 3,5 Prozent im Plus bei 70,74 Euro/t CO2. Auch am Donnerstag dominierten zunächst die CO2-Bullen das Börsengeschehen, und es ging im bisherigen Tageshoch bis auf 71,60 Euro/t CO2 hinauf. Zuletzt nahm der Verkaufsdruck aber wieder zu, und das Verschmutzungszertifikat notierte gegen 16 Uhr unterhalb der 70-Euro-Marke bei 69,30 Euro/t CO2.Investmentfonds nach Europawahl pessimistischIn der vergangenen Woche zeigte sich laut dem jüngsten Commitments of Traders-Report (CoT-Report) der Börse ICE Endex, dass die spekulativen Anleger ihre Netto-Short-Positionen wieder ausbauten. Dies ist insbesondere auf den Rückgang von Long-Positionen mit den fallenden CO2-Preisen zurückzuführen. Während in KW 23 die Long-Position noch 40,8 Mio. EUAs betrug, wurde diese um 3,3 Mio. EUAs auf 37,5 Mio. EUAs in KW 24 reduziert. Die Short-Position hat sich demgegenüber leicht erhöht und stieg von 50,6 Mio. EUAs (KW 23) um 0,5 Mio. EUAs auf 51,1 Mio. EUAs (KW 24). Dies führte zu einer Erhöhung der Netto-Short-Position um 3,8 Mio. EUAs auf 13,6 Mio. EUAs in KW 24. Da dies der erste Report nach der Europawahl ist, bringen die Ergebnisse einige Erkenntnisse. Die Erwartung, dass der Rechtsruck im Europaparlament und die Schwächung der grünen Parteien die Klimaanstrengungen der EU bremsen dürften, wird offenbar auch durch die Investmentfonds im EU-ETS bestätigt. Denn das Wahlergebnis könnte zur Folge haben, dass zu hohe CO2-Preise politisch nicht mehr gewünscht sind, um die Wirtschaft mit den sowieso schon hohen Energiepreisen nicht noch weiter zu belasten. Die 100-Euro-Marke scheint politisch in weite Ferne gerückt zu sein.Cover Ratio mehrfach bei 1,51Bereits am Freitag zeigte sich der Preis der Primärmarktauktion rückläufig und fiel auf 68,41 Euro/t CO2 zurück (Bid-to-Cover-Ratio: 1,88). Nach dem schwachen Freitagshandel am Sekundärmarkt reagierte die Versteigerung am Montag mit einem erneuten Rücksetzer und erzielte einen Auktionspreis von 66,66 Euro/t CO2 (Cover Ratio: 1,51). In den Folgetagen stabilisierte sich der Preis etwas. Am Dienstag betrug der Auktionspreis 66,97 Euro/t CO2 (Cover Ratio: 1,51). Die polnische Versteigerung am Mittwoch erzielte einen Preis von 67,75 Euro/t CO2 (Cover Ratio: 1,62). Am Donnerstag stieg der Preis der Auktion auf 68,61 Euro/t CO2 (Cover Ratio: 1,51).Autoren: Tobias Waniek"
}