{
    "title": "Dunkelflaute stützt EUA-Nachfrage",
    "date": "2024-11-14 12:00:00",
    "text": "Nach einem vergleichsweise ruhigen Handel in der ersten Hälfte der KW 45 nahm das Kaufinteresse zum Wochenende hin deutlich zu. Nach einem Tagestief bei 63,65 Euro/t CO2 stieg der EUA-Dezember-24-Future am vergangenen Donnerstag bis Handelsschluss noch um 3,4 Prozent auf 66,25 Euro/t CO2. Am Freitag setzte sich der Aufwärtstrend mit einem Tages- und Wochenhoch bei 68,28 Euro/t CO2 fort. Aus der Handelswoche ging es dann mit einem Wochenplus von 5,8 Prozent auf 67,69 Euro/t CO2. Das Wochentief wurde bei 62,37 Euro/t CO2 markiert. Eine geringe Windeinspeisung hat zu einem starken Anstieg der Stromproduktion aus konventionellen Kraftwerken geführt. Dies hat auch die Nachfrage nach CO2-Zertifikaten gestützt und die Preise getrieben.Am Montag der Handelswoche 46 ging es zunächst weiter aufwärts, und das Verschmutzungsrecht erreichte ein Hoch von 68,8 Euro/t CO2. Die EUAs schlossen mit einem kleinen Minus von 0,1 Prozent bei 67,6 Euro/t CO2. Am Dienstag kehrte sich das Bild um, und der zwischenzeitliche Verkaufsdruck ließ im Handelsverlauf wieder nach. Nach einem Tagestief bei 65,76 Euro/t CO2 stabilisierten sich die Kurse und beendeten den Handelstag bei 67,14 Euro/t CO2 (minus 0,7 Prozent). Am Mittwoch fiel das Verschmutzungsrecht auf ein Tief von 65,39 Euro/t CO2, schloss jedoch bei 66,37 Euro/t CO2 (minus 1,2 Prozent). Am Donnerstag sorgen Meldungen zu möglichen Einschränkungen des Gasangebots für Kaufinteresse an den Energiemärkten, was auch auf die CO2-Zertifikate abfärbt. Um 12 Uhr notierte der EUA-Dezember-Future 2,4 Prozent fester bei 67,96 Euro/t CO2.Investmentfonds senken Netto-Shortposition weiterDie Investmentfonds im EU-ETS haben ihre Netto-Shortposition in der vergangenen Woche deutlich reduziert. Nachdem sich diese bereits in KW 44 um 4,5 Mio. EUAs auf 10,6 Mio. EUAs verringert hatte, sank die Netto-Shortposition mit Stand 8. November um 8,1 Mio. EUAs auf 2,5 Mio. EUAs und damit auf den niedrigsten Stand seit 15 Monaten. Insbesondere die Long-Positionen wurden erhöht, und zwar um 5,4 Mio. EUAs auf 44,5 Mio. EUAs. Die Short-Positionen reduzierten sich um 2,8 Mio. EUAs auf 47,1 Mio. EUAs. Angesichts der geopolitischen Unsicherheiten und einer starken Nachfrage durch die Dunkelflaute in der Vorwoche ist die Stimmung der spekulativen Marktteilnehmer offenbar nicht mehr bearish. Sollte die Position in nächster Zeit gar auf Netto-Long gedreht werden, wäre dies als bullishes Signal zu werten.Weltweite CO2-Emissionen steigen weiter anLaut einer Studie des Global Carbon Project (GCP) wird die EU ihre CO2-Emissionen in diesem Jahr voraussichtlich um fast 4 Prozent senken. Dies ist zum einen auf höhere Einspeisungen der erneuerbaren Energien zurückzuführen. Da der Grund jedoch auch bei der schwachen Wirtschaft liegt, ist die Zahl nicht ganz so positiv zu betrachten. Zudem werden die globalen Emissionen in diesem Jahr voraussichtlich 37,4 Mrd. t erreichen, was einem Anstieg von 0,8 Prozent gegenüber dem Vorjahr entspricht. Die Kohle macht weiterhin den größten Anteil der fossilen Energieträger aus, allerdings nehmen die Emissionen aus der Kohleverbrennung aktuell nur leicht zu (plus 0,2 Prozent) im Vergleich zu den höheren Anstiegen bei Öl (plus 0,9 Prozent) und Gas (plus 2,4 Prozent). Besonders auffällig ist der starke Anstieg des CO2-Ausstoßes in Indien im Jahr 2024 (plus 4,6 Prozent) – und zwar bei allen Energieträgern. Laut Judith Hauck, Umweltforscherin am Alfred-Wegener-Institut (AWI), wächst der Energiebedarf dort schneller als der Ausbau erneuerbarer Energien. In China hingegen steigen die CO2-Emissionen nur leicht um 0,2 Prozent, wobei die Emissionen aus Öl sogar zurückgehen. Dies hängt laut Hauck mit der Mobilitätswende hin zur Elektromobilität zusammen, die in China bereits fortschreitet.‍"
}