{
    "title": "enerchase CO2-Marketbericht KW 18",
    "date": "2024-05-02 15:00:00",
    "text": "CO2-Handel mit hoher VolatilitätDas Auf und Ab der ersten Hälfte der KW 17 setzte sich auch zum Wochenausklang weiter fort. So stieg das CO2-Zertifikat am Donnerstag noch weiter an, musste aber einen Teil der Gewinne am Freitag wieder abgeben. Insgesamt ergab sich in der Handelswoche ein Verlust von 1,47 Prozent auf 67,51 Euro/t CO2. Das Wochenhoch lag bei 69,97 Euro/t CO2, das Wochentief wurde bei 64,75 Euro/t CO2 markiert.Auf und Ab mit steigendem KaufdruckZum Wochenstart am Montag zeigten sich die Emissionsrechte schwach. Der EUA Dez.24-Future schloss 2,53 Prozent im Minus bei 65,80 Euro/t CO2. Am Dienstag meldeten sich dann die CO2-Bullen wieder zurück, und der Dezember-Future stieg um 5,17 Prozent auf 69,20 Euro/t CO2. Im eingeschränkten Handel am Mittwoch aufgrund des Feiertages gab das Verschmutzungsrecht wieder ab und verlor 1,86 Prozent auf 67,91 Euro/t CO2. Gut erholt zeigen sich die Bullen nach dem Feiertag. Am Donnerstagnachmittag gegen 14 Uhr notierte das CO2-Zertifikat knapp 5 Prozent fester bei 71,30 Euro/t CO2.Abbau der EUA Netto-Short-PositionDerweil ließ der jüngste CoT-Report für die EUAs mit Datenstand vom 26.04. einen weiteren, wenn auch nur geringfügigen Abbau der Netto-Short-Position der Investmentfonds erkennen. Diese wurde um 1,1 Mio. EUAs weiter reduziert, was ein Hinweis darauf sein kann, dass die finanziell starken Player nicht mehr an die Fortsetzung des Abwärtstrends bei den EUAs glauben. So wurden die Long-Positionen um 2,9 Mio. EUAs auf 33,8 Mio. EUAs ausgebaut. Die Short-Positionen wurden ebenfalls erhöht, allerdings nur um 1,8 Mio. EUAs auf 52,3 Mio. EUAs.Preisprognosen bei EUAs gesenktAnalyse-Häuser und Banken haben ihre Preisprognosen für die CO2-Zertifikate für die Jahre 2024 bis 2026 gesenkt, nachdem die vom europäischen Kohlenstoffmarkt erfassten Emissionen im vergangenen Jahr ein Rekordtief erreichten. EU-Allowances (EUAs) werden im Durchschnitt für 63,96 Euro/t CO2 in diesem Jahr und 74,00 Euro/t CO2 im Jahr 2025 prognostiziert, wie eine Reuters-Umfrage unter acht Analysten ergab. Das sind 13,7 Prozent bzw. 11,2 Prozent weniger als noch im Januar dieses Jahres prognostiziert.Belastend für die EUAs könnten weitere „Frontloading“-Mengen sein. Eine Analyse von LSEG kommt zu dem Ergebnis, dass die EU-Kommission durch die gesunkenen Preise für Emissionszertifikate gezwungen sein könnte, in den Jahren 2025 und 2026 noch mehr EUAs zu verauktionieren als bislang geplant. Mit den Erlösen aus diesen zusätzlichen Mengen, die eigentlich erst Ende dieses Jahrzehnts hätten versteigert werden sollen („Frontloading“), möchte die Kommission das Reformpaket REPowerEU finanzieren und plant zu diesem Zweck 20 Mrd. Euro zu erlösen. Dazu war die Kommission ursprünglich von einem Preisniveau von durchschnittlich 80 Euro/t CO2 ausgegangen. Im ersten Quartal lag der Auktionspreis im Durchschnitt jedoch nur bei 59 Euro/t CO2. Dadurch fehlen für das REPowerEU-Paket allein aus diesem Quartal mehr als 500 Mio. Euro.Primärmarktauktion wiederholt schwachen WochenstartErneut zeigte sich die Primärmarktauktion zum Wochenstart am Montag schwach. Nach einem Auktionspreis von 65,66 Euro/t CO2 am Freitag fiel der Kurs der Versteigerung am Montag auf 63,52 Euro/t CO2. Die Bid-to-Cover Ratio war mit 1,50 ebenfalls erneut schwach. Am Dienstag erholte sich der Kurs der Versteigerung auf 65,26 Euro/t CO2 (Cover Ratio: 1,42). Nach der feiertagsbedingten Auktionspause am Mittwoch erzielte die Versteigerung am Donnerstag einen Preis von 68,10 Euro/t CO2 (Cover Ratio: 1,66).Autoren: Tobias Waniek "
}