{
    "title": "enerchase CO2-Marktbericht KW 20",
    "date": "2024-05-16 15:00:00",
    "text": "Netto-Short-Position der Investmentfonds sinkt weiterNach einer volatilen ersten Wochenhälfte in der KW 19 setzte sich auch in den letzten beiden Handelstagen der Woche keine Marktpartei durch. So stiegen die EUAs (Dez.24) am Donnerstag um 2,4 Prozent an und markierten am Freitag das Wochenhoch bei 75,50 Euro/t CO2. Am Tages- und Wochenende notierte das Verschmutzungsrecht aber deutlich tiefer bei 71,59 Euro/t CO2, womit auf Wochensicht ein kleines Minus von 0,4 Prozent in der Bilanz stehen blieb. Das Wochentief wurde bei 69,58 Euro/t CO2 markiert.Volatiler Handel um 70 Euro/t CO2Zum Wochenstart am Montag konnten die CO2-Bären den Schwung aus dem schwachen Ausklang der KW 19 zunächst mitnehmen und der EUA Dez.24-Future schloss 2,21 Prozent im Minus bei 70,07 Euro/t CO2. Das Tagestief bei 68,70 Euro/t CO2 konnte allerdings nicht gehalten werden. Nach einer schwächeren Eröffnung am Dienstag und einem Tagestief bei 69,02 Euro/t CO2, ging es nach der Primärmarktauktion um 11 Uhr im Tageshoch wieder aufwärts bis auf 71,32 Euro/t CO2. In den letzten zwei Handelsstunden meldeten sich die CO2-Bären dann wieder zurück, so dass es mit einem Mini-Plus von 0,04 Prozent bei 70,10 Euro/t CO2 aus dem Handel ging. Auch am Mittwoch zeigten die Emissionszertifikate ein volatiles Handelsgeschehen. So ging es im Tageshoch am Vormittag bis auf 71,83 Euro/t CO2 für den Dezember-Future hinauf. Nach 11 Uhr erhöhte sich jedoch der Verkaufsdruck, so dass der EUA Dez.24-Future 1,3 Prozent leichter bei 69,19 Euro/t CO2 aus dem Handel ging. Bemerkenswert ist dabei, dass der CO2-Preis bis kurz vor 11 Uhr noch angestiegen ist, denn üblicherweise wird um diese Zeit das Ergebnis der Primärmarktauktion veröffentlicht. Die nur alle zwei Wochen stattfindende polnische Auktion blieb am gestrigen Mittwoch allerdings aus. Dennoch schien der Markt auf diese Uhrzeit zu reagieren. Am Donnerstag geht es zum Zeitpunkt der Berichterstellung weiter in Richtung Norden. Gegen 12 Uhr notierte das CO2-Zertifikat auf der 70-Euro-Marke.Netto-Short-Position sinkt weiterMit einem Rückgang der Netto-Short-Position in der vergangenen Handelswoche 19 von 12,7 Mio. EUAs auf nun 11,4 Mio. EUAs sank die Positionierung der Investmentfonds im EU-ETS die fünfte Woche in Folge. Hintergrund ist ein stärkerer Ausbau der Long-Position. So stieg zwar die Short-Position um knapp 1 Mio. EUAs auf 51,6 Mio. EUAs. Die Long-Positionen wurden aber um 2,3 Mio. EUAs auf 40,2 Mio. EUAs ausgebaut. Auch wenn die „starken Hände“ damit offensichtlich nicht mehr so pessimistisch auf den CO2-Handel schauen, gibt es offenbar dennoch Marktteilnehmer mit einer bearishen Markteinschätzung. Angesichts eines erwarteten „Wirtschaftswachstums“ von 0,2 Prozent für Deutschland mag dies nur bedingt überraschen.Schwache Nachfrage bei PrimärmarktauktionDie Primärmarktauktion startete am Montag mit einem Auktionspreis von 68,48 Euro/t CO2, bei einer Bid-to-Cover Ratio von 1,67. Am Dienstag fiel der Preis der Versteigerung auf 67,67 Euro/t CO2 zurück, bei einer schwachen Cover Ratio von 1,5. Nach der Auktionspause am Mittwoch aufgrund des zweiwöchigen Rhythmus der polnischen Auktion, erzielte die EEX-Auktion am Donnerstag einen Preis von 68,26 Euro/t CO2. Die Cover Ratio war mit 1,52 erneut schwach.Autoren: Tobias Waniek, Stefan Küster‍"
}