{
    "title": "EUAs stabilisieren sich auf 60-Euro-Marke",
    "date": "2024-10-17 03:25:00",
    "text": "In der Handelswoche 41 zeigten sich die Emissionszertifikate zu Beginn schwach und erreichten am Mittwoch, den 9. Oktober, das Wochentief bei 59,95 Euro/t CO2. Die 60-Euro-Marke hielt jedoch als wichtige Unterstützung, woraufhin es bereits am Mittwochnachmittag wieder aufwärtsging. Der Kaufdruck setzte sich am Donnerstag fort, und die Preise markierten mit 65,21 Euro/t CO2 das Wochenhoch. Nach einem ruhigen Freitagshandel schloss die Woche mit einem Plus von 5,6 Prozent bei 64,88 Euro/t CO2.Der positive Schwung hielt zu Beginn der KW 42 an, und am Montag verzeichneten die EUAs erneut einen Anstieg. Der Kurs erreichte ein Tageshoch von 66,18 Euro/t CO2 und schloss mit einem Plus von 1,7 Prozent bei 65,95 Euro/t CO2. Am Dienstag fiel der Preis intraday auf ein Tief von 64,17 Euro/t CO2, bevor ein Teil der Verluste wieder egalisiert wurde. Die CO2-Zertifikate schlossen um 1,0 Prozent leichter bei 65,28 Euro/t CO2. Am Mittwoch kam es zu einem stärkeren Kursrückgang. Nachdem der Kurs ein Tageshoch von 65,63 Euro/t CO2 erreicht hatte, fiel er auf ein Tagestief von 62,80 Euro/t CO2. Der Handel endete mit einem Schlusskurs von 63,17 Euro/t CO2, was einem Minus von 3,23 Prozent entsprach. Am Donnerstagnachmittag zeigen sich die Bären etwas stärker. Nach einer Trading-Range zwischen 63,64 Euro/t CO2 auf der Ober- und 62,82 Euro/t CO2 auf der Unterseite notiert der EUA Dezember-Future um 15 Uhr mit einem Minus von 0,4 Prozent bei 62,90 Euro/t CO2.Hohes Kaufinteresse auf 60-Euro-MarkeDie aktuellen Daten des CoT-Reports der ICE Endex-Börse zeigen, dass spekulative Marktteilnehmer ihre Netto-Short-Positionen für CO2 in der letzten Woche leicht reduzierten. Diese blieben jedoch nahe einem Sechs-Monatshoch. Die Netto-Short-Position betrug am vergangenen Freitag 24,1 Mio. EUAs, ein Rückgang um 2,2 Mio. EUAs gegenüber der Vorwoche. Insbesondere die Long-Positionen wurden aufgestockt und erhöhten sich um 2 Mio. EUAs auf 41,6 Mio. EUAs, während die Short-Positionen leicht um 0,2 Mio. EUAs auf 65,7 Mio. EUAs sanken.Der dynamische Kursprung auf der 60-Euro-Marke von letzter Woche kann damit erklärt werden. Mit Blick auf den Wochen-Candlestick-Chart kann in der letzten Handelswoche zudem ein hohes Handelsvolumen beobachtet werden, was auf reges Kaufinteresse hindeutet. Die vorherige Abfolge hoher Handelsvolumina in Wochen mit fallenden Preisen ist somit beendet. Die KW 41 stellt sogar eine Handelswoche mit dem vierthöchsten Volumen des Jahres dar. Auf der 60-Euro-Marke zeigte sich somit eine hohe Kaufbereitschaft, weshalb diese Marke auch künftig von besonderem Interesse bleiben dürfte, sollte sie nochmals angelaufen werden. Hier besteht künftig ein starker Support.Primärmarktauktion zeigt SchwächeDie Primärmarktauktion an der EEX erreichte am Montag 65 Euro/t CO2 (Cover Ratio: 1,86), nachdem der Auktionspreis am Freitag zuvor noch bei 63,71 Euro/t CO2 lag. Am Dienstag sank der Auktionspreis auf 64,08 Euro/t CO2 (Cover Ratio: 1,49). Nach der Auktionspause am Mittwoch, aufgrund des zweiwöchigen Rhythmus der polnischen Auktion, betrug der Preis am Primärmarkt 63,10 Euro/t CO2 (Cover Ratio: 1,69).Autor: Tobias Waniek von enerchase‍"
}