{
    "title": "EUAs fallen auf wichtigen Support bei 65 Euro/t CO2",
    "date": "2024-09-12 14:35:00",
    "text": "Am Donnerstag vergangener Woche lag der Schlusskurs bei 66,2Euro/t CO2, nachdem der Höchstwert des Tages noch bei 67,68 Euro/t CO2 lag. Am Freitag stieg der Schlusskurs auf 66,5 Euro/t CO2, was einem Anstieg von 0,45Prozent entspricht. Am Montag dieser Woche erreichte der Schlusskurs des EUA-Dezember-Futures mit 66,52 Euro/t CO2 nahezu den gleichen Wert wie am Freitag. Am Dienstag gab es hingegen einen deutlichen Rückgang um 2,41 Prozent. Der Schlusskurs sank auf 64,92 Euro/t CO2, wobei der höchste Preis bei 67,18 Euro/tCO2 und der niedrigste Wert bei 64,76 Euro/t CO2 lag.Am Mittwoch erholte sich der EUA-Preis wieder. Der Schlusskurs stieg auf 66,4 Euro/t CO2, was einem Anstieg von 2,3 Prozententsprach. Die Tageshöchst- und -tiefstwerte lagen bei 66,53 Euro/t CO2 bzw.64,71 Euro/t CO2. Am Donnerstag fällt der Preis für ein Verschmutzungsrecht zum Zeitpunkt der Erstellung dieses Marktberichts um 0,8 Prozent auf 65,86 Euro/tCO2.65-Euro-Marke als starker SupportBisher war die Woche geprägt von volatilen Bewegungen der EUAs, wobei es nach einem signifikanten Rückgang am Dienstag zu einer Erholung am Mittwoch kam. Dennoch zeigt der Markt eine insgesamt instabile Entwicklung, was auf Unsicherheiten und weitere Schwäche hindeutet. Allerdings darf nicht außer Acht gelassen werden, dass es sich rund um die 65-Euro-Marke um eine starke charttechnische Support-Zone handelt, welche bereits mehrfach in der Vergangenheit Kaufinteresse unter den Marktteilnehmer auslöste. Vor dem Hintergrund der Compliance-Frist Ende September könnten einige physische Hedger das aktuelle Preisniveau als attraktiv bewerten und Kaufaktivitäten vornehmen. Netto-Short-Position im EUA-Markt steigt wiederAm Mittwoch wurde der EUA CoT-Report an der Börse ICE Endex veröffentlicht. Seit Februar dieses Jahres wurde die Netto-Short-Position der Investmentfonds von damals 39 Mio. EUAs bis Mai auf ein Niveau von 6,7 Mio. EUAs kontinuierlich abgebaut. Nachdem die Positionierung aus Long- und Short-Positionen Ende Mai nahezu flat war, begann ein erneuter Aufbau der Netto-Short-Position bis Ende Juli bis auf 25,5 Mio. EUAs. Von Ende Juli bis zum 23. August begann wieder eine Phase der Reduzierung der Netto-Short-Position bis auf 4,8 Mio. EUAs. Nachdem also die Investmentfonds wieder nahezu flat waren, beginnt seit Ende August nun wieder eine stete Erhöhung der Netto-Short-Position. Der gestrige CoT-Report zeigt einen weiteren Anstieg bis auf14,2 Mio. EUAs netto-short mit Datenstand 6. September (letzte Woche Freitag).Ggf. erwartet uns nun wieder eine Phase wie von Ende Mai bis Ende Juli, in welcher die Spekulanten erneut damit beginnen, die Short-Positionen aufzustocken. Der Anstieg der Netto-Short-Position um 7,5 Mio. EUAs (von 6,7Mio. EUAs mit Datenstand 30. August) auf nun wieder 14,2 Mio. EUAs (Datenstand6. September) macht bei diesem Prozess möglicherweise den Anfang. Kurzum, nachdem die Investmentfonds Ende August wieder nahezu flat waren, kann nun wieder auf eine neue Kursrichtung spekuliert werden und die scheint abwärtsgerichtet. Politische Entscheidungen in Brüssel vertagtEigentlich sollte diese Woche die neue EU-Kommissionvorgestellt werden. Kommissionspräsidentin von der Leyen benötigt aber offenbar noch mehr Zeit, um ihr Team zusammenzustellen. Offiziell geht es um die neue Kandidatin Sloweniens, die vom dortigen Parlament erst noch bestätigt werden muss. Möglicherweise passiert dies am Freitag. Slowenien hatte auf Bitten von der Leyens seinen ursprünglichen männlichen Kandidaten zurückgezogen und eine Frau präsentiert, um die Geschlechterverteilung der Kommission auszugleichen. Eventuell gibt es dafür ein einflussreicheres Ressort, wie die Neue Züricher Zeitungschreibt. Für den Energiemarkt und nicht zuletzt für das politische Instrument der CO2-Zertifikate wird es spannend, wer die Ressorts Klima und Energieübernehmen soll. ‍"
}