{
    "title": "EUAs nähern sich 80-Euro-Marke",
    "date": "2025-01-16 13:00:00",
    "text": "Nach einer schwächeren ersten Wochenhälfte in der KW 2 brachte der Donnerstag eine Erholung um 1,8 Prozent auf 73,46 Euro/t CO2. Auch am Freitag setzte sich die Aufwärtsbewegung fort: der EUA-Dezember-25-Future beendete die Handelswoche bei 74,79 Euro/t CO2 (minus 1,8 Prozent auf Wochensicht). Das Wochentief lag bei 71,55 Euro/t CO2, das Wochenhoch bei 76,15 Euro/t CO2.Am Montag der KW 3 blieb das Kaufinteresse bei den CO2-Zertifikaten hoch. Das Verschmutzungsrecht stieg um 2,8 Prozent auf 76,92 Euro/t CO2. Am Dienstag kam es zunächst zu einer Abwärtskorrektur bis auf 75,75 Euro/t CO2 im Tagestief. Am späten Nachmittag erholten sich die Notierungen allerdings auf das Vortagesniveau und einen Schlusskurs bei 76,96 Euro/t CO2. Am Mittwoch nahmen die CO2-Bullen den Schwung weiter mit, und das Emissionsrecht schloss 1,3 Prozent fester bei 77,98 Euro/t CO2 (Tageshoch: 78,95 Euro/t CO2).Am Donnerstag kann sich bislang keine Marktpartei klar durchsetzen. Im bisherigen Handelsverlauf notierte der Dezember-Future zwischen 78,75 Euro/t CO2 auf der Oberseite und 77,25 Euro/t CO2 auf der Unterseite. Gegen 13 Uhr notierte das CO2-Zertifikat mit einem leichten Minus von 0,3 Prozent bei 77,73 Euro/t CO2.Spekulanten setzen weiter auf steigende CO2-PreiseIm Einklang mit der starken Aufwärtsbewegung zum Wochenausklang der KW 2 zeigen auch die Daten des CoT-Reports der ICE Endex eine weitere Zunahme der Netto-Long-Position der Investmentfonds für die Woche zum 10. Januar. Die finanziellen Spieler begannen seit Ende letzten Jahres verstärkt damit, Long-Positionen aufzubauen. Von August 2023 bis November 2024 lag eine Netto-Short-Position am CO2-Markt an der ICE Endex vor. Seit zwei Monaten liegt jedoch wieder eine Netto-Long-Position vor, die scheinbar kontinuierlich weiter aufgestockt wird. Die jüngsten Daten für die Handelswoche 2 zeigen einen Anstieg der Long-Positionen um 9,9 Mio. EUAs auf 68,6 Mio. EUAs, während die Short-Position leicht um 0,5 Mio. EUAs auf 39,5 Mio. EUAs anstieg. Damit erhöhte sich die Netto-Long-Position insgesamt um 9,4 Mio. EUAs auf 29,0 Mio. EUAs. Die finanziellen Spieler setzen im Jahr 2025 offenbar auf steigende CO2-Preise.Politisch hohe Volatilität am CO2-MarktLaut einem Bericht von LSEG wurde die deutsche Regierung dazu aufgefordert, die jüngste Reform des EU-Emissionshandelssystems (ETS) noch vor den Bundestagswahlen am 23. Februar umzusetzen. Dabei gibt es einige Punkte, die relevant sind. Zum einen soll der nationale CO2-Preis für Wärme und Verkehr, der aktuell bei 55 Euro/t CO2 liegt, um ein weiteres Jahr verlängert werden. Parallel dazu äußern sich allerdings Länder wie Frankreich und Tschechien kritisch hinsichtlich der Einführung des neuen ETS-2-Systems, das ab 2026 oder 2027 geplant ist. Dieses System betrifft Bereiche wie Verkehr, Wärme und möglicherweise Abfall und wird erhebliche Auswirkungen auf die Preise in diesen Sektoren haben. Die Debatte spiegelt die Herausforderung wider, wirtschaftliche Belastungen in der Bevölkerung und Klimaschutzmaßnahmen in Einklang zu bringen. In den nächsten Wochen werden diese Themen auch den Wahlkampf betreffen, was Auswirkungen auf den CO2-Preis haben dürfte. Es ist von einer weiterhin hohen Volatilität auszugehen.Primärmarkt schließt sich Preisrally anDie Kursrally am Sekundärmarkt zeigte sich auch bei den Auktionen am Primärmarkt. Nachdem der Versteigerungspreis an der EEX am Freitag noch bei 70,63 Euro/t CO2 lag, erzielte die Auktion am Montag einen Preis von 74,40 Euro/t CO2 (Bid-to-Cover Ratio: 1,49). Am Dienstag stieg der Auktionspreis auf 74,45 Euro/t CO2 (Cover Ratio: 1,54). Nach der Pause der zweiwöchentlichen polnischen Auktion am Mittwoch lag der Preis am Primärmarkt am Donnerstag bei 75,70 Euro/t CO2 (Cover Ratio: 1,63).‍"
}