{
    "title": "EUAs volatil auf Richtungssuche",
    "date": "2024-12-05 14:00:00",
    "text": "In der zweiten Wochenhälfte der vergangenen KW 48 setzte sich die Schwäche auch am Donnerstag fort. Der CO2-Dezember-Future verzeichnete einen Rückgang um 0,8 Prozent auf 67,88 Euro/t CO2. Der Freitag brachte dann eine leichte Erholung der EUAs auf einen Wochenschlusskurs von 68,39 Euro/t CO2. Auf Wochensicht blieb dennoch ein Verlust von 1,1 Prozent zu verbuchen.Nach dem Wochenende startete der Montag mit einem Aufschwung. Der Tageshöchststand lag bei 70,14 Euro/t CO2. Die CO2-Bullen konnten das Kaufinteresse aber nicht halten, sodass der Handel bei 68,60 Euro/t CO2 beendet wurde (plus 0,3 Prozent). Am Dienstag gaben die Preise der Verschmutzungsrechte nach und schlossen 0,5 Prozent leichter bei 68,26 Euro/t CO2. Am Mittwoch setzte sich die Baisse fort. Das CO2-Zertifikat ging 0,3 Prozent leichter bei 68,05 Euro/t CO2 in den Feierabend. Der Tagestiefstpreis wurde bei 67,28 Euro/t CO2 markiert. Auch am Donnerstag versuchen beide Marktparteien das Handelszepter zu übernehmen. Nach einer bisherigen Handelsspanne zwischen 68,69 Euro/t CO2 auf der Ober- und 67,54 Euro/t CO2 auf der Unterseite notiert das Emissionsrecht gegen 13:30 Uhr mit einem kleinen Minus von 0,2 Prozent bei 67,91 Euro/t CO2.Spekulanten reduzieren Positionen im EU-ETSAm Mittwoch standen abermals die neuesten CoT-Daten der ICE Endex im Fokus. Bei den EUAs zeigten die Daten mit Stand 22. November einen weiteren Ausbau der Netto-Long-Position, was grundsätzlich ein bullishes Signal ist. Die Daten mit Stand 29. November bestätigten die Netto-Long-Position der Investmentfonds. Die Netto-Long-Position stieg um 2,9 Mio. EUAs auf 11,9 Mio.EUAs. Allerdings wurden sowohl die Long- als auch die Short-Position reduziert, und Positionen werden somit insgesamt weiter abgebaut. Die Long-Position verringerte sich leicht um 0,3 Mio. EUAs, während die Short-Position um 3,2 Mio. EUAs zurückging. Es zeigt sich, dass das Open Interest angesichts des baldigen Kontraktwechsels rückläufig ist, und zwar früher und deutlicher als im vergangenen Jahr. Der EU-ETS als Anlageklasse scheint somit weiter an Attraktivität zu verlieren, was auch den Einfluss der spekulativen Marktteilnehmer auf die Notierungen schwächt. Dennoch bleibt die Positionierung der Investmentfonds ein wichtiger Signalgeber.Kommission legt Obergrenze für ETS 2 festDie Europäische Kommission hat eine Obergrenze von etwas über 1 Mio. t CO2-Emissionszertifikaten für das neue EU-Emissionshandelssystem (EU-ETS 2) für Heiz- und Verkehrsemissionen festgelegt, das 2027 starten soll. Diese Grenze basiert auf den durchschnittlichen Emissionen der Jahre 2016–2018 in den relevanten Sektoren. Eine weitere Obergrenze für 2028 wird später definiert, basierend auf den gemeldeten Emissionen von 2024–2026. Ziel ist es, bis 2030 die Emissionen in den Sektoren um 55 Prozent gegenüber 1990 zu senken. Eine Zusammenlegung des EU-ETS (Energiewirtschaft, Industrie, Luftverkehr) und des ETS 2 ist bis 2030 nicht vorgesehen. Die Europäische Kommission plant jedoch, bis zum 31. Oktober 2031 zu evaluieren, ob eine Integration des EU-ETS 2 in das EU-ETS sinnvoll ist.Autor: Tobias Waniek"
}