{
    "title": "EUAs schwächeln trotz spekulativem Kaufinteresse",
    "date": "2024-11-28 14:55:00",
    "text": "Die vergangene Handelswoche 47 schlossen die CO2-Zertifikate mit einem Gewinn ab. Trotz eines schwächeren Handels am Freitag (minus 2,1 Prozent) verzeichneten sie auf Wochensicht ein Plus von 2,5 Prozent und gingen bei 69,14 Euro/t CO2 aus dem Handel. Zuvor hatte der EUA-Dezember-24-Future am Donnerstag deutlich zugelegt und stieg um 2,3 Prozent auf 70,60 Euro/t CO2.Zum Wochenbeginn der KW 48 am Montag zeigten die Verschmutzungsrechte wieder einen Aufwärtsimpuls, und es ging im Tageshoch bis auf 71,54 Euro/t CO2 hinauf. Den Handelstag beendete der Dezember-Future dann jedoch tiefer bei 69,92 Euro/t CO2, was einen Anstieg von 1,1 Prozent markierte. Am Dienstag kühlte sich die Marktstimmung ab. Die EUAs fielen um 1,5 Prozent auf 68,88 Euro/t CO2. Auch am Mittwoch gaben die EUAs weiter nach und schlossen bei 68,42 Euro/t CO2 (minus 0,7 Prozent). Die CO2-Bären blieben am Donnerstag die stärkere Marktpartei. Um 14:30 Uhr notierten die EUAs 1,0 Prozent leichter bei 67,74 Euro/t CO2.Spekulanten bauen Netto-Long-Position weiter ausBemerkenswert ist, dass die aktuelle Kursschwäche einhergeht mit einer Erhöhung der Netto-Long-Position der spekulativen Marktteilnehmer im Europäischen Emissionshandel (EU-ETS). Die Investmentfonds im EU-ETS haben ihre Netto-Long-Positionen in der zweiten Woche in Folge ausgebaut. Mit Datenstand 22. November verzeichnete die Position einen Anstieg um 7,5 Mio. EUAs auf nun 9,0 Mio. EUAs. Die Short-Position reduzierte sich um 2,9 Mio. EUAs auf 42,6 Mio. EUAs. Gleichzeitig vergrößerte sich die Long-Position um 4,6 Mio. EUAs auf 51,5 Mio. EUAs.Einfluss der Spekulanten auf den EUA-Markt scheint abzunehmenDer Ausbau der Netto-Long-Position der Investmentfonds an der ICE Endex lässt den Schluss zu, dass die Spekulanten nicht mehr von weiter fallenden CO2-Preisen ausgehen. Seit Februar, dem Tiefpunkt der CO2-Preise in diesem Jahr, ist ein kontinuierlicher Abbau der Netto-Short-Position feststellbar. Dieser geht einher mit einem Anstieg des Preisniveaus für die CO2-Emissionsrechte. Sowohl im Markt für EUAs als auch im Gasmarkt dominieren die finanziell starken Hände das Marktgeschehen. Allerdings ist ebenfalls erkennbar, dass der Einfluss der Spekulanten auf den CO2-Preis zuletzt nachzulassen scheint. Die Netto-Short-Position wurde seit Oktober nochmals deutlicher abgebaut, jedoch hat der EUA-Preis nicht in der gleichen Intensität wie in der Vergangenheit angezogen. Gleichzeitig ist ersichtlich, dass der zuletzt erfolgte Aufbau der Netto-Long-Position primär durch einen Abbau der Short-Positionen verursacht wurde, was auch mit einem Rückgang des Open Interests einherging. Dies lässt den Schluss zu, dass spekulatives Kapital den EUA-Markt verlässt. Der Einfluss der Spekulanten auf das Marktgeschehen scheint also abzunehmen. Dabei ist allerdings auch zu beachten, dass sich der Fokus der Marktteilnehmer vom EUA-Dezember-24-Future auf den EUA-Dezember-25-Future zum Jahresende hin verlagert. Grundsätzlich ist der Aufbau einer Netto-Long-Position ein bullishes Signal, das auch zum intakten Aufwärtstrend passt. Die EUAs befinden sich oberhalb der steigenden 200-Tage-Linie, womit festgestellt werden kann, dass sich die Emissionsrechte aus charttechnischer Sicht in einem Bullenmarkt befinden.Großer EUA-Optionsverfallstag rückt näherDer große EUA-Optionsverfallstag am 11. Dezember rückt immer näher. Die Volatilität dürfte bis dahin am Markt für Emissionsrechte hoch bleiben. Große Absicherungen sind bei einem Strike-Preis von 90 Euro/t CO2 bei den Call-Optionen und bei 50 Euro/t CO2 bei den Put-Optionen erkennbar. Bei 69 Euro/t CO2 ist der kumulierte Gewinn der Stillhalter am größten. Gemäß der Max-Pain-Theorie haben die finanziell starken Hände ein Interesse daran, dass sich der Preis zum Verfallstag diesem Niveau nähert. Aktuell handelt der Dezember-24-Future bei 67,74 Euro/t CO2, also in der Nähe dieses preislichen Umfelds.Autor: Tobias Waniek von enerchase ‍"
}