{
    "title": "EUAs im Aufwärtstrend",
    "date": "2024-11-21 14:10:00",
    "text": "Nach einer vergleichsweise ruhigen ersten Wochenhälfte in der KW 46 konnte sich auch zum Wochenausklang keine Marktpartei bei den Emissionsrechten klar durchsetzen. Am Donnerstag legten die EUAs um 2,9 Prozent auf 68,26 Euro/t CO2 zu, doch der Freitag brachte eine leichte Korrektur. Mit einem Schlusskurs von 67,44 Euro/t CO2 verzeichnete der Dezember-24-Future ein kleines Wochenminus von 0,4 Prozent.Die Handelswoche 47 eröffnete hingegen mit einer klar bullishen Tendenz. Am Montag ging es für die EUAs mit einem Schlusskurs von 69,55 Euro/t CO2 um 3,1 Prozent nach oben. Mit einem Tageshoch von 70,03 Euro/t CO2 wurde zudem die 70-Euro-Marke getestet. Am Dienstag setzte eine leichte Abkühlung ein, und die CO2-Zertifikate schlossen bei 68,4 Euro/t CO2 (minus 1,7 Prozent). Am Mittwoch stieg der Preis intraday bis zu einem Tageshoch von 69,40 Euro/t CO2, schloss jedoch nahezu unverändert bei 68,35 Euro/t CO2. Am Donnerstag übernahmen die CO2-Bullen erneut das Handelszepter. Um 13:30 Uhr notierte der EUA Dez.24-Future 2,5 Prozent fester bei 70,05 Euro/t CO2.Spekulanten im EU-ETS jetzt Netto-LongGestützt werden die EUAs auch durch das gestiegene Kaufinteresse der spekulativen Marktteilnehmer. Was sich zuletzt angedeutet hatte, wurde in der vergangenen Woche Realität: Trotz einer relativ moderaten Wochenveränderung in KW 46 haben Investmentfonds im EU-ETS mit Datenstand 15.11. ihre Positionierung von Netto-Short auf Netto-Long gedreht. Nach einer Netto-Short-Position von 2,6 Mio. EUAs in KW 45 sind die Spekulanten in KW 46 mit 1,6 Mio. EUAs Netto-Long. Dabei wurde die Long-Position um 2,4 Mio. EUAs auf 47,0 Mio. EUAs erhöht, während die Short-Position um 1,7 Mio. EUAs auf 45,4 Mio. EUAs reduziert wurde. Mit dem kräftigen Anstieg in der aktuellen Handelswoche dürfte sich die Long-Position weiter ausgebaut haben. Der Wechsel auf eine Netto-Long-Position ist als bullishes Signal zu werten, da Investoren offensichtlich den Boden der EUAs als erreicht ansehen.Anstieg der Kohleverstromung stützt CO2-NachfrageAuch die Charttechnik spricht derzeit für steigende CO2-Preise. Seit Anfang November hat sich beim Dezember-Future eine untere Umkehr in Form einer inversen SKS-Formation herausgebildet, und die EUAs befinden sich seither in einem Aufwärtstrend. Die Preise liegen inzwischen oberhalb der gleitenden Durchschnitte der letzten 20, 50 und 200 Tage, was den Aufwärtstrend bestätigt. Fundamentale Faktoren, wie die gestiegenen Gaspreise, stützen die Verschmutzungsrechte zusätzlich. Da Kohlekraftwerke in der Merit Order vor Gaskraftwerken stehen, führt dies zu einer höheren Nachfrage nach EUAs.Preisanstiege am PrimärmarktAm Primärmarkt ging es zuletzt ebenfalls mehrheitlich aufwärts. Nach einem Auktionspreis von 66,78 Euro/t CO2 am vergangenen Freitag, stieg der Preis der Auktion am Montag auf 67,70 Euro/t CO2 (Bid-to-Cover Ratio: 1,63). Am Dienstag verzeichnete die Versteigerung dann einen kräftigen Preisanstieg auf 69,05 Euro/t CO2 (Cover Ratio: 1,36). Bei der polnischen Auktion am Mittwoch fiel der Preis auf 68,02 Euro/t CO2 zurück (Cover Ratio: 1,74). Das Ergebnis der Versteigerung am Donnerstag lag bei 68,79 Euro/t CO2 (Cover Ratio: 1,73).Autor: Tobias Waniek von enerchase ‍"
}