{
    "title": "Europawahl belastet CO2-Preis zum Wochenauftakt",
    "date": "2024-06-13 15:00:00",
    "text": "Nach einem robusten Start in die Woche und einem Wochenhoch bei 77,81 Euro/t CO2 am Montag, den 3. Juli, fielen die CO2-Preise im weiteren Verlauf der vergangenen Handelswoche kontinuierlich zurück. Auf Wochenschlusskursbasis gaben die CO2-Zertifikate um 3,6 Prozent auf 71,42 Euro/t CO2 ab. Das Wochentief wurde bei 70,94 Euro/t CO2 markiert.Auf und Ab im WochenverlaufZum Start in die Handelswoche 24 sanken die CO2-Preise am Montag auf ein Tagestief von 69,28 Euro/t CO2, den niedrigsten Stand seit fast einem Monat. Dieser Rückgang ist unter anderem auf die Ergebnisse der Europawahl zurückzuführen, bei der Parteien mit weniger ehrgeizigen klimapolitischen Zielen Gewinne verzeichneten. Die neue Zusammensetzung des Europaparlaments wird die zukünftige Klima- und Energiepolitik beeinflussen, da die Grünen deutlich weniger Sitze haben, während rechte Parteien Sitze gewonnen haben. Am Nachmittag erhöhte sich jedoch das Kaufinteresse, so dass es bei 70,91 Euro/t CO2 aus dem Handel ging (minus 0,7 Prozent). Am Dienstag kehrte sich die Handelsbewegung um: Der Preis für Emissionsrechte erreichte ein Tageshoch von 72,17 Euro/t CO2, konnte diese Gewinne jedoch nicht halten und schloss bei 70,46 Euro/t CO2 (minus 0,6 Prozent). Dies wiederholte sich am Mittwoch, als die CO2-Bullen lange Zeit den Markt dominierten (Tageshoch: 71,85 Euro/t CO2). In den letzten Handelsstunden übernahmen jedoch die Bären das Handelszepter, und der EUA Dez.24-Future fiel auf 70,30 Euro/t CO2 zurück (minus 0,2 Prozent). Am Donnerstag ist das Kaufinteresse am frühen Nachmittag erhöht. Um 13 Uhr notiert das CO2-Zertifikat 1,6 Prozent fester bei 71,38 Euro/t CO2.Weiterer Aufbau der Netto-Short-Position im EU-ETSDer am Mittwoch veröffentlichte CoT-Report der Börse ICE Endex zeigt für die Emissionsrechte mit Datenstand vom 07.06. einen erneuten Aufbau der Netto-Short-Position der Investmentfonds. In der vergangenen Handelswoche reduzierten die spekulativen Investoren ihre Long-Positionen mit den fallenden CO2-Preisen weiter. Während die Long-Position in der KW 22 noch 44,1 Mio. EUAs betrug, sank diese um 3,3 Mio. EUAs auf 40,8 Mio. EUAs in der KW 23. Auch die Short-Position ging von 52,2 Mio. EUAs (KW 22) um 1,5 Mio. EUAs auf 50,6 Mio. EUAs (KW 23) zurück. Dies führte zu einer Erhöhung der Netto-Short-Position um 1,8 Mio. EUAs auf 9,9 Mio. EUAs in der KW 23. Diese Erhöhung wurde also maßgeblich durch den Abbau von Long-Positionen verursacht. Dennoch lässt sich vorsichtig schlussfolgern, dass die finanzstarken Akteure dem CO2-Zertifikat derzeit keinen Sprung über die 80-Euro-Marke zutrauen. Der politische Rechtsruck im EU-Parlament ist für dieses Vorhaben auch nicht unbedingt zielführend. Die EU-Wahl war in den Daten des CoT-Reports mit Datenstand vom 07.06. noch nicht enthalten. Von daher wird der nächste CoT-Report für die KW 24, welcher am 19.06. veröffentlicht wird, mit Spannung erwartet.Primärmarktpreis schwankt um 70-Euro-MarkeIm Einklang mit dem Sekundärmarkt fiel auch der Preis der Primärmarktauktion am Montag zurück. Nach einem Auktionspreis am vergangenen Freitag von 69,90 Euro/t CO2, erzielt die Versteigerung am Montag einen Preis von 67,82 Euro/t CO2 (Bid-to-Cover Ratio: 1,46). Am Dienstag stieg der Auktionspreis auf 70,31 Euro/t CO2 (Cover Ratio: 1,43). Nach der Auktionspause am Mittwoch aufgrund des zweiwöchigen Rhythmus der polnischen Versteigerung erzielte die Primärmarktauktion am Donnerstag einen Kurs von 69,77 Euro/t CO2 (Cover Ratio: 1,78).Autoren: Tobias Waniek"
}