{
    "title": "Geopolitische Spannungen stützen CO2-Preise",
    "date": "2024-08-01 17:30:00",
    "text": "Nach dem kräftigen Kursanstieg der CO2-Preise am Mittwoch der KW 30 ging es zum Ausklang der Handelswoche noch leicht abwärts. Der EUA Dez. 24-Future beendete die Woche 2,6 Prozent leichter bei 67,71 Euro/t CO2. Das Wochentief lag bei 64,24 Euro/t CO2. Das Wochenhoch wurde bei 69,04 Euro/t CO2 markiert.Kaufdruck nimmt am Donnerstag kräftig zuDie Handelswoche 31 eröffneten die CO2-Zertifikate am Montag mit starkem Kaufinteresse. Der EUA Dezember-Future schloss 1,6 Prozent fester bei 68,78 EUR/t CO2. Am Dienstag ging das Verschmutzungszertifikat nur mit einem kleinen Minus von 0,3 Prozent bei 68,58 Euro/t CO2 aus dem Handel. Intraday notierte das Emissionsrecht im Tagestief allerdings bereits deutlich tiefer bei 67,47 Euro/t CO2. Am Mittwoch nahmen die CO2-Bullen den Schwung des festeren Nachmittagshandels mit. Zwar ging es zwischenzeitlich bis auf 68,04 Euro/t CO2 im Tagestief abwärts, stärkerer Kaufdruck am Nachmittag führte dann auf Tagesschlusskursbasis zu einem Plus von 1,0 Prozent auf 69,24 Euro/t CO2. Am Donnerstag kommt es an den Energiemärkten zu einer starken Kursrally aufgrund der unsicheren Lage im Nahostkonflikt. Auch die EUAs reagieren bullish darauf und notieren am späten Nachmittag gegen 17 Uhr 2,9 Prozent fester bei 71,23 Euro/t CO2.Hohe Stromerzeugung aus erneuerbaren EnergienIn der ersten Jahreshälfte 2024 überstieg die Stromerzeugung aus Wind- und Solaranlagen erstmals die aus fossilen Brennstoffen. Solar- und Windenergie machten 30 Prozent der gesamten Stromerzeugung in der EU aus, während fossile Brennstoffe nur einen Anteil von 27 Prozent erreichten. Auch die Stromerzeugung aus Gaskraftwerken ging in der ersten Jahreshälfte um 14 Prozent zurück und erreichte nur 29 TWh, während die Stromerzeugung aus Wasserkraft im gleichen Zeitraum um 21 Prozent auf 33 TWh anstieg. Laut der Arbeitsgruppe Energiebilanzen (AGEB) sind die CO2-Emissionen in Deutschland in der ersten Jahreshälfte entsprechend um 17 Mio. t gesunken. Aufgrund der hohen Einspeisung der Erneuerbaren sank der Einsatz von Steinkohle zur Stromerzeugung im ersten Halbjahr 2024 um 42 Prozent gegenüber dem Vorjahr. Die Stromerzeugung aus Braunkohle fiel im selben Zeitraum um 17,2 Prozent. Die Branchenverbände WindEurope und SolarPower Europe erwarten, dass die Kapazitäten von Wind- und Solaranlagen im Jahr 2024 15,8 GW bzw. 62 GW erreichen. Sollte dies realisiert werden, dürfte die Stromerzeugung aus Wind- und Solaranlagen im ersten Halbjahr 2025 die konventionelle Erzeugung aus fossilen Brennstoffen übertreffen.EEX veröffentlicht aktualisierten AuktionskalenderDer jüngste CoT-Report der Börse ICE Endex zeigt, dass die Investmentfonds in der Woche zum 26.07.24 die Short-Positionen weiter ausgebaut haben und die Netto-Short-Position sich damit vergrößert hat. Während die Long-Positionen um 234.000 EUAs reduziert wurden, stieg die Short-Position um 1,9 Mio. EUAs, womit die Netto-Short-Position um rund 2,1 Mio. EUAs auf nun 25,5 Mio. EUAs ausgebaut wurde.Zudem hat die EEX am 31. Juli einen aktualisierten Auktionskalender für 2024 veröffentlicht, welcher die Abzüge der Marktstabilitätsreserve abbildet. Demnach gibt es einen leichten Anstieg der polnischen Auktionsmenge in der Woche vom 28. August auf 2.313.500 t, während sich die Menge der gemeinsamen EU-Auktion im September auf 3.287.500 t, die deutsche Auktion auf 1.810.000 t und die polnische Auktion auf 2.833.500 t erhöht hat.Autor: Tobias Waniek"
}