{
    "title": "Gesamtumfeld für EUAs bleibt schwach",
    "date": "2024-07-18 16:30:00",
    "text": "Nach einer schwachen ersten Wochenhälfte in der KW 28 meldeten sich die CO2-Bullen im weiteren Handelsverlauf noch zurück und reduzierten den Wochenverlust auf 1,4 Prozent (Schlusskurs: 69,35 Euro/t CO2). Das Wochentief lag bei 67,60 Euro/t CO2. Das Wochenhoch wurde bei 71,85 Euro/t CO2 markiert.Starker Verkaufsdruck am MittwochnachmittagDen Schwung aus dem festeren Handel zum Ausklang der vergangenen Woche nahmen die EUAs nicht in die KW 29 mit. Am Montag startete der CO2-Dezember-Future bearish in die neue Handelswoche und beendete den Handelstag 2,5 Prozent schwächer bei 67,58 Euro/t CO2. Nach dem schwachen Wochenstart stabilisierte sich das CO2-Zertifikat leicht am Dienstag. Der EUA-Dez.24-Future beendete den Handelstag 0,5 Prozent im Plus bei 67,94 Euro/t CO2. Am Mittwoch gaben die CO2-Bären insbesondere am Nachmittag den Takt auf dem Handelsparkett an. Nach einem Tageshoch bei 68,13 Euro/t CO2 stieg das Verkaufsinteresse in den späteren Handelsstunden an, sodass das Verschmutzungsrecht auf Tagesschlusskursbasis 2,2 Prozent verlor und das Börsenparkett bei 66,42 Euro/t CO2 verließ. Auch am Donnerstag hielten die CO2-Bären das Handelszepter zunächst weiter in den Händen und markierten ein Tagestief bei 66,01 Euro/t CO2. Am Nachmittag gegen 16 Uhr stabilisiert sich der CO2-Kurs und handelt 0,6 Prozent fester bei 66,83 Euro/t CO2.Investoren wieder „shorter“Der jüngste CoT-Report für den Emissionshandel an der Börse ICE Endex zeigt, dass die Investmentfonds wieder pessimistischer werden und die Netto-Short-Position erhöht haben. Nachdem der Bericht mit Stand 5. Juli einen leichten Abbau der Netto-Short-Position zeigte, ist die Position mit Stand 12. Juli um 0,6 Mio. EUAs auf 18,1 Mio. EUAs angestiegen. Begründet ist dies vor allem mit einem Abbau der Long-Position um 0,8 Mio. EUAs auf 36,5 Mio. EUAs, während die Short-Positionen um 0,1 Mio. EUAs auf 54,6 Mio. EUAs sanken.Kostenlose EUA-Zuteilungen zu 76 Prozent abgeschlossenBelastend für die EUAs ist die Veröffentlichung der Daten zur kostenlosen Zuteilung von Zertifikaten an Industrie und Wärmeerzeugung für dieses Jahr durch die Europäische Kommission. Im Jahr 2024 werden 513,5 Mio. Tonnen kostenlose Zertifikate zugeteilt, das sind 12 Mio. Tonnen weniger als im Jahr 2023. Angesichts der schwachen Konjunktur könnte dies dazu führen, dass einige Unternehmen diese kostenlosen Zertifikate nutzen, um ihre Emissionen von 2023, die im September ausgeglichen werden müssen, zu decken, was die Nachfrage weiter reduziert, da weniger Zertifikate nachgekauft werden müssen. Die EU-Kommission hat einen Zwischenstand für den Prozess der kostenlosen EUA-Zuteilungen in diesem Jahr vorgelegt (Datenstand 11. Juli). Demnach haben die Mitgliedstaaten 76 Prozent der vorgesehenen Zertifikate bereits zugeteilt. In Deutschland ist der Prozess nahezu abgeschlossen, die Zuteilungsrate liegt bereits bei 99 Prozent. Da der Prozess auf EU-Ebene noch weiterläuft, bleibt der Preisdruck für die EUAs bestehen.Rekordwert bei der Stromerzeugung aus erneuerbaren EnergienWeniger CO2-Zertifikate wurden in diesem Jahr außerdem aus dem Stromsektor benötigt, da die Stromerzeugung aus fossilen Brennstoffen im zweiten Quartal auf den niedrigsten Stand aller Zeiten gefallen ist, während die Produktion aus erneuerbaren Energien stark zugenommen hat. Die Stromerzeugung aus fossilen Brennstoffen lag im zweiten Quartal bei 131,9 TWh, was den niedrigsten Wert aller Zeiten darstellt. Im Vergleich dazu ist die Solarenergie im zweiten Quartal auf 86,2 TWh angestiegen, was eine Steigerung um 15 Prozent zum Vorjahr bedeutet. Auch die Stromproduktion aus Windkraft hat um 9 Prozent auf 107,6 TWh zugenommen. Damit haben die erneuerbaren Energien im zweiten Quartal mit einem Anteil von 55,7 Prozent an der gesamten europäischen Stromerzeugung einen Rekordwert markiert.Autor: Tobias Waniek"
}