{
    "title": "Kopplung des EU-Emissionshandels mit UK?",
    "date": "2025-01-30 17:00:00",
    "text": "Nach einer ersten Wochenhälfte mit vergleichsweise wenig Preisveränderung zeigten die CO2-Zertifikate zum Ende der vergangenen Kalenderwoche 4 ein deutlich gestiegenes Kaufinteresse. Nach einer Handelsspanne zwischen 82 Euro/t CO2 auf der Oberseite und 78,98 Euro/t CO2 auf der Unterseite schlossen die EUAs am Donnerstag mit einem Plus von 2,1 Prozent bei 80,84 Euro/t CO2. Am Freitag setzte sich die Aufwärtsbewegung weiter fort, sodass auf Wochensicht ein Plus von 2,5 Prozent auf 81,70 Euro/t CO2 zu verzeichnen war. Das Wochenhoch lag bei 82 Euro/t CO2, das Wochentief bei 77,90 Euro/t CO2.In der aktuellen Handelswoche hatten dann zunächst die CO2-Bären Oberwasser. Am Montag fiel der CO2-Dezember-Future auf ein Tief von 79 Euro/t CO2 und schloss mit einem Minus von 3,0 Prozent bei 79,25 Euro/t CO2. Dieser Rücksetzer wurde am Dienstag teilweise wieder egalisiert. Die EUAs kletterten auf ein Hoch von 80,8 Euro/t CO2 und schlossen mit einem Plus von 1,5 Prozent bei 80,4 Euro/t CO2. Am Mittwoch folgte dann ein kräftiger Kurssprung. Das Emissionsrecht markierte mit 83,8 Euro/t CO2 ein neues Hoch und schloss 4,0 Prozent fester bei 83,65 Euro/t CO2. Am Donnerstag setzte sich die Aufwärtsbewegung zunächst fort, mit einem höheren Hoch bei 84,50 Euro/t CO2. Am Nachmittag zeigte sich allerdings stärkerer Verkaufsdruck. Gegen 17 Uhr notierte der EUA-Dezember-25-Future 1,2 Prozent im Minus bei 82,64 Euro/t CO2.Britische Regierung strebt Anschluss an EU-ETS anDer britische Premierminister Keir Starmer plant laut Financial Times, das Emissionshandelssystem des Vereinigten Königreichs wieder mit dem der Europäischen Union zu verknüpfen, um die Beziehungen zu Brüssel neu zu gestalten. Diese Meldung löste am Dienstag insbesondere bei den britischen Emissionszertifikaten (UKA) starke Kursreaktionen aus. Der UKA-Dezember-Kontrakt legte um 13,5 Prozent zu, nachdem er Anfang Januar noch ein Allzeittief markiert hatte. Seit der Trennung der Kohlenstoffmärkte nach dem Brexit werden britische Emissionszertifikate mit einem erheblichen Abschlag gegenüber denen der EU gehandelt. Eine Wiederverknüpfung der Systeme würde die Liquidität beider Märkte vertiefen und beiden Seiten beim Übergang zu Netto-Null-Emissionen helfen. Zudem könnten dadurch Grenzprobleme vermieden werden, die durch die Einführung von CO2-Grenzausgleichsmechanismen (CBAM) auf beiden Seiten entstehen könnten. Zwei EU-Beamte haben bestätigt, dass das Vereinigte Königreich beantragt hat, die Verknüpfung der ETS-Systeme und die CBAMs auf die Tagesordnung des Frühjahrsgipfels zu setzen.Am 3. Februar wird Starmer als erster britischer Regierungschef seit dem Brexit an einem Treffen des Europäischen Rates teilnehmen, das der Verteidigungs- und Sicherheitskooperation gewidmet ist. Vor dem geplanten EU-UK-Gipfel im Frühjahr diskutieren Starmer und seine Minister über neue Wege der Zusammenarbeit mit dem größten Handelspartner Großbritanniens. Die britische Regierung steht unter zunehmendem Druck der Industrie, ihr ETS mit dem der EU in Einklang zu bringen, um zusätzliche Grenzbürokratie zu vermeiden. Es gibt jedoch Bedenken, dass die Verhandlungen schwierig werden könnten, da die EU erwartet, dass das Vereinigte Königreich eine vollständige dynamische Angleichung an das EU-Recht akzeptiert.Umfeld für die EUAs stellt sich bullish darDie Investmentfonds haben ihre Netto-Long-Position gemäß neuestem CoT-Report von zuvor 41,9 auf 53 Mio. t CO2 massiv ausgebaut. Die absolute Long-Position beträgt 94 Mio. t. Der in der Datenhistorie erkennbare Rekordwert wurde im Juli 2021 erzielt, mit 109 Mio. t CO2 absolute Long-Position und 77,7 Mio. t Netto-Long-Position. Es ist also noch Luft nach oben vorhanden, und wir werten den CoT-Report insofern weiterhin bullish. Die CO2-Zertifikate sind derzeit allerdings nicht nur durch die Spekulanten getrieben. Aufgrund des geringen Windaufkommens und rückläufiger Temperaturprognosen steigt die Residuallast und somit der Einsatz fossiler Kraftwerke zur Stromproduktion. Gleichzeitig sind die Grenzkosten der Kohlekraftwerke geringer als die der Gaskraftwerke, womit sich die Kohle in der Merit Order in den nächsten Wochen vor Gas platziert (gas-to-coal-switch). Die Nachfrage nach EUAs wird dadurch ebenfalls angekurbelt.‍"
}