{
    "title": "Kräftiges Kursplus am Mittwoch",
    "date": "2024-10-24 14:40:00",
    "text": "Nach einer festeren Eröffnung der Handelswoche 42 zeigten sich die CO2-Zertifikate in der zweiten Wochenhälfte schwächer. Der EUA Dezember 2024-Future schloss am Freitag mit einem Wochenverlust von 3,5 Prozent bei 62,62 Euro/t CO2. Das Wochenhoch lag bei 66,18 Euro/t CO2, das Wochentief bei 62,22 Euro/t CO2.Zu Beginn der Handelswoche 43 setzte sich die Abwärtsbewegung am Montag fort. Der CO2-Preis fiel auf ein Tagestief von 61,36 Euro/t CO2, erholte sich jedoch leicht und schloss mit einem Minus von 1,2 Prozent bei 61,90 Euro/t CO2. Am Dienstag stabilisierten sich die Preise. Nach einem Handel zwischen 62,56 Euro/t CO2 im Tageshoch und 61,29 Euro/t CO2 im Tagestief schloss der EUA-Future 0,7 Prozent fester bei 62,31 Euro/t CO2. Am Mittwoch kam es zu einem deutlichen Kursanstieg. Der CO2-Dezember-Future erreichte ein Tageshoch von 65,36 Euro/t CO2 und schloss mit einem Plus von 4,6 Prozent bei 65,15 Euro/t CO2. Dabei zeigte sich ein hohes Handelsvolumen von 30.499 Kontrakten. Auch am Donnerstag setzten die EUAs ihren Anstieg fort. Das bisherige Tageshoch von 66,50 Euro/t CO2 konnte jedoch nicht gehalten werden, und gegen 13:30 Uhr lag der Kurs bei 65,60 Euro/t CO2 (plus 0,7 Prozent).Bemerkenswerte CO2-PreisprognosenLaut einem Bericht der SEB-Bank könnten die Preise für EU-Emissionszertifikate (EUAs) in den nächsten zwei Jahren im Bereich von 50-55 Euro/t CO2 bleiben. Ein komfortabler Überschuss an Zertifikaten stützt diese Preisstabilität. Die Gesamtmenge der im Umlauf befindlichen Zertifikate (TNAC) ist groß, während die zusätzlichen Emissionen im Vergleich dazu gering sind. Dieser Preispfad hätte zudem laut der Analyse nur geringe Auswirkungen auf die modellierten Preise in den späteren Jahren. Zudem haben die Modellberechnungen ergeben, dass auch ein Preisniveau von 60 Euro/t CO2 bis 2030 möglich wäre, ohne dass das EU-ETS in eine kritische Engpasssituation kommen würde. Dies basiert auf der Annahme, dass es zu diesem Zeitpunkt kaum noch Emissionen im Stromsektor gibt. Die Emissionsvermeidung findet dann überwiegend in den Nicht-Stromsektoren statt.Eine weitere Analyse von der Beraterfirma Veyt geht hingegen davon aus, dass sich die Preise bis 2026 verdoppeln und bis 2035 verdreifachen könnten. Auch eine Analyse von LSEG geht von steigenden CO2-Preisen ab 2026 aus. Zudem wird der europäische CO2-Markt in den Jahren 2025, 2026 und 2027 stärkeren Veränderungen unterliegen. Für 2025 wird erwartet, dass der Markt aufgrund eines Überangebots an Zertifikaten und einer geringen Nachfrage preislich unter Druck bleibt. Die Spekulanten werden weiterhin eine dominierende Rolle spielen und algorithmische Handelsstrategien verfolgen. Ab 2026 soll der CO2-Markt laut LSEG knapper werden, da weniger CO2-Zertifikate versteigert und die freien Zuteilungen für die Industrie reduziert werden. Insbesondere die Luftfahrt wird bis 2026 keine kostenlosen Zuteilungen mehr erhalten, während auch die Schifffahrt stärker in den Emissionshandel einbezogen wird.Primärmarktauktion steigt in Richtung 65 Euro/t CO2Die Primärmarktauktion an der EEX erreichte am Montag 62,30 Euro/t CO2 (Cover Ratio: 1,59), nach einem Auktionspreis von 61,90 Euro/t CO2 am Freitag. Am Dienstag sank der Auktionspreis auf 61,22 Euro/t CO2 (Cover Ratio: 1,60). Im Einklang mit dem festeren Sekundärmarkt stiegen auch die Preise am Primärmarkt. Am Mittwoch betrug der Auktionspreis 63,75 Euro/t CO2 (Cover Ratio: 1,75), und am Donnerstag stieg der Preis weiter auf 64,60 Euro/t CO2 (Cover Ratio: 1,57).Autor: Tobias Waniek von enerchase‍"
}