{
    "title": "Netto-Short-Position auf 3-Monatshoch",
    "date": "2024-08-26 21:45:00",
    "text": "Anfang dieser Handelswoche am Montag setzte der CO2-Dezember-Future seine positive Preisentwicklung zunächst fort, eröffnete bei 72,5 Euro/t CO2 und erreichte ein Tageshoch bei 73,8 Euro/t CO2. Trotz eines leichten Rückgangs auf ein Tief bei 72,01 Euro/t CO2 schloss das Verschmutzungsrecht bei 73,14 Euro/t CO2. Am Dienstag eröffnete der CO2-Markt bei 72,94 und erreichte ein neues Hoch von 74,75 Euro/t CO2, bevor er bei 73,07 Euro/t CO2 schloss. Obwohl der Schlusskurs unter dem Tageshoch lag, blieb die allgemeine Richtung zunächst noch positiv. Doch am Mittwoch eröffnete der Future bei 73,29 Euro/t CO2 und erreichte ein Hoch von 73,83 Euro/t CO2, bevor er auf ein Tief von 71,68 Euro/t CO2 fiel und bei 72,14 Euro/t CO2 den Handelstag beendete. Dies deutete bereits auf eine Umkehr des vorherigen positiven Trends hin. Am Tag der Erstellung dieses Marktberichts (Donnerstag) eröffnete der CO2-Dez-Future bei 72,42 Euro/t CO2, erreichte ein bisheriges Tageshoch bei 72,64 Euro/t CO2 und stand am Nachmittag bei 71,36 Euro/t CO2. Dies zeigt weitere mögliche Fortsetzung des Preisrückgangs, nachdem der Markt in den vorangegangenen Tagen bereits an Schwung verloren hatte.CO2-Preise profitieren von sinkenden KohlepreisenDie sinkenden Kohlepreise haben die CO2-Preise zunächst weiter steigen lassen und am Dienstag zu einem Zwei-Monatshoch bei 74,75 Euro/t CO2 geführt. Durch die im Verhältnis zu Gas niedrigeren Kohlepreise wird Kohle in der Stromerzeugung wettbewerbsfähiger, was zu einer erhöhten Nachfrage nach CO2-Zertifikaten führt. Aufgrund der hohen Gaspreise befinden sich die Gewinnmargen von Gaskraftwerken derzeit im negativen Bereich, während die Gewinnmargen von Steinkohlekraftwerken im positiven Bereich liegen. Laut der Website des Fraunhofer ISE ist auch die Stromerzeugung aus Braunkohle im Vergleich zum Vorjahreszeitraum um etwa 20 Prozent auf 5.546 GWh gestiegen. Allein in der letzten Woche lag die Stromerzeugung aus Braunkohle um 24 Prozent höher als im gleichen Zeitraum des Vorjahres und erreichte 1.378 GWh. Trotz dieser Entwicklungen bleibt die Kohlenachfrage in der Stromerzeugung insgesamt rückläufig.CO2-Markt: Short-Position auf 3-MonatshochDie Netto-Short-Position spekulativer Investoren am CO2-Markt sind in der vergangenen Woche auf -6,8 Millionen Tonnen gestiegen und nähern sich damit einem 3-Monatshoch. Dies markiert den dritten wöchentlichen Anstieg in Folge, begleitet von einem Anstieg der Long-Positionen um fast 6,5 Millionen Tonnen, dem größten wöchentlichen Zuwachs in diesem Jahr. Die gesamten Shortpositionen sanken auf knapp 49 Millionen Tonnen, was einem Rückgang von 1,6 Millionen Tonnen im Vergleich zur Vorwoche entspricht. ‍"
}