{
    "title": "Optionsverfall und „Rolleffekte“",
    "date": "2024-12-12 13:00:00",
    "text": "Nach einer ersten Wochenhälfte mit vergleichsweise moderaten Preisveränderungen ging es zum Wochenausklang der KW 49 noch stärker auf und ab bei den EUAs. Am Donnerstag sank der CO2-Dezember-Future nach einem Tageshoch von 68,69 Euro/t CO2 bis Handelsschluss auf 67,30 Euro/t CO2 (minus 1,1 Prozent). Am Freitag kam es zu einer Erholung mit einem Tagesanstieg von 2,0 Prozent auf 68,62 Euro/t CO2, was einem Plus von 0,3 Prozent auf Wochensicht entspricht.Am Montag gerieten die Verschmutzungsrechte unter Druck. Der Preis büßte 3,0 Prozent ein und schloss bei 66,54 Euro/t CO2. Am Dienstag verzeichneten die EUAs eine kräftige Gegenbewegung, die die Verluste vom Vortag nahezu vollständig ausglich. Der Dezember-Future stieg um 3,0 Prozent auf 68,51 Euro/t CO2. Am Mittwoch setzte sich die Aufwärtsbewegung zunächst dynamisch fort, und das Tageshoch wurde bei 69,58 Euro/t CO2 markiert. Aus dem Handel ging es dann mit einem kleinen Plus von 0,4 Prozent bei 68,78 Euro/t CO2. Am Donnerstag übernahmen am frühen Nachmittag wieder die CO2-Bären das Handelszepter. Um 13:00 Uhr notierte das CO2-Zertifikat 1,4 Prozent im Minus bei 67,85 Euro/t CO2.Optionsverfall sorgt für VolatilitätDie starke Preisbewegung am Mittwoch war insbesondere auf den Verfall der EUA-Dezember-Optionen zurückzuführen. Um 14 Uhr wurde der Referenzpreis des Underlyings, also des Dezember-24-Futures, fixiert. Alle Call-Optionen, deren Ausübungspreis (Strike) zu diesem Zeitpunkt unter dem Referenzpreis (Marktpreis) lag, waren „im Geld“ und wurden automatisch ausgeübt. Bei den Put-Optionen verhält es sich umgekehrt: Put-Optionen, deren Ausübungspreis über dem Referenzpreis lag, waren „im Geld“ und wurden ebenfalls automatisch ausgeübt. Die Optionsinhaber verkauften dann den Dezember-Future zum Referenzpreis, der über dem Marktpreis des Underlyings lag, an die Stillhalter und konnten einen Gewinn einstreichen.Die Stillhalter hatten daher ein starkes Interesse daran, dass möglichst wenige Optionen zum Ausübungspreis im Geld lagen. Dies führte am Vormittag zu einem stärkeren Kaufdruck. Am Nachmittag gewannen jedoch die fundamentalen Marktkräfte wieder die Oberhand, und es zeigte sich ein höheres Verkaufsinteresse.Nach dem Verfall der EUA-Dezember-Optionen folgt in der kommenden Woche der Verfall des Dezember-24-Kontraktes. Dieser verfällt an der ICE Endex drei UK-Bankarbeitstage nach den Optionen, also am Montag, den 16. Dezember. Das Open Interest, also die Gesamtzahl der gehaltenen Positionen, im Dezember-25-Kontrakt ist bereits seit Anfang Dezember größer als das des Dezember-24-Kontrakts. Der Dezember-25-Kontrakt ist damit bereits der neue „Leitkontrakt“. Aufgrund der Rolleffekte könnten die nächsten Tage am CO2-Markt noch volatil verlaufen.Netto-Long-Position steigt weiter anZusätzlich stand am Mittwoch der wöchentliche Commitment of Traders-Report der Börse ICE Endex im Fokus, der die Positionierung der Marktteilnehmer per letzten Freitag (6. Dezember) darstellt. Die Investmentfonds, also die Spekulanten, haben seit Wochen ihre Netto-Short-Position im CO2-Markt abgebaut und waren zuletzt netto-long. Dabei reduzierten sie sowohl Long- als auch Short-Positionen, allerdings die Shorts stärker als die Longs. Das Interesse der Spekulanten am CO2-Markt ist insgesamt kleiner geworden.Auch in der letzten Woche wurde die Netto-Long-Position weiter ausgebaut, und zwar um 2,7 Mio. EUAs auf 14,6 Mio. EUAs. Dabei erhöhte sich die Long-Position um 1,2 Mio. EUAs, während die Short-Position um 1,5 Mio. EUAs abgebaut wurde.Autor: Tobias Waniek von enerchase‍"
}