{
    "title": "Preisanstiege durch Spekulanten",
    "date": "2024-07-25 16:40:00",
    "text": "Die Schwäche der EUAs in der ersten Hälfte der Kalenderwoche 29 setzte sich auch zum Wochenausklang weiter fort. Der CO2 Dez. 24-Future schloss auf Wochensicht mit einem Minus von 4,8 Prozent bei 66,0 Euro/t CO2. Mit der Eröffnung der Woche bei 69,58 Euro/t CO2 wurde auch das Wochenhoch markiert, da es im weiteren Handelsverlauf nur abwärts ging. Das Wochentief lag knapp unterhalb des Wochenschlusskurses bei 65,72 Euro/t CO2.Kursrally am MittwochZum Wochenstart am Montag der KW 30 blieb das Verkaufsinteresse am CO2-Markt hoch. Das Verschmutzungsrecht verlor 1,8 Prozent und schloss den Handelstag bei 64,79 Euro/t CO2. Am Dienstag konnten sich die CO2-Bullen wieder zurückmelden. Das CO2-Zertifikat durchbrach die 65 Euro-Marke und beendete den Handelstag 1,5 Prozent im Plus bei 65,79 Euro/t CO2. Am Mittwoch dominierten die CO2-Bullen dann klar weiter das Handelsparkett. Bereits zur Eröffnung zeigten sich die EUAs aufwärtsgerichtet und der Kaufdruck blieb bis Handelsschluss hoch. Entsprechend schloss der EUA Dezember-Kontrakt 4,7 Prozent fester bei 68,90 Euro/t CO2. Eine Fortsetzung der Aufwärtsrally misslang den CO2-Bullen jedoch am Donnerstag. Am späten Nachmittag gegen 16 Uhr notierte das Emissionsrecht 1,7 Prozent leichter bei 67,74 Euro/t CO2.Gewinnmitnahmen stützen CO2-PreisDer jüngste CoT-Report der Börse ICE Endex zeigt mit Datenstand 19. Juli 2024 einen Anstieg der Netto-Short-Position der Investmentfonds um 5,3 Mio. EUAs auf 23,4 Mio. EUAs. Dabei wurden die Long-Positionen um 1,9 Mio. EUAs auf 38,4 Mio. EUAs erhöht. Die Short-Positionen stiegen aber deutlicher um 7,1 Mio. EUAs auf 61,7 Mio. EUAs. Dies dürfte den Großteil der Kursschwäche der Vorwoche erklären. Am Montag ist der Dezember-Future dann auf eine wichtige charttechnische Marke bei 64,72 Euro/t CO2 gefallen, wo einige Spekulanten ihre Positionen offensichtlich im Gewinn geschlossen haben und die CO2-Preise gestützt haben. Dies wird der nächste CoT-Report kommenden Mittwoch endgültig zeigen.Analysten sehen steigende EUA-PreiseGemäß einer Reuters-Umfrage gehen Analysten für die Zeit von 2024 bis 2026 von steigenden EUA-Preisen aus. Im Durchschnitt liegt die Preisprognose der Analysten bei 67,25 Euro/t CO2 in diesem Jahr und 76,75 Euro/t CO2 im Jahr 2025. Dies entspricht einer Anhebung der Prognose im Vergleich zur letzten Umfrage im April um 5,1 Prozent für dieses und 3,7 Prozent für nächstes Jahr. Die US-Bank Morgan Stanley sieht mit 73 Euro/t CO2 den höchsten Preis für 2024, Capital Economics liegt mit einer Prognose von 63 Euro/t CO2 am niedrigsten.Risiken sehen die Analysten vor allem durch das „Frontloading“ der EU-Kommission. Dabei werden Zertifikate, die eigentlich erst 2027 bis 2030 versteigert werden sollten, auf frühere Auktionen in den Jahren 2023-2026 vorverlegt, um Erlöse für Reformvorhaben zu generieren. Aufgrund des gesunkenen Preisniveaus könnte die Politik gezwungen sein, weitere Mengen für das „Frontloading“ zu benennen, um die geplanten Erlöse zu erzielen. Das würde die Preise weiter belasten, die angesichts des hohen Angebots am Primärmarkt ohnehin bereits deutlich unter Druck stehen.Keine Halbierung der Zertifikatemenge im Monat AugustDie Auktionsmenge im August wird in diesem Jahr nicht wie in den vergangenen Jahren halbiert. Diese Halbierung hatte in der Vergangenheit die Preise der Zertifikate gestützt. Dies geschah im Rahmen von weiteren Maßnahmen der Europäischen Kommission im vergangenen Jahr. So wurde neben dem Ende des Angebotsrückgangs im August u.a. auch die jährliche Compliance-Frist vom 30. April auf den 30. September verschoben und die Zuteilung der kostenlosen Zertifikate an die Industrie vom 28. Februar auf den 30. Juni. Da im August saisonbedingt die Nachfrage nach Zertifikaten geringer ist, führt die Beibehaltung der vollen Auktionsmenge zu einer zusätzlichen Marktsättigung.Autor: Tobias Waniek "
}