{
    "title": "Preisrally in KW 43 spekulativ getrieben",
    "date": "2024-10-31 15:00:00",
    "text": "In der vergangenen Handelswoche (KW 43) nahm das Kaufinteresse in der zweiten Wochenhälfte deutlich zu, so dass die EUAs mit einem Wochengewinn von 6,6 Prozent bei 66,76 Euro/t CO2 aus dem Handel gingen. Dabei setzte sich die positive Entwicklung vom Mittwoch am Donnerstag weiter fort, und der EUA Dezember-Future schloss den Handelstag 2,3 Prozent fester bei 66,63 Euro/t CO2. Am Freitag konnte sich dann keine Marktpartei mehr klar durchsetzen.Am Montag der Handelswoche 44 fiel das CO2-Zertifikat intraday auf ein Tagestief von 64,61 Euro/t CO2. Die CO2-Bullen konnten die Verluste jedoch auf ein Minus von 0,4 Prozent begrenzen, der Schlusskurs lag bei 66,50 Euro/t CO2. Auch am Dienstag blieb der Handel mit CO2-Zertifikaten volatil. Nach einem Handel zwischen 67,75 Euro/t CO2 im Tageshoch und 66,14 Euro/t CO2 im Tagestief schloss das Verschmutzungsrecht mit einem Plus von 0,5 Prozent bei 66,85 Euro/t CO2. Am Mittwoch übernahmen dann die CO2-Bären das Handelszepter, was zu einem Rückgang von 1,6 Prozent auf 65,77 Euro/t CO2 führte. Die Schwäche setzt sich am Donnerstag weiter fort. Die EUAs notieren gegen 14:30 Uhr 1,5 Prozent leichter bei 64,81 Euro/t CO2.Trotz der Verluste bleibt jedoch festzuhalten, dass der kurzfristige Aufwärtstrend intakt ist und die aktuelle Kursschwäche nur eine Korrektur nach der Aufwärtsbewegung darstellen könnte. Die Bären müssen aus charttechnischer Sicht noch erhebliche Arbeit leisten, um wieder die Oberhand zu gewinnen.Netto-Short-Position im EU-ETS rückläufigEin Blick auf die Positionierung der spekulativen Marktteilnehmer zeigt, dass es für die Bären nicht so einfach wird, sich nachhaltig durchzusetzen. In der vergangenen Woche reduzierten spekulative Investoren ihre Netto-Short-Positionen im CO2-Markt deutlich um 9 Mio. EUAs auf 15,1 Mio. EUAs, den niedrigsten Stand seit Anfang September. Laut CoT-Report sank die Gesamtmenge der Short-Positionen um 8,3 Mio. EUAs auf 56,5 Mio. EUAs, während die Long-Positionen weitgehend stabil bei rund 41,4 Mio. EUAs blieben (plus 942.000 EUAs). Wie eingangs beschrieben, profitierte der Preis des EUA Dezember 24-Kontrakts in der vergangenen Woche von der Schließung der Short-Positionen und erzielte einen Wochengewinn von 6,6 Prozent. Es bleibt abzuwarten, ob die Investoren von einer Netto-Short- zu einer Netto-Long-Position wechseln wollen, was ein stark bullishes Signal wäre. Vorläufig könnten es auch lediglich Gewinnmitnahmen und eine Reduzierung offener Positionen sein, wodurch auch das Risiko eines „Short-Squeeze“ weiter sinkt.Deutscher Energieverbrauch sinkt auf RekordtiefDie Nachfrage nach CO2-Zertifikaten bleibt angesichts der schwachen Konjunktur eingetrübt. Die Industrie zeigt weiterhin wenig positive Signale: Der Automobilkonzern VW verzeichnete im dritten Quartal einen starken Gewinneinbruch von 64 Prozent auf rund 1,6 Mrd. Euro. Auch der Chemiekonzern BASF rechnet im wichtigen Autogeschäft mit einem schwachen vierten Quartal, da fast 20 Prozent seines Umsatzes mit der Autoindustrie zusammenhängen. „Die Vorzeichen für die Automobilindustrie sind momentan insgesamt nicht positiv“, erklärte Vorstandschef Markus Kamieth. Angesichts dieser Entwicklungen dürfte der Energieverbrauch in Deutschland in diesem Jahr ein neues Rekordtief erreichen. Laut einer ersten Prognose der Arbeitsgemeinschaft Energiebilanzen wird ein Rückgang um 1,7 Prozent im Vergleich zum Vorjahr erwartet, wodurch der Verbrauch fast 30 Prozent unter dem bisherigen Höchststand von 1990 liegt. Dies reduziert auch die Nachfrage nach CO2-Zertifikaten im Kraftwerkssektor.Autor: Tobias Waniek von enerchase"
}