{
    "title": "Saisonale Stärke im September durch neue EUA-Abgabefrist? ",
    "date": "2024-08-29 09:46:00",
    "text": "Die Preisentwicklung der CO2-Zertifikate in dieser Woche zeigt eine überwiegend abwärts gerichtete Tendenz, unterbrochen von einer kurzfristigen Erholung am Dienstag. Der Markt bleibt insgesamt volatil und schwach, mit deutlichen Preisrückgängen, die auf eine anhaltende Unsicherheit und eine geringere Nachfrage nach CO2-Zertifikaten hindeuten. Die leichte Erholung am Dienstag mit einem Tageshoch bei 71,93 Euro/t CO2 konnte die allgemeine Abwärtsbewegung jedoch nicht umkehren. Zum Zeitpunkt der Erstellung dieses Marktberichts stabilisieren sich die Preise kurzfristig auf der 70 Euro-Marke. Ein Rutsch unter dieses Level würde den kurzfristigen Abwärtstrend seit dem Hoch vom 20.8. bei 74,75 Euro/t CO2 weiter fortbestehen lassen.  Optionsverfall im SeptemberIm kommenden Monat werden die EUA September-Optionen verfallen. Verfallstag ist der 25. September. Der Basiswert dieser Optionen ist der EUA-Dezember-Kontrakt. Im Hinblick auf den näher rückenden Verfallstag ist mit einer erhöhten Volatilität des Dezember-Kontrakts zu rechnen. Besonders viele Call-Optionen, die auf steigende Kurse setzen, liegen bei Ausübungspreisen von 75 Euro/t CO2 und 90 Euro/t CO2. Liegen die Kurse am Verfallstag darüber, erzielen die Optionskäufer einen Gewinn, liegen sie darunter, verfallen die Optionen wertlos. Bei den Put-Optionen, also den Wetten auf fallende Preise, sieht es anders aus: Die größten Positionen liegen bei Ausübungspreisen von 60 und 65 Euro/t CO2. Liegen die Kurse am Verfallstag darunter, sind die Optionsinhaber im Gewinn, liegen sie darüber, verfallen die Optionen wertlos. Nimmt man alle Optionen am Markt zusammen und ermittelt, bei welchem Kurs die meisten Optionen, also sowohl Calls als auch Puts, wertlos verfallen, ergibt sich ein Kurs von 70 Euro/t CO2. Und genau dort steht der Kurs am Donnerstag, zum Zeitpunkt der Erstellung dieses Marktberichts. Sollte also am Verfallstag der Markt weiter in der Nähe der 70 Euro-Marke liegen, profitieren die Verkäufer (Stillhalter) der Optionen, also beispielsweise Investmentbanken, am meisten. Diese Optionen verfallen dann wertlos und die Stillhalter erzielen einen Gewinn in Höhe der eingenommen Optionsprämie.Abgabefrist 30. SeptemberIn diesem Jahr gibt es einige Änderungen im europäischen Emissionshandel: Zum einen entfällt die Sommerpause im August. In den Vorjahren wurde im August jeweils nur die Hälfte der sonst üblichen Mengen verauktioniert. Dies ist in diesem Jahr nicht der Fall. Die Nachfrage in den Auktionen an der EEX ist in diesem Jahr weiterhin schwach, die durchschnittliche Cover Ratio, also das Verhältnis aus Angebot und Nachfrage in den Auktionen, liegt bei 1,69 und damit fast so niedrig wie zuletzt 2021. Die zweite wichtige Anpassung betrifft die Abgabefrist. Diese wurde vom 30. April auf den 30. September verschoben. Die abgabepflichtigen Unternehmen werden also in den nächsten Wochen ermitteln, ob ihnen noch EUAs fehlen und ggf. ihre Position nachjustieren. In der Vergangenheit hat dies in der ersten Aprilhälfte zumeist die Kurse gestützt. In der zweiten Aprilhälfte hat die Kaufaktivität dann allerdings nachgelassen. Dieses Muster ist möglicherweise nun auch auf den September zu übertragen.Weitere Reduzierung der Netto-Short-PositionDer gestern veröffentlichte CoT-Report der Börse ICE Endex auf die EUAs zeigte eine weitere Reduzierung der Netto-Short-Position. Die Investmentfonds sind nur noch mit minus 4,8 Mio. EUAs netto-short positioniert. Sie haben in den letzten Wochen ihre Netto-Short-Position von minus 25,5 Mio. EUAs Ende Juli auf minus 4,8 Mio. EUAs Ende August abgebaut. Im gleichen Zeitraum stieg auch der Preis für die Emissionsrechte um rund 15 Prozent. Die von den Spekulanten gehaltene gesamte Short-Position beträgt 46,4 Mio. EUAs und die gesamte Long-Position beläuft sich auf 41,6 Mio. EUAs. Zum Vergleich: Deutschland verursachte im Jahr 2022 noch etwa 740 Millionen Tonnen CO2-Emissionen und im Jahr 2023 mit 673 Millionen Tonnen CO2 bereits weniger. Addiert man die Long- und Short-Positionen auf, so kommt man auf 88 Mio. Tonnen (46,4 + 41,6) spekulativ gehaltene Emissionsrechte allein an der ICE Endex. Dies sind wiederum rund 13 Prozent der gesamten deutschen Emissionen im Jahr 2023. Hierdurch wird deutlich, welche Marktmacht die Spekulanten im europäischen Energiemarkt haben.Aufgrund der relativ gleich hohen Positionierung stehen sich CO2-Bulle und CO2-Bär am Markt für Emissionsrechte nun wieder gleich stark gegenüber. Eine starke Kursreaktion oder die Gefahr eines „Squeeze“ besteht derzeit nicht. Wir sind gespannt, für welche Richtung sich die Spekulanten künftig entscheiden. Bauen sie verstärkt Long-Positionen auf, wird der Preis steigen, und vice versa.Autoren: Dennis Warschewitz, Stefan Küster ‍"
}