{
    "title": "Spekulationen über mögliche Kopplung von EU- und UK-ETS",
    "date": "2024-07-04 14:20:00",
    "text": "Nach einer schwächeren ersten Handelswoche in der KW 26 ging es auch am Donnerstag für das Verschmutzungsrecht weiter abwärts. Am Freitag zeigte sich dann eine erhöhte Volatilität, und der EUA Dezember-Future handelte zwischen 68,40 Euro/t CO2 auf der Ober- und 65,78 Euro/t CO2 auf der Unterseite. Aus dem Handel ging es dann mit einem Tages- und Wochenschlusskurs bei 67,36 Euro/t CO2 (minus 1,0 Prozent). Während das Wochentief das Tagestief am Freitag bei 65,78 Euro/t CO2 markierte, lag das Wochenhoch bei 69,09 Euro/t CO2.Kursrally am DienstagZum Wochenstart am Montag der KW 27 stieg das Kaufinteresse stark an, und das CO2-Zertifikat stieg im Tageshoch bis auf 69,68 Euro/t CO2 an. Der Kaufdruck ließ anschließend etwas nach; das Verschmutzungsrecht schloss 1,4 Prozent im Plus bei 68,33 Euro/t CO2. Nach einem Rücksetzer am Dienstagmorgen kannte das Emissionsrecht anschließend nur eine Richtung: Norden. Die CO2-Bullen ließen den Dezember-Future über die 70-Euro-Marke springen, das Tageshoch wurde bei 71,03 Euro/t CO2 markiert. Aus dem Handel ging es dann mit einem satten Plus von 3,8 Prozent bei 70,93 Euro/t CO2. Am Mittwoch setzte sich die Aufwärtsbewegung vom Vortag zunächst bis zu einem Tageshoch von 71,95 Euro/t CO2 fort. Anschließend ließ der Kaufdruck jedoch nach, geschlossen hat der EUA Dez.24-Future nahezu unverändert bei 70,91 Euro/t CO2. Am Donnerstag konnten die Bären das Handelszepter wieder übernehmen. Nach einer schwachen Eröffnung und einem bisherigen Tagestief bei 69,81 Euro/t CO2 ging es in der Folge zwar bis auf 71,16 Euro/t CO2 hinauf. Gegen 14 Uhr notierten die EUAs aber wieder tiefer auf der 70-Euro-Marke.Investmentfonds im EU-ETS bleiben pessimistischMit dem am Mittwoch veröffentlichten Commitments-of-Traders-Report (CoT-Report) der Börse ICE Endex bestätigt sich das Bild, dass die Spekulanten beim CO2-Handel wieder auf die pessimistischere Seite wechseln. Die Netto-Short-Position ist erneut angestiegen, insbesondere durch einen Anstieg der Short-Positionen um 5,7 Mio. EUAs auf 56,1 Mio. EUAs. Zwar stiegen auch die Long-Positionen um 2,7 Mio. EUAs auf 34,9 Mio. EUAs an. In der Bilanz erhöhte sich die Netto-Short-Position um 3,0 Mio. EUAs auf 21,2 Mio. EUAs. Im Einklang mit den Investmentfonds bleiben wir auf der Bärenseite.Stärkerer Klimaschutz nach UK-Wahl erwartetAm heutigen Donnerstag wird es spannend, wenn in Großbritannien gewählt wird. Die aktuelle konservative Tory-Regierung dürfte den Umfragen zufolge abgewählt werden; es könnte eine Labour-Regierung folgen. Während die Konservativen in den vergangenen Jahren den Klimaschutz geschwächt hatten, steht Labour für eine konsequentere Klimaschutzpolitik. In UK scheint die Entwicklung in dieser Angelegenheit also in eine andere Richtung zu laufen als in der EU. Montel zitiert einen CO2-Händler, der von Gerüchten über eine mögliche Anbindung des europäischen Emissionshandels (EU-ETS) an den britischen Emissionshandel (UK-ETS) berichtet.Knappheit im EU-ETS durch Wasserstoffziele?Mit Blick auf die mittel- bis langfristigen Preisperspektiven könnten die Wasserstoffziele der EU laut der Brüsseler Denkfabrik Sandbag zu einer Angebotsverknappung im europäischen Emissionshandelssystem (EU-ETS) führen, die bis 2030 auf 370 Mio. t steigen könnte. Die Europäische Union plant im Rahmen des REPowerEU-Plans eine eigene Produktion von grünem Wasserstoff von 10 Mio. t jährlich. Dies führt laut der Denkfabrik zu einer höheren Stromnachfrage, reduziert aber nicht die Emissionen im Geltungsbereich des EU-ETS und schafft stattdessen eine echte Knappheit an EUAs. Weiter heißt es in der Analyse, dass diese Knappheit den Druck erhöhen könnte, die Emissionsobergrenze des ETS zu lockern und die Politik dazu bringen könnte, das Dekarbonisierungsziel für die Mitte des Jahrhunderts aufzugeben. Die aktuelle Obergrenze von 1,4 Mrd. t für 2024 sinkt jedes Jahr und beschränkt die Menge an CO2, welche von den emissionspflichtigen Anlagen ausgestoßen werden darf. Sollte die Grenze jedoch regelmäßig überschritten werden, könnte der „Cap“ in der nächsten Phase ab 2031 auf einem höheren Niveau kalibriert werden. Dadurch wären die Klimaneutralitätsziele voraussichtlich nicht zu erreichen.Autoren: Tobias Waniek "
}