{
    "title": "Spekulanten setzen weiter auf steigende CO2-Preise",
    "date": "2025-02-07 08:40:00",
    "text": "Nachdem der EUA-Dezember-25-Future am Mittwoch der vergangenen Handelswoche kräftig zugelegt hat (plus 4 Prozent), wurden die Gewinne in der zweiten Wochenhälfte nicht weiter ausgebaut. Am Donnerstag verzeichnete der Markt einen Verlust von 1,3 Prozent auf 82,6 Euro/t CO2, nachdem zuvor ein Höchststand von 84,5 Euro/t CO2 erreicht wurde. Die Preisverluste wurden am Freitag wieder wettgemacht, sodass der Dezember-Future auf Wochensicht 2,6 Prozent fester bei 83,82 Euro/t CO2 schloss – in etwa auf dem Niveau vom Mittwoch. Das Wochenhoch lag bei 84,5 Euro/t CO2, das Wochentief bei 78,3 Euro/t CO2.Die Handelswoche 6 begann am Montag mit einem deutlichen Rückgang. Die EUAs schwankten zwischen einem Höchstkurs von 84,22 Euro/t CO2 und einem Tiefstkurs von 80,1 Euro/t CO2. Der Handel endete bei 81,35 Euro/t CO2, was einem Minus von 3,0 Prozent entsprach. Am Dienstag blieb der Markt weiterhin unter Druck. Die CO2-Dezember-Futures schlossen 0,7 Prozent schwächer bei 80,79 Euro/t CO2. Am Mittwoch stabilisierten sich die Verschmutzungsrechte. Nach einer Handelsspanne zwischen 82,66 Euro/t CO2 auf der Ober- und 79,77 Euro/t CO2 auf der Unterseite schloss der Markt nahezu unverändert bei 81 Euro/t CO2 (plus 0,3 Prozent). Am Donnerstag übernahmen die CO2-Bullen zunächst die Kontrolle, und die Preise stiegen im Tageshoch bis auf 83 Euro/t CO2. Am späten Nachmittag setzte jedoch Verkaufsdruck ein, sodass das CO2-Zertifikat gegen 17 Uhr mit einem Tagesplus von 0,8 Prozent bei 81,68 Euro/t CO2 notierte.EUAs fundamental gestützt – ausgeglichenes Kräfteverhältnis am MittwochAus charttechnischer Sicht zeigten die EUAs am Mittwoch eine High-Wave-Doji-Kerze, also eine Kerze mit längeren Schatten, aber ohne ausgeprägten Kerzenkörper. Die Volatilität war hoch, doch am Ende des Tages konnte sich keine Marktpartei klar durchsetzen. Allerdings prognostizieren aktuelle Wettermodelle ab dem 12. Februar eine unterdurchschnittliche Windeinspeisung. Das geringe Windaufkommen in Kombination mit sinkenden Temperaturen dürfte die Residuallast erhöhen und somit den Einsatz fossiler Kraftwerke zur Stromerzeugung verstärken – was die Nachfrage nach EUAs zusätzlich antreiben könnte.CoT-Report mit leichtem Anstieg der Netto-PositionDer neueste CoT-Report der EUAs von der ICE Endex (Datenstand: 31.01.2025) zeigt einen weiteren Aufbau der Netto-Long-Position der Investmentfonds auf 55,6 Mio. EUAs (zuvor 53,1 Mio. EUAs). Die Spekulanten setzen somit weiterhin auf steigende Preise, allerdings mit einer geringeren Dynamik als zuvor. Die absolute Long-Position beträgt 99 Mio. EUAs, während auch die Short-Position leicht angestiegen ist und nun bei 43,5 Mio. EUAs liegt. Dadurch fiel der Netto-Long-Aufbau schwächer aus als in den Vorwochen. Der historische Rekordwert wurde im Juli 2021 mit einer absoluten Long-Position von 109 Mio. EUAs und einer Netto-Long-Position von 77,7 Mio. EUAs erreicht – es besteht also noch weiteres Potenzial nach oben.Aktienmärkte mit Auswirkungen auf CO2-PreiseDie Unsicherheit an den Finanzmärkten bleibt hoch, insbesondere vor dem Hintergrund eines eskalierenden Handelskonflikts mit den USA. In Europa wächst die Sorge vor möglichen Strafzöllen auf europäische Exporte. Die Kursverluste an den Aktienmärkten am Montag belasteten auch die EUAs. Die Korrelation zwischen dem EUROSTOXX 50 und dem CO2-Dezember-Future war zuletzt mit einem Korrelationskoeffizienten von 0,9 äußerst hoch.Autor: Tobias Waniek "
}