{
    "title": "Spekulanten treiben CO2-Preis in die Höhe",
    "date": "2025-01-23 15:00:00",
    "text": "Das kräftige Kaufinteresse aus der ersten Hälfte der vergangenen Kalenderwoche 3 setzte sich auch zum Wochenausklang fort, sodass der EUA Dezember-25-Future mit einem Wochenplus von 6,6 Prozent bei 79,75 Euro/t CO2 ins Wochenende ging. Bemerkenswerterweise lag das Wochentief bei 75,40 Euro/t CO2, dem Eröffnungskurs der Woche. Die Notierungen kannten also nur eine Richtung: Norden. Das Wochenhoch lag bei 80,50 Euro/t CO2.In der aktuellen Handelswoche 4 stand das Vorwochenhoch besonders im Fokus. Zu Beginn der Woche am Montag stieg das Verschmutzungsrecht um 0,4 Prozent auf 80,04 Euro/t CO2 und testete im Tageshoch die 80,5 Euro/t CO2 punktgenau. Am Dienstag lag das Hoch des CO2-Zertifikats nur knapp darunter, bei 80,42 Euro/t CO2. Auf Tagesschlusskursbasis verlor der Dezember-Future leicht um 0,3 Prozent auf 79,84 Euro/t CO2. Am Mittwoch gaben die EUAs weiter nach und schlossen mit einem Rückgang von 0,8 Prozent bei 79,20 Euro/t CO2. Das Hoch lag nur marginal unterhalb der 80-Euro-Marke, bei 79,95 Euro/t CO2. Am Donnerstag kommt es zu kräftigem Kaufdruck. Gegen 14:30 Uhr notierte das Verschmutzungsrecht mit einem Plus von 2,3 Prozent bei 81,02 Euro/t CO2. Das bisherige Tageshoch liegt bei 82 Euro/t CO2. Vom Oktober-Tief bei 61,98 Euro/t CO2 hat das CO2-Zertifikat damit im heutigen Tageshoch um mehr als 32 Prozent zugelegt. Seit dem Tief im Dezember bei 64,05 Euro/t CO2 verzeichnet die derzeitige Rally zudem einen Anstieg um 28 Prozent.CoT-Report der EUAs mit 12-MonatshochHintergrund des deutlichen Preisanstiegs in der Kalenderwoche 3 war das Kaufinteresse der Spekulanten. Der gestern veröffentlichte CoT-Report der EUAs an der ICE Endex zeigt einen weiteren starken Anstieg der Netto-Long-Position der Investmentfonds auf 42 Mio. Tonnen, nach zuvor 29 Mio. Tonnen in der Vorwoche. Dies ist nicht nur ein steiler Anstieg von 13 Mio. Tonnen, sondern auch der höchste Wert seit 12 Monaten. Der Rekordwert in der vorliegenden Datenhistorie liegt bei 77,7 Mio. Tonnen und wurde im Juli 2021 erzielt. Das wiederum legt den Schluss nahe, dass für die Spekulanten noch finanzielle Luft nach oben vorhanden sein könnte. Der Anstieg der Long-Positionen ist ein bullishes Signal.Abseits der spekulativen Positionierung ist aus fundamentaler Sicht zu erwarten, dass die Erneuerbaren in den nächsten Wochen wieder mehr Strom liefern – durch stärkeren Wind und mehr Regen. Die Nachfrage nach EUAs dürfte daher nachlassen, da weniger fossile Kraftwerke Strom zur Deckung der Residuallast produzieren müssen. Derweil hat allerdings Präsident Donald Trump den Austritt der USA aus dem Pariser Klimaschutzabkommen bekanntgegeben, was politischen Gegenwind für die EUAs bedeutet.Preissprung am Donnerstag auch am PrimärmarktÄhnlich wie der Sekundärhandel zeigte auch der Primärmarkt ein Auf und Ab. Nach einem Auktionspreis von 77,30 Euro/t CO2 am vergangenen Freitag (Bid-to-Cover Ratio: 1,98) sank der Versteigerungspreis am Montag auf 76,40 Euro/t CO2 (Cover Ratio: 1,49). Am Dienstag ging es dann wieder aufwärts auf 77,30 Euro/t CO2 (Cover Ratio: 1,53), um am Mittwoch einen erneuten Rückgang auf 76,71 Euro/t CO2 zu verzeichnen (Cover Ratio: 1,78). Am Donnerstag kam es zu einem stärkeren Kursanstieg auf 79,06 Euro/t CO2 (Cover Ratio: 1,50).‍"
}