{
    "title": "Spekulanten sorgen für Verkaufsdruck",
    "date": "2024-06-27 15:09:00",
    "text": "Nachdem die EUAs in der vergangenen KW 25 nach dem Verfall der Juni-Optionen am Mittwoch kräftig zulegten, ging es auch am Donnerstag zunächst aufwärts und das Wochenhoch wurde bei 71,60 Euro/t CO2 markiert. Anschließend nahm jedoch der Verkaufsdruck deutlich zu, sodass es auf Wochensicht mit einem Minus von 0,7 Prozent bei 68,05 Euro/t CO2 aus dem Handel ging. Hintergrund dürften auch weitere Verkäufe der Investmentfonds gewesen sein. Das Wochentief lag bei 67,51 Euro/t CO2.Abwärtsbewegung setzt sich fortNach dem schwachen Wochenausklang der KW 25 ging es auch am Montag für das Verschmutzungsrecht weiter abwärts und der EUA Dez.24-Future markierte das Tagestief bei 67,01 Euro/t CO2. Aus dem Handel ging es dann mit einem Minus von 0,7 Prozent bei 67,56 Euro/t CO2. Am Dienstag konnte sich keine Marktpartei klar durchsetzen. Die Handelsspanne lag zwischen 68,07 Euro/t CO2 auf der Ober- und 66,85 Euro/t CO2 auf der Unterseite. Aus dem Handel ging das Verschmutzungsrecht dann 0,4 Prozent fester bei 67,80 Euro/t CO2. Nach einem bullishen Vormittag am Mittwoch mit einem Tageshoch bei 69,09 Euro/t CO2 beendete das CO2-Zertifikat den Handelstag 0,8 Prozent leichter bei 67,23 Euro/t CO2. Am Donnerstagvormittag präsentierten sich erneut die CO2-Bullen als stärkere Marktpartei, und es ging im Tageshoch bis auf 67,78 Euro/t CO2 hinauf. Anschließend übernahmen die Bären jedoch wieder das Handelszepter und gegen 14 Uhr notierte das Verschmutzungsrecht bei 66,70 Euro/t CO2.Investmentfonds im EU-ETS wieder bearishDie Investmentfonds im Europäischen Emissionshandel sind wieder auf die pessimistischere Seite gewechselt. Nachdem bereits vor der Europawahl der Abbau der Netto-Short-Position ins Stocken geriet, haben das Ergebnis der Europawahl und die schwachen Wirtschaftsaussichten die Stimmung der Spekulanten offenbar wieder gedreht, sodass nun die Netto-Short-Position wieder ausgebaut wird. Lag diese in der KW 24 noch bei 13,7 Mio. EUAs, erhöhte sich die Netto-Short-Position in der Woche zum 21. Juni laut aktuellem CoT-Report auf 18,1 Mio. EUAs. Dabei wurden insbesondere die Long-Positionen um 5,6 Mio. EUAs auf 31,9 Mio. EUAs reduziert. Dies überdeckte den Abbau der Short-Position um 1,1 Mio. EUAs auf 50,1 Mio. EUAs.Nachfrage am Primärmarkt bleibt unterdurchschnittlichBei der Primärmarktauktion am vergangenen Freitag lag der Auktionspreis bei 67,36 Euro/t CO2 mit einer Bid-to-Cover-Ratio von 1,82. Am Montag fiel der Preis der Versteigerung weiter zurück auf 66,06 Euro/t CO2 (Cover-Ratio: 1,54). Am Dienstag lag der Preis bei 65,94 Euro/t CO2 (Cover-Ratio: 1,43). Nach der Auktionspause aufgrund der nur zweiwöchig stattfindenden polnischen Auktion am Mittwoch verzeichnete die Primärmarktauktion am Donnerstag einen leichten Anstieg auf 66,17 Euro/t CO2 (Cover-Ratio: 1,53).Bei der Primärmarktauktion am Montag fiel das Verhältnis von Angebot und Nachfrage („Cover-Ratio“) mit 1,54 ausgesprochen schwach aus. Im Durchschnitt lag dieses 2024 bisher bei 1,7. In 2023 waren es 1,99 und in 2022 sogar 2,15. Das Angebot ist vor allem durch die politischen Eingriffe in den Markt deutlich erhöht. Es werden dieses Jahr etwa 16 Prozent mehr EUAs versteigert, als eigentlich vorgesehen. Die Mengen wurden aus den Jahren 2027 bis 2030 nach vorne verschoben („Frontloading“). Außerdem steht die Bekanntgabe der Zuteilung kostenloser Emissionsrechte für das Jahr 2024 an berechtigte Unternehmen in den EU-Mitgliedsstaaten am 30. Juni an.Autoren: Tobias Waniek "
}