{
    "title": "Stromerzeugung aus Stein- und Braunkohle bricht ein – Geringe Nachfrage nach EUAs",
    "date": "2024-06-07 15:00:00",
    "text": "Zum Start in die neue Handelswoche am Montag der KW 23 stiegen die Preise am Markt für Emissionsrechte zunächst stark an. Der Preistreiber kam dabei aus dem Gasmarkt. Die Gasexporte aus Norwegen nach Europa sind am Montag starkzurückgegangen, nachdem es am Sonntag zu einer Abschaltung der Sleipner Riser-Plattform kam. Die Plattform ist ein wichtiger Knotenpunkt für die Pipelines Langeled North und Langeled South, welche die Gasverarbeitungsanlage Nyhamna an der norwegischen Westküste mit dem Terminal Easington verbinden. Der europäischen Gaspreis in Form des TTF Day-Ahead stieg daraufhin zwischenzeitlich bis auf 38,68 Euro/MWh und damit auf den höchsten Stand in diesem Jahr. Aufgrund der hohen Korrelation zwischen dem Gas- undCO2-Markt stieg auch der EUA-Dezember-Future bis auf ein Tageshoch bei 77,81Euro/t CO2 an. Im Verlauf des Handelstages fiel die Notierung jedoch wieder deutlich zurück und der Schlusskurs lag bei 74,63 Euro/t CO2. Am Tagesende blieb nur noch ein Plus von 0,8 Prozent im Vergleich zum Freitagsschlusskurs bei74,07 Euro/t CO2. Weitere Preisabgaben am Dienstag Am Dienstag kamen die Preise der CO2-Zertifikate weiter zurück. Der Grund für die Preisrückgänge waren Hinweise darauf, dass die ungeplante Unterbrechung in der norwegischen Gasinfrastruktur voraussichtlich nur von kurzer Dauer sein wird. Laut Gassco können die Probleme in der Verarbeitungsanlage Nyhamna innerhalb weniger Tage behoben werden. Dies setzte den Gasspotpreis unter Druck und somit auch den CO2-Markt. Der Tagesschlusskurs am Dienstag lag bei 72,58 Euro/t CO2. Geringe Nachfrage nach CO2-ZertifikatenIm ersten Quartal 2024 brach die Stromerzeugung aus Steinkohle um mehr als 40 Prozent im Vergleich zum Vorjahr ein, wie die Arbeitsgruppe Energiebilanzen (Ageb) berichtet. Gleichzeitig sank der Einsatz von Braunkohle zur Stromerzeugung um fast 20 Prozent. Gründe für diesen Rückgang sind sowohl die geringere Stromerzeugung aufgrund der höheren Produktion erneuerbarer Energien als auch verstärkte Stromimporte aus den Nachbarländern. Im Gegenzug stieg die Nachfrage nach Gas um 1,2 Prozent an, wobei die Stromerzeugung in Gaskraftwerken eine entscheidende Rolle spielte. Die Nachfrage nach Heizgas sank hingegen aufgrund der milden Witterung und auch die schwache Wirtschaftslage führten zu einer geringeren Nachfrage nach Industriegas.Positiv entwickelte sich die Produktion aus erneuerbaren Energien wie Wind, Photovoltaik und Wasserkraft, die im Vergleich zum ersten Quartal des Vorjahres um 2,9 Prozent zulegte.Die Veränderung in der Struktur der Energieerzeugung führt zu einer Reduzierung der CO2-Emissionen. Nach Schätzungen der Arbeitsgruppe Energiebilanzen könnten hierdurch 12 Millionen Tonnen CO2 eingespart werden.Doppeltopp als kurzfristiges Trendwende-Muster betätigtAuch am Mittwoch zeigten sich die CO2-Preise rückläufig. Nach 72,58 Euro/t CO2 am Vortag ging es mit dem CO2-Dezember-Kontrakt um 0,8Prozent abwärts. Der Schlusskurs lag bei 72 Euro/t CO2. Zum Zeitpunkt der Erstellung dieses Marktberichts am Donnerstag steht der CO2-Preis mit 0,2Prozent im Vergleich zum Vortag geringfügig im Plus. Die charttechnischen Vorgaben sind derzeit allerdings überwiegend bearish einzuschätzen. Jüngst hatte sich im Chartbild ein Doppeltopp ereignet (Trendwende-Muster), was weiteres Downside-Potenzial vermuten lässt. ‍"
}