{
    "title": "Verkaufsdrucknach US-Wahl hält nur kurzzeitig an",
    "date": "2024-11-07 17:00:00",
    "text": "In der zweiten Hälfte der vergangenen Handelswoche (KW 44)übernahmen die CO2-Bären das Handelszepter. Der EUA-Dezember-24-Future schlossauf Wochensicht mit einem Verlust von 4,1 Prozent bei 64 Euro/t CO2. DasWochenhoch lag bei 67,75 Euro/t CO2, das Wochentief bei 63,22 Euro/t CO2.Die Handelswoche 45 startete bullish. Am Montag schlossendie EUAs 2,2 Prozent fester bei 65,42 Euro/t CO2. Am Dienstag kam es jedoch zueinem erneuten Preisrückgang. Nach einem Tageshoch bei 65,69 Euro/t CO2 gingdas CO2-Zertifikat 2,0 Prozent leichter bei 64,14 Euro/t CO2 aus dem Handel. AmMittwoch stand dann das Ergebnis der US-Wahl im Fokus und machte sich auch imEU-ETS bemerkbar. Zunächst reagierte der Emissionshandel mit Abschlägen undeinem Tagestief bei 62,37 Euro/t CO2. Am Nachmittag drehte die Stimmungallerdings. Der Handelstag endete bei 64,09 Euro/t CO2, was einen minimalenRückgang von 0,08 Prozent bedeutete. Diesen Schwung nahmen die CO2-Bullen amDonnerstag mit. Am Nachmittag um 16:30 Uhr notierten die EUAs 2,0 Prozent imPlus bei 65,35 Euro/t CO2.„Politische Börsen haben kurze Beine“Zu der gestrigen Marktbewegung passt die alte Börsenregel„Politische Börsen haben kurze Beine“. Politische Ereignisse, wie dieüberraschend klare Wahl von Trump zum designierten US-Präsidenten, zeigenhäufig nur kurzfristige Auswirkungen auf die Energiemärkte. Es kommt oftmalszunächst zu starken Marktreaktionen, doch wenn die Botschaften dann verarbeitetwurden, verlieren diese Einflüsse in der Regel auch zeitnah wieder anBedeutung. Damit dürften sich fortan die Preise wieder stärker nach den fundamentalenFaktoren ausrichten. Dabei wird es in den nächsten Monaten aber sicherlichvolatil bleiben, da sich unerwartete Nachrichten unmittelbar in Preisreaktionenniederschlagen werden.Netto-Short-Position im EU-ETS weiter rückläufigIn der vergangenen Woche haben die Investmentfonds ihreNetto-Short-Positionen im CO2-Markt weiter abgebaut. Diese sank um 4,5 Mio.EUAs auf 10,6 Mio. EUAs. Laut CoT-Report sank die Gesamtmenge derShort-Positionen um 6,6 Mio. EUAs auf 49,9 Mio. EUAs, während dieLong-Positionen um 2,1 Mio. EUAs auf 39,3 Mio. EUAs abgebaut wurden. Angesichtssteigender Unsicherheiten und einer höheren Volatilität wollen die Spekulantenihre offenen Positionen offenbar reduzieren.Klimapolitik vorerst geschwächtEnergiepolitisch dürfte es nach den jüngsten Ereignissen nunzu etwas anderen Schwerpunkten kommen. Donald Trump hat bereits angekündigt,dass er die klimapolitischen Maßnahmen der Biden-Regierung wieder ändern willund den Fokus eher auf die konventionellen Energieträger legen wird. Die Aktiender Windkonzerne wie Vestas, Orsted und RWE reagierten mit Abschlägen auf dieUS-Wahl.Die Auswirkungen des Ampel-Aus dürften in eine ähnlicheRichtung gehen. SPD und Grüne haben nun keine Mehrheit mehr und könnenklimapolitische Maßnahmen nicht ohne Unterstützung anderer Parteiendurchsetzen. Stimmen aus der FDP werden nach dem Bruch schwierig zu erhaltensein. Die Union hat zudem bereits angekündigt, dass sie nur einzelne Maßnahmenunterstützen wird, wenn es zu einer inhaltlichen Einigung kommt. Der Haushaltsoll beispielsweise nicht verabschiedet werden. Angesichts des nun beginnenden Wahlkampfesdürfte die Union klima- und energiepolitische Maßnahmen von SPD und Grünennicht unterstützen. Somit wird wohl nur „das Nötigste“ bis zur Neuwahl undeiner neuen Bundesregierung getan werden.Autor: Tobias Waniek von enerchase"
}