[
    {
        "title":"A new era for nuclear energy beckons as projects, policies and investments increase",
        "subtitle":"Nuclear power is set to reach a new record in 2025 and can improve energy security as electricity demand accelerates – but costs, project overruns and financing must be addressed",
        "body":"Renewed momentum behind nuclear energy has the potential to open a new era for the secure and clean power source as demand for electricity grows strongly around the world, according to a new IEA report.The report, The Path to a New Era for Nuclear Energy, shows the fresh impetus behind nuclear in the form of new policies, projects, investments and technological advances, such as small modular reactors (SMRs). It provides a comprehensive assessment of the current situation, identifying the major challenges that need to be addressed to build on the current momentum and enable a new era to take hold. This includes insights on how to finance new nuclear projects while ensuring reliable and diversified supply chains for building and fuelling them.“It’s clear today that the strong comeback for nuclear energy that the IEA predicted several years ago is well underway, with nuclear set to generate a record level of electricity in 2025,” said IEA Executive Director Fatih Birol. “In addition to this, more than 70 gigawatts of new nuclear capacity is under construction globally, one of the highest levels in the last 30 years, and more than 40 countries around the world have plans to expand nuclear’s role in their energy systems. SMRs in particular offer exciting growth potential. However, governments and industry must still overcome some significant hurdles on the path to a new era for nuclear energy, starting with delivering new projects on time and on budget – but also in terms of financing and supply chains.”As the world’s second-largest source of low-emissions electricity after hydropower, nuclear power today produces just under 10% of global electricity supply. The increasing use of electricity – to power everything from industry and air conditioning to electric vehicles and data centres amid the rise of artificial intelligence – is accelerating the growth in power demand, which is set to rise six times as fast as overall energy consumption in the coming decades, based on today’s policy settings. New generation capacity from a range of technologies will be needed to keep pace with the rapid demand growth, including those that can provide firm and flexible output such as nuclear. Most of the existing nuclear power fleet today is in advanced economies, but many of those plants were built decades ago. Meanwhile, the global map for nuclear is changing, with the majority of projects under construction in China, which is on course to overtake both the United States and Europe in installed nuclear capacity by 2030. Russia is also a major player in the nuclear technology landscape. Of the 52 reactors that have started construction worldwide since 2017, 25 are of Chinese design and another 23 are of Russian design. Similarly, the report shows how the production and enrichment of uranium, the fuel that goes into nuclear reactors, are highly concentrated. “Today, more than 99% of the enrichment capacity takes place in four supplier countries, with Russia accounting for 40% of global capacity, the single largest share,” Dr Birol said. “Highly concentrated markets for nuclear technologies, as well as for uranium production and enrichment, represent a risk factor for the future and underscore the need for greater diversity in supply chains.”Innovations in nuclear technologies are helping to drive momentum behind new projects, the report finds. SMRs, a type of smaller scale nuclear power plants that are quicker to build with greater scope for cost reductions, are drawing increasing interest from the private sector. The report highlights how the introduction of SMRs could lead to lower financing costs. With the right support, SMR installations could reach 80 GW by 2040, accounting for 10% of overall nuclear capacity globally. However, the success of the technology and speed of adoption will hinge on the industry’s ability to bring down costs by 2040 to a similar level to those of large-scale hydropower and offshore wind projects. A new era for nuclear energy will require a lot of investment. In a rapid growth scenario for nuclear, annual investment would need to double to USD 120 billion already by 2030. Given the scale of the infrastructure investment required, the rollout of new nuclear projects cannot rely exclusively on public finances. IEA analysis shows that ensuring the predictability of future cash flows is key to bringing down financing costs and attracting private capital to the nuclear sector. The report highlights that the private sector is increasingly viewing nuclear energy as an investible energy source with the promise of firm, competitive, clean power that can serve energy-intensive operations 24\/7. Notably, big names in the technology sector are signing power purchase agreements with developers to provide electricity for data centres and artificial intelligence.To take advantage of the opportunities that nuclear power offers, governments must be prepared to provide the strategic vision alongside stable regulatory frameworks that will give the private sector confidence to invest. The report details how incentives and public finance more broadly can unlock the investment needed to deliver greater clean and reliable power from nuclear.",
        "formatted_timestamp":"16 January 2025",
        "source":"IEA"
    }
]