[
    {
        "title":"At major IEA conference, decision-makers from tech, energy and government underscore AI’s implications for energy security and transitions",
        "subtitle":"IEA Executive Director emphasises ‘there is no AI without energy – specifically electricity’ at event involving 500 participants, including tech & energy leaders and government ministers",
        "body":"Leading figures from governments, the energy sector, the tech industry and civil society gathered this week for the first major international meeting of its kind addressing the deepening links between energy and artificial intelligence (AI) as the technology rapidly develops and uptake soars.The IEA’s Global Conference on Energy & AI on 4 and 5 December featured a high-level roundtable focused on building strategic understanding on energy and AI topics and a technical forum for experts. The two-day event brought about 500 participants to the Agency’s headquarters in Paris to discuss how to securely and sustainably meet AI’s energy needs, as well as how the technology could be used to optimise energy systems and speed up the pace of energy innovation.“There is no AI without energy – specifically electricity. Given the pace of AI adoption, now is the time for policy makers and industry to collaborate on a vision for meeting this fast-growing source of electricity demand in a secure and sustainable manner,” said IEA Executive Director Fatih Birol. “At the same time, AI is poised to be a transformative technology for the energy sector, with the potential to accelerate innovation, improve efficiency and security, and speed up energy transitions. This first-of-its-kind IEA conference provided an important venue to advance dialogue on these topics at a critical moment.”The rise of AI is quickly emerging as one of the most important energy trends today. AI is already helping to accelerate the discovery of new energy materials and technologies, and it can be utilised to improve how energy is produced, consumed and distributed. At the same time, expanding AI and the digital economy requires huge data centres, which can each consume as much electricity as 100,000 households. Although data centres currently account for just 1% of electricity usage globally, there are already significant challenges to the grid in areas where they are concentrated, and demand is expected to keep growing. For example, in Ireland, data centres already account for 20% of electricity demand, while in the US state of Virginia, the share is over 25%. The IEA conference was attended by ministers and high-level government officials from about 25 countries, such as Brazil, Canada, France, India, Japan, Singapore, the United Kingdom and the United States. CEOs and senior executives from companies with a combined market value of $15 trillion were also in attendance, with representatives from Amazon Web Services, Google, Hitachi Energy, Iberdrola, Infosys, Meta, Microsoft, NVIDIA, Schneider Electric and more sharing insights during the sessions.“Understanding the AI revolution is critical to understanding the future of energy,” Dr Birol said. “The IEA, which has long been at the forefront of analysing the links between digitalisation and energy, is uniquely placed to ensure that the significant opportunities that AI offers are fully grasped while associated risks and challenges are addressed.”“We will do this starting with a special report on energy and AI that we will publish in the spring of 2025,” he added.As noted in the Chair’s Summary of the conference, Canada communicated that it would work with the IEA to develop an approach to AI and energy issues, which would be formalized in 2025 under its G7 Presidency. France, as host of the upcoming AI Action Summit in February, underlined its intention to work with the IEA to shape a robust outcome on the energy-AI nexus. Korea, which will host the 2025 APEC Energy Ministerial, as well as the Clean Energy and Mission Innovation Ministerials, expressed its intention to work with the IEA to advance key discussions on the topic.Next week, the IEA will launch a new AI-based chatbot for users to explore the 2024 edition of the Agency’s flagship World Energy Outlook report. Developed in cooperation with Microsoft, the online tool is designed to answer questions about energy trends in natural, conversational language, allowing anyone curious about the findings of the report to easily dig into its analysis and projections.During the conference, the IEA hosted a fair for students, which explored potential solutions to the challenges of integrating AI into the energy sector. Vijay Vaitheeswaran, the Economist's Global Energy and Climate Innovation Editor, also conducted a series of fireside chats with high-profile participants.The opening session of the high-level roundtable on 5 December can be viewed here, while the fireside chats are available here. The Chair’s Summary of the conference can be found here.",
        "formatted_timestamp":"05 December 2024",
        "source":"IEA"
    }
]