[
    {
        "title":"Chairs’ Summary and Call to Action- COP29-IEA High-Level Energy Transition Dialogues",
        "subtitle":"",
        "body":"The COP29 Presidency and the International Energy Agency (IEA), with the support of the UNFCCC Secretariat, have convened a series of High-Level Energy Transition Dialogues this year to discuss the level of ambition and action required to achieve just and equitable transitions, and contribute to energy-related outcomes for COP29. These dialogues have engaged a wide range of global decision makers, from the energy sector and beyond, to share their perspectives on actions and opportunities that can contribute to energy transitions and keep 1.5°C within reach. COP28 marked a milestone achievement when Parties agreed on an outline for how the global energy sector can reach net-zero emissions by 2050, committing to ambitious targets including, inter alia, transition away from fossil fuels, triple renewable energy capacity by 2030, double energy efficiency improvements, and accelerate the deployment of low-emission technologies such as renewables, nuclear, abatement and removal technologies. We have valued the perspectives shared by stakeholders during these dialogues on how these energy goals can be advanced at COP29 and beyond. The IEA's recent report, From Taking Stock to Taking Action: How to Implement the COP28 Energy Goals, formed an important input to the Dialogues. The report assesses what full and timely implementation of the COP28 objectives would mean for the energy system and its emissions and provides guidance on how to achieve this. The COP29 Presidency set out its vision, focused on two parallel pillars - to enhance ambition and enable action - with climate finance as a top priority. On energy specifically, the COP29 Presidency has launched three initiatives as part of the COP29 Action Agenda, to respond to the energy goals agreed at COP28: the COP29 Global Energy Storage and Grids Pledge, COP29 Hydrogen Declaration, and COP29 Green Energy Zones and Corridors Pledge. We call on countries and other stakeholders to support these initiatives.Priority Themes and Key Opportunities The COP29-IEA High-Level Energy Transition Dialogues have helped identify evolving international consensus around two priority themes: 1) Actions to implement the energy goals agreed at COP28, 2) Actions to mobilise greater investment in energy transitions, particularly in emerging and developing economies. They have also helped us identify five key opportunities for COP29 to demonstrate positive progress in energy transitions and limit the rise in global temperatures to 1.5 °C above pre-industrial levels.1. Scale up energy storage and electricity grids as a key enabler to achieving the global goal of tripling renewable energy capacity this decade and ensuring that the full benefits are realised. Reaching this target requires global energy storage capacity to increase to 1,500 GW by 2030, including 1,200 GW in battery storage—representing nearly a 15-fold increase from today (IEA). On top of that, we need to accelerate permitting processes and build or upgrade over 25 million kilometers of electricity grids by 2030, with an additional 65 million kilometers by 2040, according to the IEA. Failing to act will lead to higher electricity prices, increased coal and gas generation, and greater renewable energy curtailment - driving up emissions. By endorsing the COP29 Presidency Global Energy Storage and Grids Pledge, we can take a crucial step forward to align with the 1.5°C transition pathway.2. Ensure countries accelerate policy implementation to achieve the goal of doubling energy efficiency progress by 2030. A year on from the historic agreement at COP28, the world is not yet on track to achieve this energy efficiency goal. In 2024, the world is set to see only a weak improvement in energy intensity of about 1%, the same rate as in 2023 and half the rate seen in the 2010-2019 period. Speeding up progress requires an integrated policy approach across end-use sectors, and measures to scale up investment in energy efficiency and address shortages of skilled workers. Doubling global energy efficiency improvements could provide about one-third of all emissions reductions by 2030, crucial for the transition away from fossil fuels, and can lower energy bills of consumers. The IEA is working closer than ever with governments to ensure that energy efficiency is prioritised through well-designed and implemented policies and actions, including faster electrification and technical efficiency improvements in advanced economies, stronger efficiency standards in emerging and developing economies and delivering universal access to electricity and clean cooking.3. Maintain a focus on cutting emissions from methane and fossil fuels. Growing clean energy is critical to driving down the demand for fossil fuels but - in a world characterised by uncertainty - clear policies are needed to accelerate clean energy transitions. Methane emissions are an example of an area in which additional action is needed. Many of the ways to reduce these emissions are well-known and cost-effective and can build on initiatives such as the Global Methane Pledge and the Oil and Gas Decarbonization Charter. Phasing out inefficient fossil fuel subsidies and ensuring the safe and responsible decommissioning or repurposing of fossil fuel infrastructure when it is no longer needed are also crucial. Dialogue and cooperation among a broad range of stakeholders will be essential.4. Implement solutions to boost clean energy investment in developing economies to support their transitions. This requires a tripling in annual concessional funding from today's level to USD 115 billion by 2030 - as called for in the G20 Roadmap to Increase Investment in Clean Energy in Developing Countries - and targeted solutions to lower the cost of capital and increase private-capital mobilisation for clean energy investments. Leveraging institutions capable of creating a robust pipeline of bankable clean energy projects, along with fast-tracking reforms of international financial institutions, will be essential to delivering affordable finance to where it is most needed and to ensure that no one is left behind.5. The next round of Nationally Determined Contributions should be informed by the Global Stocktake (GST) outcomes. At the GST, Parties recognised the need for deep, rapid and sustained reductions in global greenhouse gas emissions, in line with 1.5C pathways, and called on to contribute to the global efforts listed under paragraph 28, in a nationally determined manner, taking into account the Paris Agreement and their different national circumstances, pathways, and approaches. It is essential that we implement all the GST outcomes to keep us on track to a 1.5-aligned and climate resilient world. Therefore, our next rounds of NDCs should be informed by the GST outcome, integrated into national development strategies, and foster investment and support. This call can put NDCs on course to reach the 1.5°C temperature goal, and would allow deep, rapid and sustained reductions in global greenhouse gas emissions of 43 per cent by 2030 and 60 per cent by 2035 relative to the 2019 level and reaching net zero carbon dioxide emissions by 2050. Failure to heed this call may risk derailing global efforts to keep 1.5°C within reach.At COP29 in Baku, we must act decisively and collaboratively to seize these opportunities and ensure a just and equitable energy transitions for all. At the World Leaders’ Climate Action Summit at COP29, we will convene a High-Level Roundtable on Energy: Advancing Climate Mitigation Action with heads of state and government, and other senior leaders, marking the culmination of the High-Level Energy Transition Dialogue series. This will be an important moment for Parties and stakeholders to reflect on what is required to keep 1.5°C within reach and announce new actions that can accelerate inclusive clean energy transitions this decade. We encourage countries, business leaders, civil society, financial institutions and international organisations to make announcements at COP29 about the new practical actions each are taking to accelerate energy transitions, and share their high ambition for COP29, new NDCs and global climate action.",
        "formatted_timestamp":"2024-11-11 16:59:32",
        "source":"IEA"
    }
]