[
    {
        "title":"Clean energy transitions continue to accelerate, but progress is uneven",
        "subtitle":"IEA’s latest monitor shows wide variations in clean energy deployment among regions and technologies amid increased manufacturing capacity and declining costs",
        "body":"Despite concerns about setbacks in the global deployment of clean energy technologies, the latest data points to continued growth, according to a new update from the IEA. The report notes, however, that progress is uneven across different regions and technologies, highlighting the need for more supportive policies to enable countries to navigate the transition.The latest edition of the IEA’s Clean Energy Market Monitor, which provides timely tracking of clean energy deployment for a select group of technologies and outlines the implications for energy markets more broadly, covers the first half of 2024. The report shows that solar PV continues to lead clean technology deployment, with new additions up 36% from the first half of 2023, and 80% in the United States alone. Electric vehicle sales increased by 25% while new wind power capacity kept pace with the record additions seen in 2023. However, heat pump sales saw a notable decline of 10% at the global level, driven by lower sales in Europe, while those in China, the United States and Japan remained strong.Around 7 million electric cars were sold worldwide in the first half of 2024. In China, electric vehicles made up nearly 45% of China’s total car sales in the first half of the year, and the number crossed 50% in more recent months. There are also signs that clean energy transitions are accelerating in other emerging market and developing economies. Sales of electric vehicles in these markets doubled compared with the same period in 2023. Additions of solar PV capacity in India increased by 90% the first six months of this year, and by more than 30% in China over the same period. By contrast, some clean energy technologies hit hurdles in some European countries in the first half of the year. Heat pumps sales in Europe fell by almost 50% and electric car sales grew by only 3% compared with the same period in 2023. A significant drop in Germany meant that overall EV sales growth in Europe was flat despite strong growth in the United Kingdom, Belgium and the Netherlands.After an uptick in the post-pandemic period, clean energy equipment costs have resumed their downward trend. The IEA’s Clean Energy Equipment Price Index now tracks price developments for key clean energy technologies on a quarterly basis and shows that in the first half of 2024 alone, solar PV prices have dropped by 20%, grid-scale battery storage prices decreased by almost 10% while equipment prices for wind turbines have dropped by 5% over the last year.  The rapid rollout of solar PV in China in the first half of 2024 was helped by a fall in module prices, which have more than halved in the last year. This has also had positive knock-on effects for household and commercial customers using distributed solar systems, allowing them to save on their electricity bills. While falling clean energy equipment prices provide opportunities for faster transitions, supportive policies are still needed to provide the enabling conditions such as investments in electricity grids or EV charging networks. Other factors pushing clean energy technology prices down are ample manufacturing capacity and weaker-than-expected demand, which have dented the profit margins of manufacturers in some sectors, notably in the solar PV sector in China. However, other sectors of China’s technology manufacturing have shown greater resilience, specifically in batteries where domestic manufacturers saw profit margins strengthen in the first half of 2024. The report also includes the summary findings of the IEA latest monitoring product – the Real-Time Electricity Tracker – which estimates close to real-time carbon dioxide (CO2) emissions from the power sector across a range of countries that together account for around half of global electricity generation. In countries covered by the Tracker, aggregate power sector CO2 emissions are more than 1% lower in 2024 than they were at the same point last year. The Real-Time Electricity Tracker shows how an increase in the availability of renewable electricity mitigated a potential surge in emissions due to increased demand during an extremely hot summer in some parts of the world. In India, both electricity demand and emissions are around 5% higher for the year-to-date, compared with 2023. Meanwhile, electricity sectors in the European Union crossed a milestone with renewables accounting for around half of total generation between January and October. Coal- and gas-fired electricity generation combined fell to a record low share of 23% in Europe in the first 10 months of the year, with wind and solar accounting for around 30%.",
        "formatted_timestamp":"2024-11-04 11:00:00",
        "source":"IEA"
    }
]