[
    {
        "title":"Electricity grid patents surging as countries target artificial intelligence solutions",
        "subtitle":"Europe, Japan and the United States lead in power network patents, with China emerging as a strong player in smart grids",
        "body":"New patents to integrate artificial intelligence into power grids have grown sixfold in recent years, with the United States and China leading the way in AI for smart grid development, according to a new study by the European Patent Office (EPO) and the International Energy Agency (IEA).The report, Patents for Enhanced Electricity Grids, shows how patents for electricity grid technologies have surged over the past two decades as advances in digital integration and the rollout of clean energy sources are driving innovation across the energy sector. Software innovations boosted smart features in physical grid patents by 50% between 2010 and 2022, with supply-demand forecasting tools and electric vehicle charging representing the two largest areas of growth in this category.Innovation in electricity infrastructure is one of the fastest growing technology fields in the world today. To illustrate the scale of growth, the report pinpoints the period between 2009-2013 when innovation in electricity grids grew by 30% a year, seven times faster than the average for all other technology fields. The report uses global patent data to map innovation in both physical and smart grid technologies from 2001 to 2022, based on international patent families (IPFs)(1). It shows momentum gradually stabilising, but new applications remain at a consistently high level in most major regions.“Inadequate electricity grids are a barrier to economic activity and energy access while also making deployment of clean energy technologies more costly and complex,” said IEA Executive Director Fatih Birol. “This study shows that innovators are responding to the need for more competitive and flexible grid technologies, an issue that is too often overlooked. The data show encouraging growth in innovations to expand and maintain critical network infrastructure. This growth is now led by China, raising the competitive stakes for other regions. We will continue to help governments spur innovation for secure and sustainable energy transitions.”“As emphasised in Mario Draghi’s recent report, to secure its economic competitiveness, Europe must take the lead in new clean technologies and accelerate the energy transition away from fossil fuels,” said EPO President, António Campinos. “Significant progress has already been made, highlighting the urgency of investing in smarter, more flexible electricity networks to balance growing power demand with variable energy sources. This study offers a unique view of patenting trends, serving as a map for our transition to a new energy system.”Europe and Japan at the forefront, China races aheadThe European Union and Japan lead in grid innovation, each region accounting for 22% of all grid-related patents from 2011 to 2022, with the US at 20%. Within Europe, Germany (11%), Switzerland (5%), France (4%), the UK (2%) and Italy (1%) are the top countries of origin of grid patents. Meanwhile, China has emerged as the fastest-growing region for grid-related patents. Its share rose from 7% in 2013 to 25% in 2022, overtaking the EU in 2022 to become the top patenting region in this field for the first time. Role of grid-tech startupsThe study finds that universities, research institutes and smaller companies also play a significant role in electricity grid innovation. Most grid-technology startups are based in Europe and the United States; 37% of them have applied for a patent, which is significantly higher than the 6% average for European startups and suggests strong potential for attracting venture capital. (1) Each international patent family (IPF) represents a unique invention for which patent applications have been filed at a regional patent office or at two or more patent offices worldwide.",
        "formatted_timestamp":"10 December 2024",
        "source":"IEA"
    }
]