[
    {
        "title":"G20 Research and Innovation Ministerial in Brazil delivers new guide for energy innovation policy",
        "subtitle":"G20 ministers responsible for research and innovation approve the Manaus Package, which contains the IEA policy guide as a key deliverable to unlock breakthroughs in clean energy technologies",
        "body":"The International Energy Agency presented its Energy Innovation Policy Guide to government ministers responsible for research and innovation, to help decision-makers support innovators advance clean energy technologies and services.Launched at a G20 meeting convened in Manaus, Brazil, this week, the new guide was compiled to help governments and other stakeholders identify and implement a range of policy options to support continued cost reduction and enhance performance of clean energy technologies. It was developed by the IEA at the request of the Research and Innovation Working Group (RIWG) of the G20 and includes a specific focus on effective policy instruments in emerging and developing economies. Governments around the world are mapping new industrial plans to take advantage of the economic, environmental and societal benefits that clean energy transitions have to offer, with many aspiring to foster home-grown manufacturing bases. This includes supporting innovation and creating technology ecosystems that allow new ideas and concepts to flourish. This is particularly important in emerging and developing economies where, in addition to meeting climate and energy goals, technology innovation can also be an engine for growth and development to reduce inequalities and improve living standards.The guide showcases a range of policy design options and success stories, providing a platform for international knowledge exchange and co-operation. These examples are intended to provide inspiration for countries looking to tackle pressing energy challenges or move up the clean energy value chain. The guide can also be of value to bilateral and multilateral partners seeking to identify effective opportunities to provide support.Alongside the guide, the IEA work highlights a range of energy technologies relevant to emerging and developing economies in the Manaus Package, drawing on the ETP Clean Energy Technology Guide.",
        "formatted_timestamp":"2024-09-19 12:00:00",
        "source":"IEA"
    }
]