[
    {
        "title":"Global gas balance set to remain fragile in 2025 as growing demand meets tight supply",
        "subtitle":"While halt of Russian piped gas transit via Ukraine does not pose imminent supply risk for European Union, it could add to near-term LNG market pressures",
        "body":"Global natural gas markets are set to remain tight in 2025 as demand continues to rise and supply expands more slowly than before the pandemic and energy crisis, according to the IEA’s latest quarterly Gas Market Report published today.The report, which provides a thorough review of market developments in 2024 and an outlook for 2025, finds that markets moved towards a gradual rebalancing last year after the supply shock that followed Russia’s full-scale invasion of Ukraine in February 2022. Still, the global gas balance has remained fragile, highlighting the need for greater international cooperation to enhance gas supply security.Driven by fast-growing markets in Asia, global gas demand rose by 2.8%, or 115 billion cubic metres (bcm), in 2024 – well above the 2% average growth rate between 2010 and 2020. At the same time, below-average growth in liquefied natural gas (LNG) output kept supply tight, while extreme weather events added to market strains. According to the report, similar dynamics are expected to persist in 2025 before the arrival of a wave of new LNG export capacity, led by the United States and Qatar, that is set to come online over the course of the second half of this decade.Geopolitical tensions have continued to fuel price volatility in gas markets. Though the halt of Russian piped gas transit via Ukraine on 1 January 2025 does not pose an imminent supply security risk for the European Union, it could increase European LNG import requirements and further tighten global market fundamentals in 2025, the report notes. It warns that the vulnerability of Moldova is significantly greater than that of the EU, requiring close coordination between Moldova and its regional and international partners to ensure energy supply security through the winter.Due to tighter market fundamentals, growth in global gas demand is forecast to slow to below 2% this year. As in 2024, the growth is set to be largely underpinned by markets in Asia, with the region expected to account for over half of the rise in global gas demand.“Gas market fundamentals have improved over the past year, but for now, we are still seeing significant tightness due to rising demand and muted growth in LNG capacity. Heightened geopolitical uncertainty adds to the risks,” said Keisuke Sadamori, the IEA’s Director of Energy Markets and Security. “While international cooperation on gas supply security has expanded since the recent energy crisis began, greater efforts are needed from responsible producers and consumers, who should strengthen their collective efforts to reinforce the architecture for safe and secure global gas supplies.”Building on the IEA’s longstanding work on gas supply security, the IEA established a permanent Working Party on Natural Gas and Sustainable Gases Security (GWP) under the Standing Group on Emergency Questions, which aims to facilitate data and information exchange among its members and promote dialogue between producers and consumers. In April 2025, the IEA will convene an International Summit on the Future of Energy Security, hosted by the UK government. The Summit will address traditional and emerging risks related to energy security, including for natural gas.",
        "formatted_timestamp":"21 January 2025",
        "source":"IEA"
    }
]