[
    {
        "title":"Global leaders discuss how to deliver on COP28 energy goals at high-level dialogue in New York",
        "subtitle":"At COP29-IEA event, participants from around world discuss new IEA report on turning 2030 pledges into reality and what is needed at COP29 and beyond to deliver result",
        "body":"The COP29 Presidency and the International Energy Agency, in close partnership with the UN Framework Convention on Climate Change (UNFCCC) Secretariat, today held the third in a series of High-Level Energy Transition Dialogues ahead of the COP29 climate change conference in Baku, Azerbaijan.The dialogue – which was co-chaired by COP29 President-Designate Mukhtar Babayev and IEA Executive Director Fatih Birol – took place in New York City alongside the UN General Assembly and Climate Week NYC. Hosted by the delegation of the European Union to the United Nations, it convened more than 60 energy and climate leaders from around the world to discuss how to implement the ambitious energy goals agreed last year in Dubai.Participants welcomed the analysis and recommendations from a new IEA report, From Taking Stock to Taking Action: How to implement the COP28 energy goals. Published today, its analysis finds that fully implementing the COP28 energy goals – which include pledges to triple global renewable capacity and double energy efficiency progress by 2030, substantially reduce methane emissions, and transition away from fossil fuels – would be transformative for the energy sector, driving down emissions and accelerating energy transitions around the world. However, the report emphasises that further international cooperation is needed to ensure the right enabling conditions. To unlock the full benefits of the tripling goal, countries need to make a concerted push to build and modernise 25 million kilometres of electricity grids by 2030 and reach 1 500 gigawatts (GW) of energy storage capacity. Doubling efficiency, meanwhile, would require faster electrification in advanced economies, stronger efficiency standards in emerging economies and delivering universal access to clean cooking.The report also highlighted the importance of robustly reflecting the COP28 energy goals in the next round of Nationally Determined Contributions, or NDCs, under the Paris Agreement. This was a key topic of discussion during the High-Level Dialogue, along with how COP29 can support developing countries, which face additional challenges on implementation.Participants included Bahrain’s Minister of Oil and Environment and Special Envoy for Climate Affairs Mohamed bin Mubarak Bin Daina, Brazil's Secretary for Climate Change Ana Toni, Colombia’s Minister of Mines and Energy Omar Andrés Camacho, Indonesia’s Minister for Maritime Affairs and Investment Luhut Binsar Pandjaitan, Norway’s Minister of Climate and Environment Tore Sandvik, Portugal's Minister for Environment and Energy Maria da Graça Carvalho, Republic of the Marshall Islands Climate Envoy Tina Stege, Singapore's Minister for Sustainability and Environment Grace Fu, and United States Special Climate Envoy John Podesta – as well as UNFCCC Executive Secretary Simon Stiell, Special Adviser to the UN Secretary General on Climate Action Selwin Hart, COP26 President Alok Sharma, COP28 CEO Adnan Amin, Green Climate Fund Executive Director Mafalda Duarte and Hitachi CEO Andreas Schierenbeck.“The energy pledges made by nearly 200 countries at COP28 would lead to a significantly more secure, sustainable and affordable energy system if they are fully implemented. Encouragingly, during today’s High-Level Dialogue, we heard top decision makers discuss what needs to happen to turn COP promises into reality,” said IEA Executive Director Fatih Birol. “To meet the established targets, IEA analysis shows that the world must also scale up energy storage and grids, embrace all forms of efficiency, and ensure a just, orderly and equitable transition away from fossil fuels. As COP29 approaches, we will continue to convene stakeholders to build consensus and determine what can be done.”“COP29 will be a critical opportunity to help turn the energy outcomes of the first Global Stocktake into concrete action,” said COP29 President-Designate Mukhtar Babayev. “Informed by close consultation with the IEA and by this series of high-level dialogues, we have introduced three key initiatives as part of the COP Presidency’s Action Agenda. We are calling on everyone to sign up to the Energy Storage and Grids Declaration, the Green Energy Zones and Corridors Declaration, and the Hydrogen Declaration as signals of commitment to making our shared goals a reality.”The COP29 High-Level Energy Transition Dialogues aim to continue fostering international conversation around pathways to drive energy sector emissions to net zero and limit global warming to the Paris Agreement goal of 1.5 °C. They build on the success of the five Dialogues co-hosted with last year’s COP28 Presidency, which made an important contribution to the major energy outcomes reached in Dubai. The next dialogue will take place next week in Foz do Iguaçu, Brazil, during the gathering of G20 energy ministers, the 15th Clean Energy Ministerial and the ninth Mission Innovation Ministerial.",
        "formatted_timestamp":"2024-09-24 09:00:00",
        "source":"IEA"
    }
]