[
    {
        "title":"Global energy sector employment increased by 3.8% in 2023, outpacing the wider economy",
        "subtitle":"New IEA report finds that sector added 2.5 million jobs worldwide last year, led by clean technology manufacturing, though skills shortages remain a key issue",
        "body":"Employment in the global energy sector grew at a strong pace in 2023, buoyed by a wave of investment in manufacturing clean energy technologies – though shortages of skilled workers remain a major concern for employers looking to hire, according to a new IEA report published today.The third edition of the World Energy Employment report  – which assesses global energy employment by region and technology, offering crucial analysis on the industry’s evolving labour needs – finds that the number of energy jobs globally rose by 3.8% last year, reaching 68 million. By comparison, job growth economy-wide was 2.2%.The largest increase was for jobs in the clean energy sector, which rose by 1.5 million in 2023 and contributed as much as 10% of economy-wide job growth in the leading markets for clean energy technologies. The solar PV industry added over half a million new jobs, spurred by record new installations. Employment in electric vehicle manufacturing and batteries grew by 410 000 as sales reached nearly 20% of the global car market. And while some wind manufacturers experienced layoffs, total employment in the industry still climbed as a record number of new projects entered construction. The oil and gas supply sector added more than 600 000 jobs in 2023 after a period of cautious post-pandemic rehiring. However, global coal employment fell for the third year in a row, declining by around 1%, mostly due to continued improvements in upstream productivity. Growth in energy jobs was led by manufacturing – diverging from previous years, when it was generally led by construction and installation. This largely reflects the 70% rise in clean energy manufacturing investment in 2023 to $200 billion as firms responded to increasing demand for clean energy technologies and new policies.However, a lack of skilled workers in many parts of the energy industry – particularly those requiring high degrees of specialisation, such as grids and nuclear power – remains a substantial bottleneck. For the second year in a row, most respondents to the IEA’s survey of over 190 energy employers across 27 countries reported plans to hire but had difficulties finding qualified applicants for nearly all occupation categories. Though labour shortages in construction have fallen from recent highs in many advanced economies, supply remains tight, with 75% of respondents struggling to hire for these roles. This is contributing to rising wages, and it is a reason real wage growth in the energy sector has fared better than for similar roles elsewhere in the economy.“The global energy sector has been a powerful engine of jobs growth around the world in recent years. And as the energy system continues to transform and grow, rising demand for skilled energy workers is a given,” said Laura Cozzi, the IEA’s Director of Sustainability, Technology and Outlooks. “However, this report shows that greater investment in skills and training is critical. Governments, the private sector and educational and training institutions must work together to improve the hiring pipeline, which will play an important role in shaping on our energy future.”The report also finds that just one-quarter of growth in clean energy jobs since 2019 has occurred in emerging and developing economies outside of China, despite these regions representing two-thirds of the global workforce. According to its analysis, many of these countries have had limited success in attracting the clean energy investment that fuels job creation, with the competitive advantage of lower labour costs insufficient to fully overcome structural barriers such as the lack of a strong existing manufacturing base, limited skills availability and inadequate infrastructure. Addressing this gap requires stronger global cooperation and policy action.Based on early data, energy employment is set to grow by 3% in 2024, a slowdown compared with last year due to the impacts of tight labour markets, elevated interest rates and changes in the expected pipeline of new energy projects.",
        "formatted_timestamp":"2024-11-13 06:00:00",
        "source":"IEA"
    }
]