[
    {
        "title":"Global market for key clean technologies set to triple to more than $2 trillion over the coming decade as energy transitions advance",
        "subtitle":"First-of-its-kind IEA analysis shows complex interplay between energy, industrial and trade policies as countries seek to secure supply chains and economic opportunities",
        "body":"The rapid uptake of clean energy technologies offers major opportunities for countries looking to manufacture and trade them but also presents challenging decisions for governments, which face tensions and trade-offs based on the industrial and trade policies they opt to pursue, according to a new IEA report out today.Energy Technology Perspectives 2024 (ETP-2024) – the latest instalment of the IEA’s flagship technology publication – focuses on the outlook for the top six mass-manufactured clean energy technologies: solar PV, wind turbines, electric cars, batteries, electrolysers and heat pumps. Based on today’s policy settings, the global market for these technologies is set to rise from $700 billion in 2023 to more than $2 trillion by 2035 – close to the value of the world’s crude oil market in recent years. Trade in clean technologies is also expected to rise sharply. In a decade's time, it more than triples to reach $575 billion, more than 50% larger than the global trade in natural gas today.The report, which also looks at key materials like steel and aluminium, provides a first-of-its-kind analytical framework for policymakers as they navigate the dynamic and complex landscape of clean energy manufacturing and trade. Built on a newly assembled bottom-up dataset and quantitative modelling based on countries’ policies, ETP-2024 maps out the current state of clean energy manufacturing and trade and how they are set to evolve. In doing so, it explores how countries at different stages of development can capture the benefits of the emerging energy economy while seeking to ensure secure and cost-effective clean energy transitions.“The market for clean technologies is set to multiply in value in the coming decade, increasingly catching up with the markets for fossil fuels. As countries seek to define their role in the new energy economy, three vital policy areas – energy, industry and trade – are becoming more and more interlinked. While this leaves governments with tough and complicated decisions ahead, this groundbreaking new IEA report provides a strong, data-driven foundation for their decisions,” said IEA Executive Director Fatih Birol. “Clean energy transitions present a major economic opportunity, as we have shown, and countries are rightly seeking to capitalise on that. However, governments should strive to develop measures that also foster continued competition, innovation and cost reductions, as well as progress towards their energy and climate goals.”The increase in the global clean technology market has been accompanied by a record wave of investment in the manufacturing of clean technologies as countries look to bolster their energy security, maintain their economic edge and reduce emissions. Most of this spending is concentrated in the countries and regions that already have established a clear foothold in the sector and are looking to build on their positions: China, the European Union and the United States, and increasingly India. However, despite the strong impact of the Inflation Reduction Act and Bipartisan Infrastructure Law in the United States, the EU’s Net-Zero Industry Act and India’s Production Linked Incentive Scheme, China is set to remain the world’s manufacturing powerhouse for the foreseeable future. Under today’s policy settings, its clean technology exports are on track to exceed $340 billion in 2035, which is roughly equivalent to the projected oil export revenue this year of Saudi Arabia and the United Arab Emirates combined.Today, countries in Southeast Asia, Latin America and Africa account for less than 5% of the value generated from producing clean technologies. However, ETP-2024 emphasises that the door of the new clean energy economy remains open to countries at different stages of development. It identifies key opportunities for emerging and developing economies based on a country-by-country assessment of more than 60 indicators such as the business environment, infrastructure for energy and transport, resource availability and domestic market size.The report finds that beyond the mining and processing of critical minerals, emerging and developing economies could draw on their competitive advantages to move up the value chain. For example, Southeast Asia could become one of the cheapest places to produce polysilicon and wafers for solar panels within the next 10 years, while Latin America – particularly Brazil – has the potential to scale up its wind turbine manufacturing for export to other markets in the Americas. North Africa has the ingredients to become an EV manufacturing hub within the next decade, while various countries in sub-Saharan Africa could produce iron with low-emissions hydrogen. “Growth in the manufacturing and trade of clean energy technologies should be for the benefit of many economies, not just a few,” Dr Birol said. “This report shows that countries in Southeast Asia, Latin America, Africa and beyond and have strong potential to play important roles in the new energy economy. And it finds that with sound strategic partnerships, increased investment and greater efforts to bring down high financing costs, they can achieve this potential.”The report also digs into the important global implications as trade in clean energy technology expands. For one, the shift from importing fossil fuels to importing clean technologies could increase the resilience of energy supplies. While fossil fuel supplies need to be replenished as soon as they are consumed, importing clean technologies provides a durable stock of energy equipment. This results in greater efficiency: a single journey by a large container ship filled with solar PV modules can provide the means to generate the same amount of electricity as the natural gas from more than 50 large LNG tankers or the coal from more than 100 large bulk ships.However, there are also new energy security dimensions to consider. Today, around half of all maritime trade in clean energy technologies passes through the Strait of Malacca, which connects the Indian and Pacific Oceans. While the implications for energy security differ, it is worth noting that this is significantly more than the roughly 20% of fossil fuel trade that passes through the Strait of Hormuz. More details on how the trade of clean energy technologies could evolve can be found in the interactive trade explorer tool, which is part of the online version of the report.",
        "formatted_timestamp":"2024-10-30 06:00:00",
        "source":"IEA"
    }
]