[
    {
        "title":"Global coal demand is set to plateau through 2027",
        "subtitle":"New IEA report finds that strong deployment of renewables is set to curb growth in coal use even as electricity demand surges, with China – the world’s biggest coal consumer – remaining pivotal",
        "body":"After reaching a new high in 2024, global demand for coal is set to level off in the coming years as a surge in renewable power helps to meet soaring demand for electricity around the world, according to an IEA report out today.Coal 2024 – the new edition of the IEA’s annual coal market report, which analyses the latest trends and updates medium-term forecasts – shows that global coal use has rebounded strongly after plummeting at the height of the pandemic. It is poised to rise to 8.77 billion tonnes in 2024, a record. According to the report, demand is set to stay close to this level through 2027 as renewable energy sources play a greater role in generating power and coal consumption levels off in China.The electricity sector in China is particularly important to global coal markets, with one out of every three tonnes of coal consumed worldwide burned at a power plant in the country. In 2024, China continued to diversify its power sector, advance the construction of nuclear plants and accelerate its huge expansion of solar PV and wind capacity. This should help limit increases in coal consumption through 2027, according to the report, though it also highlights a number of key uncertainties in its analysis. Electricity use in a number of countries, including China, is growing at a strong pace due to a combination of factors, including the electrification of services like transport and heating, rising demand for cooling, and increasing consumption from emerging sectors such as data centres. Additionally, weather patterns could drive fluctuations in coal consumption in the short term. According to the report, coal demand in China by 2027 could be up to 140 million tonnes higher or lower than forecast due to weather-related variability in renewable generation.“The rapid deployment of clean energy technologies is reshaping the global electricity sector, which accounts for two-thirds of the world’s coal use. As a result, our models show global demand for coal plateauing through 2027 even as electricity consumption rises sharply,” said IEA Director of Energy Markets and Security Keisuke Sadamori. “However, weather factors – particularly in China, the world’s largest coal consumer – will have a major impact on short-term trends for coal demand. The speed at which electricity demand grows will also be very important over the medium term.”In most advanced economies, coal demand has already peaked and is expected to keep decreasing through 2027. The pace of decline will continue to depend on the enactment of strong policies, such as those implemented in the European Union, and the availability of alternative power sources, including cheap natural gas in the United States and Canada. Meanwhile, demand for coal is still increasing in some emerging economies where electricity demand is rising sharply along with economic and population growth, such as India, Indonesia and Viet Nam. In emerging economies, growth is mainly driven by coal demand from the power sector, although industrial use is also going up.Coal prices today remain 50% higher than the average seen between 2017 and 2019. Coal production reached an all-time high in 2024, though growth is expected to flatten through 2027 as structural changes take hold. International trade of coal by volume is also set to reach a record in 2024 of 1.55 billion tonnes. However, looking ahead, global trade volumes are set to shrink, with thermal coal seeing the biggest decline. According to the report, Asia remains the centre of international coal trade, with all of the largest importing countries in the region, including China, India, Japan, Korea and Viet Nam, while the largest exporters include Indonesia and Australia.",
        "formatted_timestamp":"18 December 2024",
        "source":"IEA"
    }
]