[
    {
        "title":"Governments have unleashed a wave of clean energy policies to benefit from the new energy economy",
        "subtitle":"New IEA report offers first-of-its-kind global inventory of the policies countries are leveraging to advance clean energy transitions and improve energy security",
        "body":"Government support and incentives for clean energy technologies have reached new highs as policymakers place renewed focus on energy security in the wake of multiple crises in recent years, according to a new IEA report.The first edition of the report – State of Energy Policy 2024 – provides the most comprehensive and up-to-date global picture of energy policies by country and sector, highlighting the most substantial changes in the past 12 months. This includes a publicly available repository – the Energy Policy Inventory – which contains over 5 000 energy-related policies worldwide across areas such as government spending, regulation and trade.The inaugural edition shows that governments around the world have earmarked almost $2 trillion in direct investment support for clean energy since 2020. This is almost triple the amount committed following the 2007-08 financial crisis. The report finds that around 80% of direct government spending allocated was in China, the European Union and the United States.Domestic manufacturing incentives for clean energy are one area of public investment that continues to grow substantially, accounting for almost 10% of total government spending since the beginning of the decade, with low-emissions vehicles, hydrogen and batteries receiving the largest allocations, according to the report. High-profile examples include the United States’ Inflation Reduction Act, India’s Production-Linked Incentive and Brazil’s Green Mobility and Innovation Programme with other countries introducing similar policies and targets.At the consumer level, the report finds that the cost of short-term government support totalled $940 billion at the height of the global energy crisis. While many emergency measures have been eased, government-led programmes to address issues of ongoing affordability and competitiveness remain in place, particularly to address the upfront costs of adopting clean energy technologies.“The unprecedented level of policy and investment support for clean energy is a recognition that these technologies not only reduce emissions but help safeguard energy security,” said Laura Cozzi, IEA Director of Sustainability, Technology and Outlooks. “The increase in trade policies and domestic manufacturing incentives also signals that clean energy is becoming central in industrial policies.”With high geographical concentrations within clean energy supply chains – across technologies such as solar PV, wind, batteries and electrolysers – the new report notes an increased policy focus on supporting home-grown manufacturing and supply chain security. This is reflected by a dramatic jump in the number of trade policies related to clean energy technologies, with nearly 200 new trade measures introduced since 2020, compared with less than 40 in the preceding five years. Import tariff adjustments, anti-dumping duties and offsetting measures, including those recently announced by the European Union and the United States, account for almost 40% of clean energy trade policy changes since 2020.Energy performance standards are another area where policy intervention has grown significantly in recent years. In 2023 alone, 35 countries – representing 20% of global greenhouse gas emissions – passed new energy performance regulations. However, some countries have also rolled back regulations, such as banning the sale of new fossil fuel boilers and internal combustion engine vehicles, and on the phase-out of unabated coal. These rollbacks affected around 1% of current global emissions and were outweighed by increased stringency in other parts of the world.",
        "formatted_timestamp":"2024-09-26 17:00:00",
        "source":"IEA"
    }
]