[
    {
        "title":"Growth in global electricity demand is set to accelerate in the coming years as power-hungry sectors expand",
        "subtitle":"Increase in electricity consumption through 2027 expected to average around 4% annually, driven by growing use for industry, air conditioning, electrification and data centres",
        "body":"The world’s electricity consumption is forecast to rise at its fastest pace in recent years, growing at close to 4% annually through 2027 as power use climbs in a range of sectors across the economy, according to a new IEA report released today.Electricity 2025, the latest edition of the IEA’s main market analysis of the sector, forecasts that the growth in global demand will be the equivalent of adding an amount greater than Japan’s annual electricity consumption every year between now and 2027. The surge is primarily driven by robust growing use of electricity for industrial production, increased demand for air conditioning, accelerating electrification, led by the transport sector, and the rapid expansion of data centres. Most of the additional demand over the next three years will come from emerging and developing economies, which account for 85% of the demand growth. The trend is most pronounced in China where electricity demand has been growing faster than the overall economy since 2020. China's electricity consumption rose by 7% in 2024 and is expected to grow by an average of around 6% through 2027. The demand growth in China has been fuelled in part by the industrial sector, where alongside the traditional energy-intensive sectors, the rapidly expanding electricity-intensive manufacturing of solar panels, batteries, electric vehicles and associated materials played a significant role. Air conditioning, electric vehicle adoption, data centres and 5G networks are additional contributors.“The acceleration of global electricity demand highlights the significant changes taking place in energy systems around the world and the approach of a new Age of Electricity. But it also presents evolving challenges for governments in ensuring secure, affordable and sustainable electricity supply,” said IEA Director of Energy Markets and Security Keisuke Sadamori. “While emerging and developing economies are set to drive the large majority of the growth in global electricity demand in the coming years, consumption is also expected to increase in many advanced economies after a period of relative stagnation. Policy makers need to pay close attention to these shifting dynamics, which will be addressed at the international Summit on the Future of Energy Security that the IEA is hosting with the UK government in London in April.”In the United States, a strong increase in electricity demand is expected to add the equivalent of California's current power consumption to the national total over the next three years. Electricity demand growth is forecast to be more modest in the European Union, only rising back to its 2021 levels by 2027, following the major declines in 2022 and 2023 triggered by the energy crisis.The new report forecasts that growth in low-emissions sources – primarily renewables and nuclear – is sufficient, in aggregate, to cover all the growth in global electricity demand over the next three years. In particular, generation from solar PV is forecast to meet roughly half of global electricity demand growth through 2027, supported by continued cost reductions and policy support. Electricity generation from solar PV surpassed that from coal in the European Union in 2024, with solar’s share of the power mix exceeding 10%. China, the United States and India are all expected to see solar PV’s share of annual electricity generation reach 10% between now and 2027. At the same time, nuclear power is making a strong comeback, with its electricity generation on course to hit new highs every year from 2025 onward over the forecast period. As a result of these forecast trends, carbon dioxide emissions from global electricity generation are expected to plateau in the coming years after increasing by about 1% in 2024.The report examines some of the major strains faced by electricity systems in 2024, including winter storms in the United States, hurricanes in the Atlantic, blackouts caused by extreme weather in Brazil and Australia, and droughts reducing hydropower in Ecuador, Colombia and Mexico. These events highlight the importance of ensuring greater resilience of electricity systems, the report notes.It also looks at the critical role of weather for electricity systems and the rising volatility in wholesale electricity prices in some regions, which indicate a growing need for system flexibility. Incidences of negative wholesale electricity prices have been rising in some power markets, although they are still relatively uncommon globally. These occurrences broadly signal insufficient flexibility in the system due to technical, regulatory or contractual reasons.",
        "formatted_timestamp":"14 February 2025",
        "source":"IEA"
    }
]