[
    {
        "title":"High-level IEA-COP29 event on turning methane pledges into action focuses on how to achieve meaningful progress",
        "subtitle":"Global leaders meet in New York to discuss practical strategies for tackling methane emissions and opportunities for collaboration",
        "body":"The International Energy Agency and Azerbaijan's COP29 Presidency convened decision makers from around the world in New York City today to discuss how government and industry can deliver on their ambitious promises to slash methane emissions from the energy sector.About 100 people – including ministers, top executives and heads of international organisations – attended the event, which took place during the United Nations General Assembly and Climate Week NYC. In conversations chaired by IEA Executive Director Fatih Birol and COP29 President-Designate Mukhtar Babayev, participants highlighted the action plans that countries and companies are developing to reduce methane emissions from fossil fuels, as well as how financial institutions and greater regional collaboration could support the implementation of methane abatement pledges.They also explored how the upcoming COP29 and COP30 climate conferences can build on recent efforts, highlighting the important opportunity to incorporate methane into the next round of Nationally Determined Contributions (NDCs) under the Paris Agreement.Participants in the event included European Commissioner for Energy Kadri Simson, Germany’s State Secretary and Special Envoy for International Climate Action Jennifer Morgan, United Arab Emirates Minister of Climate and Environment Amna Al Dahak Al Shamsi, United Kingdom Minister for International Energy and Climate Kerry McCarthy and United States Special Climate Envoy John Podesta, as well as Environmental Defense Fund (EDF) President Fred Krupp, Latin American Energy Organization (OLADE) Executive Secretary Andrés Rebolledo and Fortescue Executive Chairman Andrew Forrest.Methane is responsible for around 30% of the rise in global temperatures since the Industrial Revolution. Emissions from the energy sector remained near a record high in 2023, though significant policies and regulations announced in the past year, as well as fresh pledges stemming from the COP28 climate summit in Dubai, have the potential to put them into decline soon. At COP28, nearly 200 countries promised to substantially cut methane emissions this decade, while new companies committed to action through the launch of the Oil and Gas Decarbonization Charter, which now has over 50 signatories. The COP29 Presidency is now building on that momentum by calling on parties to join the COP29 Declaration on Reducing Methane from Organic Waste to reduce methane in waste and food systems.“It has been very encouraging to see more attention focused on cutting methane emissions from fossil fuels, which are a key driver of climate change. If they are fully implemented, the pledges made by countries and companies in the past year could have a huge impact,” said IEA Executive Director Fatih Birol. “Many solutions to tackle methane emissions are proven and cost-effective. Together with the COP29 Presidency, we will continue to support government and industry as they work to address this vital issue and turn promises into action.” “Enhancing ambition and enabling action on methane is an important part of the COP29 Presidency’s plan to slow global warming this decade,” said COP29 President-Designate Mukhtar Babayev. “We are determined to address methane emissions from all sources. Building on the COP26 Global Methane Pledge and the COP28 Oil and Gas Decarbonisation Charter, we are calling on all Parties to now endorse the COP29 Declaration on Reducing Methane from Organic Waste. We will also co-host a summit on methane and non-CO2 greenhouse gases with the US and China and work to ensure financial solutions are a core part of this agenda to turn pledges into progress.”Following the high-level event, the IEA will host a series of technical workshops focused on the challenges and opportunities for tackling methane emissions in specific regions. The first workshop will take place on 2 October during Baku Climate Action Week. It will focus on the Caucasus and Central Asia, bringing together technical experts from the region and beyond to accelerate action on methane abatement.This week, the IEA, the United Nations Environment Programme’s International Methane Emissions Observatory (IMEO) and EDF also released a new report outlining the comprehensive new framework that will be used to support and report progress by oil and gas companies towards the emissions and flaring targets they have set, including through the OGDC launched at COP28. The first independent assessment using the metrics laid out in the report is planned for next year.",
        "formatted_timestamp":"2024-09-24 09:00:00",
        "source":"IEA"
    }
]