[
    {
        "title":"IEA sets up new office in Singapore to strengthen energy collaboration in Southeast Asia",
        "subtitle":"",
        "body":"The International Energy Agency (IEA) and Singapore inaugurated the IEA Regional Cooperation Centre - the IEA’s first office outside of its Paris headquarters in its 50-year history. IEA Executive Director Dr Fatih Birol, Singapore’s Deputy Prime Minister Gan Kim Yong, Singapore’s Second Minister for Trade and Industry Dr Tan See Leng, IEA Governing Board Chairman Dr Anders Hoffmann and IEA Chair of Standing Group of Global Energy Dialogue Ursula Borak inaugurated the new office at a ceremony during Singapore International Energy Week.The Centre will deepen and expand the IEA’s longstanding collaboration with countries in Southeast Asia and beyond, as they navigate the significant energy opportunities and challenges ahead. It will serve as a hub for the IEA’s activities and engagement in the region, providing policy guidance, technical assistance, training and capacity building across areas such as scaling-up the deployment of renewables and other clean energy technologies, increasing cross-border power trade, and improving access to finance for clean energy investment. It will also improve the IEA’s overall understanding of the fast-growing region to support its broader work on global energy security and energy transitions.While most countries in Southeast Asia have announced ambitious targets for reaching carbon neutrality, the IEA’s latest analysis indicates that energy demand in this region is set to grow by more than 60% by 2050, with a continued reliance on fossil fuels based on today’s policy settings. Meeting energy security and emissions goals will require countries in the region to take decisive actions to improve energy efficiency, accelerate renewable power generation and switch to low emissions fuels.IEA Executive Director Dr Fatih Birol said: “The opening of the IEA’s new office in Singapore is an historic moment for the IEA and signals a step change in our relationship with Southeast Asia. We look forward to working much more closely with all the countries in this dynamic and fast-growing region, whose influence over global energy trends is markedly increasing.”Second Minister for Trade and Industry Dr Tan See Leng said: “The Centre's launch marks an inflection point in our partnership with the IEA and underscores our shared commitment to contribute to our regional energy goals. This collaboration is set to catalyse action and sharpen efforts towards an integrated ASEAN Power Grid, advancing financing mechanisms for energy transitions, and the adoption of energy technologies. I look forward to greater energy security and resilience within the region through our strengthened collaboration.”Chief Executive of the Energy Market Authority (EMA) of Singapore Mr Puah Kok Keong said: “The EMA and the IEA have shared a longstanding partnership over the years. We have collaborated closely on energy security, energy efficiency, clean energy investments and energy technologies. We have also established the Singapore-IEA Regional Training Hub and Singapore-IEA Forum in 2016 when Singapore became an Association Country. Anchoring the IEA’s presence in the region is part of Singapore’s efforts in deepening cooperation with international partners towards a cleaner, more resilient and sustainable energy future for all.”Background: The IEA is at the heart of global dialogue on energy, providing authoritative analysis, data, policy recommendations, and real-world solutions to help countries provide secure and sustainable energy for all. The IEA was created in 1974 to help co-ordinate a collective response to major disruptions in the supply of oil. While oil security remains a key aspect of the Agency’s work, the IEA has expanded significantly and today examines a full spectrum of issues including clean energy technologies, electricity systems and markets, access to energy, demand-side management, and much more.The IEA has had strong cooperation with countries in Southeast Asia for decades, particularly its Association countries in the region. The Agency also serves as a key strategic partner to the Association of Southeast Asian Nations (ASEAN). Since Singapore joined the IEA as an Association country in 2016, collaboration has deepened to enhance capacity building and facilitate policy exchanges in Southeast Asia. This has been accomplished through platforms such as the Singapore-IEA Regional Hub and the Singapore-IEA Ministerial Forum.",
        "formatted_timestamp":"2024-10-21 04:00:00",
        "source":"IEA"
    }
]