[
    {
        "title":"IEA to host 20th Energy Efficiency Policy Training Week in Paris",
        "subtitle":"",
        "body":"The 20th edition of the IEA’s Energy Efficiency Policy Training Week will be held from 7-11 April 2025 at its headquarters in Paris.Since 2015, the IEA’s Energy Efficiency Policy Training Weeks have equipped more than 3 000 government officials from over 125 countries with the tools and knowledge to implement effective energy efficiency policies.The event in April represents a unique opportunity for policy makers to learn from international best practice and foster a growing global community of energy efficiency practitioners, helping them advance the goal of doubling energy efficiency by 2030 while improving people’s lives. “Improving energy efficiency can deliver huge benefits for countries around the world, bolstering energy affordability and security,” said IEA Executive Director Fatih Birol. “The 20th edition of the IEA's Energy Efficiency Policy Training Week, which is set to gather the most diverse array of policy makers to date, will be an important tool for driving progress, ensuring that governments are equipped to develop and implement effective energy efficiency measures that support national and international energy goals.”The Training Week will feature an opening day of high-level discussions with senior representatives from governments around the world. Participants will then take part in several days of focused training courses on a selected topic, which will be led by IEA and international experts.Tracks include buildings, appliances, industry, transport, and energy efficiency indicators and policy evaluation. Participants will also have opportunities for networking and discussions with guest speakers on themes such as the social benefits of energy efficiency policies.For more information, and to apply, visit the Training Week’s event page.",
        "formatted_timestamp":"21 January 2025",
        "source":"IEA"
    }
]