[
    {
        "title":"IEA to hold major Global Conference on Energy Efficiency in Brussels in June 2025",
        "subtitle":"IEA Executive Director Fatih Birol and European Commissioner for Energy and Housing Dan Jørgensen today announced that they will co-host the IEA’s 10th Annual Global Conference on Energy Efficiency in Brussels, Belgium, on 12-13 June 2025.",
        "body":"The Annual Global Conference brings together ministers, business leaders and industry representatives to drive stronger action on energy efficiency. A key focus of the conference will be the global agreement to double energy efficiency progress this decade. The latest IEA analysis shows that governments are not on track to achieve the doubling goal, with stronger policy action needed on energy efficiency in a range of areas such as buildings, industry and transport. The role that energy efficiency can play in boosting industrial competitiveness and energy affordability for households and businesses will also be discussed in detail at the conference in Brussels.“The current rate of progress in energy efficiency is disappointingly slow, given the critical role it can play in improving energy security, reducing energy costs and lowering emissions,” said Dr Birol. “The 10th edition of the IEA’s Annual Global Conference on Energy Efficiency, which we will co-host with the European Commission, will provide an opportunity for key stakeholders from across the globe to come together to assess what can be done to speed up improvements in energy efficiency.”Commissioner Jørgensen said: “The Commission is honoured to co-host the IEA’s 10th Annual Global Conference on Energy Efficiency and looks forward to welcoming participants from all corners of the world. I am confident that this conference will provide insights and commitments to increase our collective efforts to meet the Global Pledge on doubling energy efficiency by 2030. Energy efficiency is a cornerstone of decarbonisation and the just transition and, as such, it needs to be prioritised and mainstreamed. I am grateful to the IEA for relentlessly working towards these goals with all the partners involved.”The event, jointly organised by the IEA and the European Commission, will focus on how governments can ensure that ambitious targets turn into implementation and attract on-the-ground investment for emerging and advanced economies alike. The 10th Global Conference is being held in partnership with the Energy Efficiency Movement, a global community to accelerate at scale the adoption of energy efficient solutions within industry. “Industries play a key role in accelerating energy efficiency,” said Mike Umiker, Executive Director of the Energy Efficiency Movement. “The conference provides a great opportunity to unite industry leaders to share knowledge and collaborate.”The event follows the 9th Global Conference held in Nairobi, Kenya, in May 2024. It was the first time an African nation had hosted the event, with more than 650 representatives attending from around the world. Delegates emphasised the importance of scaling up energy efficiency investments, particularly in emerging and developing economies, and reinforced global commitments to achieving energy efficiency targets.",
        "formatted_timestamp":"16 December 2024",
        "source":"IEA"
    }
]