[
    {
        "title":"IEA Committee on Energy Research and Technology focuses on state and prospects of nuclear fusion at thematic workshop",
        "subtitle":"Representatives from government, academia and industry meet to discuss strategies for enhancing public-private collaboration to accelerate progress on nuclear fusion",
        "body":"A special thematic workshop focused on the status and prospects for fusion energy convened at the IEA’s headquarters today, alongside the official meeting of the IEA's Committee on Energy Research and Technology (CERT). The event brought together representatives from academia and industry to share perspectives on fusion energy with CERT members, who represent IEA member governments.With more than 30 participants attending in-person, and an additional 40 joining online, the workshop addressed priority actions for governments to accelerate research and development in fusion energy as well as improved collaboration between public and private actors.Attendees were welcomed by Toshiyuki Sakamoto, Vice Chair of CERT; Timur Gül, IEA's Chief Energy Technology Officer; and David Maisonnier, Chair of the Fusion Power Coordinating Committee (FPCC), which coordinates the activities of the eight IEA Technology Collaboration Programmes (TCPs) working on fusion energy.Fusion energy offers the possibility of generating unlimited baseload electricity with almost no carbon dioxide (CO2) emissions, while creating only small amounts of short-lived radioactive waste. However, the technology remains at an early development stage today.Multiple experimental fusion projects are underway globally, with research breakthroughs continuing to emerge. Government and industry efforts are also intensifying in many countries with companies and start-ups across the United States, Europe and Asia actively working on fusion energy development.Workshop participants explored key opportunities and challenges facing fusion energy efforts. Discussions centred on effective policies and funding mechanisms for accelerating progress, including government and industry-led approaches. Given the scale and complexity of fusion projects, international collaboration was highlighted as crucial for advancing research and enhancing cooperation between industry and publicly funded research.The IEA has supported fusion energy research for many years through its TCPs, which work on fundamental and applied research questions as well as cross-cutting aspects such as safety.",
        "formatted_timestamp":"26 February 2025",
        "source":"IEA"
    }
]