[
    {
        "title":"IEA Executive Director addresses world leaders on crucial AI-energy nexus at international summit chaired by France and India",
        "subtitle":"In a speech to around 300 leaders, including heads of state, ministers and CEOs, Dr Fatih Birol emphasises that the AI revolution hinges on stronger coordination on energy needs",
        "body":"IEA Executive Director Fatih Birol today addressed leaders from around the world at the French government’s Artificial Intelligence Action Summit in Paris, highlighting the deep links between AI and energy and stressing the need for greater cooperation among the energy industry, the tech sector and policy makers as the development and uptake of AI accelerates.Dr Birol spoke to an audience including French President Emmanuel Macron and Indian Prime Minister Narendra Modi, who jointly chaired the event, along with many other leaders such as European Commission President Ursula von der Leyen, Finnish Prime Minister Petteri Orpo, United States Vice President JD Vance, United Nations Secretary-General António Guterres, and CEOs including Google’s Sundar Pichai and Naver’s Choi Soo-yeon. In his remarks, Dr Birol highlighted the many opportunities presented by AI, as well as the risk that AI progress could be hampered if the necessary energy infrastructure is not planned and built out at an adequate pace.“There is no AI without energy – specifically electricity. Thousands of data centres are set to be built in the next five years. But our analysis at the IEA shows that unless the energy industry, tech sector and governments collaborate to deliver the necessary power infrastructure, many projects could be delayed or even cancelled,” Dr Birol said. “That is why bringing together companies and energy policy makers is so strategic and important, and why the IEA will continue to work with leaders around the world on this essential issue.”",
        "formatted_timestamp":"11 February 2025",
        "source":"IEA"
    }
]