[
    {
        "title":"IEA member governments update IEA Shared Goals with strong focus on energy security and clean energy transitions",
        "subtitle":"",
        "body":"IEA member governments have updated the set of principles – known as the IEA Shared Goals – that highlight the priority areas for simultaneously ensuring energy security and advancing clean energy transitions.IEA members first agreed on a set of Shared Goals in 1993. Now, over three decades later during the Agency’s 50th anniversary year, the new set of goals builds on the 1993 version while also drawing inspiration from the joint communiques from the 2022 and 2024 IEA Ministerial Meetings. The Shared Goals reflect the consensus of IEA member governments and provide a set of general guidelines for the IEA Secretariat to base its coordination and cooperation with governments, decision-makers and industry leaders around the world.The revised IEA Shared Goals cover a broad range of key areas, such as energy security including and beyond oil, supply chains for clean energy technologies and critical minerals, effective energy markets, energy sector diversification, people-centred energy transitions, innovation, energy efficiency, international cooperation, accurate energy data and statistics, and more. The text of the revised Shared Goals is as follows: IEA Shared GoalsThe IEA provides authoritative analysis, data, policy recommendations, and real-world solutions to help countries, within and beyond the IEA membership, in the global effort to maintain energy security, accelerate clean energy transitions with a view to attaining net zero greenhouse gas emissions globally by 2050, and ensure access to affordable and clean energy for all. IEA members seek to create conditions in which their economies' energy sectors can make the fullest possible contribution to sustainable economic development and to the well-being of their people and the environment. In formulating energy policies, open and transparent markets are a fundamental point of departure. Recognising the significance of increasing global interdependence in energy and among all forms of energy, IEA members seek to promote the effective operation of international energy markets and to encourage dialogue and cooperation with all energy stakeholders. Given the importance of continuing to guarantee energy security while addressing present and future energy and energy-related needs in a climate-constrained world, IEA members, therefore, aim to create policy frameworks consistent with the following shared goals:Advancing energy transitions: Energy plays a critical role in the fight against climate change while promoting shared economic prosperity. Practical, concrete clean energy transitions and energy sector transformations, including the transition away from fossil fuels in energy systems, in a just, orderly and equitable manner, so as to achieve net zero by 2050 in keeping with the science, are necessary to limit global average temperature increases to 1.5°C and thereby mitigate the consequences of climate change.Ensuring energy security: Energy systems have the ability to respond promptly, flexibly, and resiliently to energy emergencies, in some cases, requiring collective mechanisms and action. IEA members cooperate through the Agency in responding jointly to oil supply emergencies as the IEA oil stockholding system continues to play a key role in contributing to global energy security. IEA members also strengthen the IEA’s role in ensuring the security of other energy sources and infrastructure and oppose using access to energy as an instrument of economic coercion, which puts energy security at risk.Promoting clean energy and secure supply chains: An array of clean energy sources makes a substantial and increasing contribution to the energy transitions and supply diversity of IEA countries. Ensuring that these technologies are available at scale will require a focus on clean energy technology manufacturing, partnerships and efforts to ensure that the supply of critical minerals is sustainable, secure, resilient, and responsible.Diversifying energy sources: Clean energy transitions and energy security are inextricably linked. Diversification, efficiency and flexibility within the energy sector are basic conditions for both energy security and accelerating energy transitions. Therefore, the fuels and other energy carriers used within and across sectors and their sources are as diverse as practicable. Increasing the efficiency of the energy system: Energy efficiency is the “first fuel” and a critical component of net zero strategies as it still represents the cleanest and, in many cases, the most cost-effective way to meet our energy needs. Significant opportunities for greater energy efficiency at all stages of the energy cycle from production to consumption are realised, including through implementation of effective policy, creation of conditions to attract investments as well as strong efforts by all energy users.Maintaining open and transparent markets: Undistorted energy prices enable markets to work efficiently. Distortions to energy trade and investment are avoided to the extent possible. The environmental costs of energy production and use are reflected in prices to the extent necessary and practicable. Diversified, traceable clean energy supply chains contribute to efficient energy markets and energy security.Advancing research, development and market deployment of new and improved energy technologies: Energy technology policies complement broader energy policies. Broad international cooperation, including with the private sector, in the development and dissemination of energy technologies, is encouraged.Putting people at the centre of transitions: Clean energy transitions and energy sector transformation present significant economic opportunities and will continue to be major drivers of economic growth and jobs, increasing access to affordable energy and alleviating energy poverty. People-centred energy transitions ensure inclusivity with a focus on skills, decent jobs, worker protection, leadership opportunities, the important role of diversity and gender equality, and social and economic development, to lift up the quality of life for people around the world. This requires attention to employment, investment and energy access, addressing in particular human, labour, Indigenous Peoples and local communities’ needs and giving a priority to those in vulnerable situations.Enhancing international collaboration: IEA members continuously deepen engagement with countries beyond the IEA membership as a crucial means to achieve energy security, clean energy investment and climate goals. Cooperation and data-sharing among all energy market participants and, where appropriate, other relevant stakeholders, helps to improve information and understanding, and encourages the development of efficient, clean and flexible energy systems and markets worldwide. IEA is a key contributor to multilateral fora. Avoiding environmental impacts: The provision and use of energy in a manner that minimises adverse environmental impacts in line with net zero trajectories is central to the achievement of these shared goals. IEA members seek to reduce or eliminate environmental impacts of energy activities. More environmentally acceptable energy sources need to be prioritised, encouraged and developed.Providing accurate and granular data and statistics: As the recognised global energy authority, the IEA, through its energy data and holistic, evidence-based analysis, helps generate innovative policies and standards to improve energy planning and policy making, thereby strengthening the rules-based international order, and build stronger, more secure, sustainable and more inclusive energy systems. Applying shared values: Finally, beyond ensuring energy security and assisting with the energy transitions to attain global net zero greenhouse gas emissions by 2050, IEA members share the values of individual liberty, democracy, the rule of law and the defence of human rights, and are committed to their preservation.The Shared Goals (2024) are based upon previously adopted Shared Goals (1993) as well as recent Ministerial Communiqués (2022, 2024). Any country wishing to become an IEA member must endorse them as part of the membership accession process. The Shared Goals also provide general guidelines for the work of the IEA Secretariat, enable coordination and cooperation with partner countries and sector stakeholders, and serve as the benchmark for the In-Depth Reviews of Energy Policy.",
        "formatted_timestamp":"15 November 2024",
        "source":"IEA"
    }
]