[
    {
        "title":"IEA and IIT Delhi strengthen collaboration on clean energy technologies and transitions",
        "subtitle":"",
        "body":"The IEA and the Indian Institute of Technology Delhi (IIT Delhi) signed a Memorandum of Understanding (MoU) on the role of energy technology innovation in reducing emissions and leading clean energy transitions.  The MoU, which establishes a framework for cooperation between the IEA and IIT Delhi, was signed at the IEA Headquarters in Paris by Executive Director Fatih Birol and remotely by IIT Delhi Director Rangan Banerjee and Deputy Director for Strategy & Planning Ambuj Sagar. The MoU was signed in the presence of the Ambassador of India to the Republic of France and Principality of Monaco Jawed Ashraf.The MoU identifies key areas of collaboration including policy analysis to foster energy innovation and information exchange on energy technology trends, particularly in emerging and developing economies.IIT Delhi is one of 23 technology institutes established as centers of excellence for education and research in science, engineering, and technology in India since its creation in 1961. The IEA and IIT Delhi recently published a joint report - Clean Energy Innovation Policies in Emerging and Developing Economies – which examines the economic opportunities and role that policy can play in expanding the new energy economy in emerging markets and developing economies. The report was launched at the 15th Clean Energy Ministerial and the 9th Mission Innovation Ministerial in Foz do Iguaçu, Brazil, attended by experts from industry, international institutions, government, the private sector, academia, and civil society organisations.  IEA’s Executive Director Fatih Birol: “The IEA looks forward to working closely with IIT Delhi on some of the most pressing energy challenges facing the world today. The potential for emerging and developing economies in the new energy economy is vast, but the policies, investment and expertise must be tapped if it is to be realised. This MoU will help address some of the existing barriers through knowledge sharing, best practices and tangible actions that can support countries to deploy clean energy technologies and make progress on their climate and energy goals.”IIT Delhi's Director Rangan Banerjee: “We are delighted to be partnering with the IEA to work on the clean energy transition. We believe this partnership can help us build capacity to address the climate and sustainability challenge and develop future-ready graduates for society. IEA and IIT Delhi together can enable strategies for developing and emerging economies to manage the transition to net zero.”",
        "formatted_timestamp":"2024-10-08 18:07:36",
        "source":"IEA"
    }
]