[
    {
        "title":"India's natural gas demand set for 60% rise by 2030, supported by upcoming global LNG supply wave",
        "subtitle":"New IEA analysis shows India's gas market is at an inflection point as infrastructure expansion and policy support drive unprecedented growth in consumption",
        "body":"India's natural gas demand is forecast to increase by nearly 60% by 2030, a new IEA report finds, marking a significant shift in the country's energy landscape and putting India’s projected gas demand on a par with some of the world’s largest consumers.The report, India Gas Market Report: Outlook to 2030, shows the country’s gas consumption is set to reach 103 billion cubic meters (bcm) annually by the end of the decade. Following over a decade of slow growth and periodic declines, India’s natural gas demand increased by more than 10% in both 2023 and 2024, indicating an inflection point. While total gas consumption in 2023 was only marginally higher than 2011 levels, three key factors are now converging to drive substantial growth: rapid infrastructure expansion, recovering domestic production, and an expected easing of global gas market conditions.\"India's gas market is entering a new phase of growth, supported by significant infrastructure development and clear policy direction,\" said IEA Director of Energy Markets and Security Keisuke Sadamori. \"The prospect of higher gas demand in India coincides with an expected wave of new global LNG supply. However, it will require careful planning and market coordination to ensure supply security and to help gas to compete in a price-sensitive market.\"Infrastructure development is playing a crucial role in enabling market growth. Since 2019, India has almost quadrupled its number of compressed natural gas (CNG) stations and more than doubled the number of residential gas connections, while extending its transmission pipeline network by 40%. By 2030, the number of CNG stations and residential connections is expected to nearly double again, with the gas transmission grid expanding by an additional 50%.The city gas distribution sector is expected to lead consumption growth in India between now and 2030, supported by rapid CNG infrastructure expansion and competitive pricing against liquid fuels. The heavy industry and manufacturing sectors are expected to add around 15 bcm of demand during this period, while gas use in oil refining is forecast to increase by more than 4 bcm as more refineries connect to the network.India’s domestic gas production, which met 50% of demand in 2023, is projected to grow gradually, reaching just under 38 bcm by 2030. This would put it around 8% above 2023 levels. The limited growth in domestic supply means India's LNG imports will need to more than double to around 65 bcm a year by 2030 to meet rising demand.India is looking to increase the share of gas in its energy mix and the report identifies potential for even higher growth under an accelerated scenario, where targeted policy measures could push total demand to approximately 120 bcm by 2030 – comparable to the current gas consumption of South America. This scenario would require additional policy support to drive higher utilisation of gas-fired power plants, faster adoption of LNG in heavy-duty transport, and more rapid expansion of city gas infrastructure.Looking ahead, the report emphasises the need for strategic planning in LNG procurement and import infrastructure. As legacy contracts expire, India faces a widening gap between contracted supply and projected demand after 2028, potentially increasing exposure to spot market volatility unless new long-term contracts are secured in the coming years.The key findings of the report are being presented at India Energy Week in Delhi on 12 February.",
        "formatted_timestamp":"12 February 2025",
        "source":"IEA"
    }
]