[
    {
        "title":"International collaboration has delivered in some high emissions sectors, but progress must speed up",
        "subtitle":"Strengthening international collaboration is vital to reduce emissions in the global economy’s largest emitting sectors to deliver on ambitious climate pledges, new report finds",
        "body":"Some sectors are making notable progress through international cooperation, but more widespread efforts are needed to achieve clean energy transitions and reach 2030 climate goals, according to the latest Breakthrough Agenda report.The new report – an annual collaboration between the International Energy Agency (IEA) and the United Nations Climate Change High-Level Champions – shows that countries are making encouraging advances in laying the foundations for the clean energy transition and the creation of new markets, but that greater efforts are needed to build demand for key technologies. The report assesses developments since 2023 in priority areas for international collaboration and sets out a series of recommendations for countries to work together in each sector to help reduce emissions within the current decade and minimise the adverse impacts of climate change. The report’s recommendations span financial assistance, research and development, demand-creation, infrastructure, standards and trade – with the aim of accelerating the energy transitions of the largest emitting sectors. Coordinated actions in the power, hydrogen, road transport, steel, cement and buildings sectors – which together contribute around three-quarters of cumulative energy-related carbon dioxide emissions reductions by mid-century in the IEA Net Zero Emissions by 2050 Scenario – will help mobilise investment and can create the economies of scale required to bring down the price of crucial technologies and sustainable solutions.In the past year, some sectors have made notable advances, such as hydrogen, which saw good progress as countries worked together on common standards and scaling up financial support for new projects. Progress was also made in some areas of the steel, cement and buildings sectors, as new agreements and partnerships were announced to boost financial assistance and establish shared objectives to reduce emissions in these industries.Released during Climate Week NYC and just ahead of both the Clean Energy and Mission Innovation Ministerial Meetings in Brazil, the report details how to foster international collaboration between countries – with different energy mixes, political systems and policy priorities – to work together on common goals. It examines the advances made and actions needed to meet the goals of the Breakthrough Agenda, which is supported by 59 countries with over 150 ongoing initiatives since its launch in 2021. The annual Breakthrough Agenda process aims to align actions by countries to make clean technologies and sustainable solutions more affordable, accessible and attractive than fossil fuels. The report tracks developments in practical international collaboration towards 2030 goals in the power, hydrogen, road transport, steel, cement, buildings and agriculture sectors, which together represent over 60% of global emissions. Translating the report’s recommendations into priority actions in each sector will be an important next step for countries at COP29.  A separate report will be published on 1 October which assesses progress in agriculture in the context of the Breakthrough Agenda. IEA Executive Director Fatih Birol said: “The expansion of clean energy technologies is accelerating rapidly. We can take encouragement from the signs that international collaboration is strengthening in some sectors, but there is still much to do. If we’re going to meet our shared climate goals, the world will need to come together quickly. Support for and engagement with emerging and developing economies is a crucial element in this regard. In an uncertain world, countries must work harder to bridge the gaps and address areas that will be mutually beneficial as clean energy transitions advance.”Ms Nigar Arpadarai, UN Climate Change High-Level Champion for COP29 said: “There is a clear and urgent need for all parts of society to work together to confront the existential challenge of climate change. The Breakthrough Agenda Report 2024 demonstrates that international collaboration is vital for making clean and sustainable technologies the most affordable, accessible and attractive option in all sectors and regions by 2030. We urge governments and businesses to act on its recommendations and work together to adopt harmonised standards, boost market demand for green products, mobilise financing and technical assistance, and undertake coordinated research and development for accelerated implementation of climate solutions.”The Breakthrough Agenda commitment was first launched at COP26 in Glasgow in 2021, under the COP26 Presidency of the United Kingdom. The process has since been supported by a partnership with the COP28 Presidency of the United Arab Emirates, announced in January 2023.UK Energy Secretary Ed Miliband said: “Today’s report sends a clear reminder of the impact that can be made by countries working together, helping speed up the transition to clean technology, renewables and zero emissions vehicles. Our mission to become a clean energy superpower by 2030 will deliver new energy projects, protect billpayers and create thousands of high-quality jobs, and we will share our experiences at events like the G20 in Brazil, and COP29 in Baku.”",
        "formatted_timestamp":"2024-09-27 07:00:00",
        "source":"IEA"
    }
]