[
    {
        "title":"International Summit on Future of Energy Security to take place 24-25 April 2025 in London",
        "subtitle":"Convened by IEA and hosted by UK government, Summit at Lancaster House will assess changing energy security landscape and how to address short- and long-term challenges",
        "body":"The IEA will convene an International Summit on the Future of Energy Security on the 24 and 25 April 2025, hosted by the UK government at Lancaster House in London. The Summit will address traditional and emerging risks related to energy security in an era of geopolitical strains, technological transformation and a changing climate. The Summit will examine the geopolitical, technological and economic factors affecting energy security at the national and international level. It will provide leaders and decision-makers from around the world with an opportunity to review the trends redefining global energy security. These include changes in energy demand, supply and trade; the adoption of clean and efficient energy solutions; the availability of the minerals and metals required for clean energy technologies – from wind turbines and solar panels to electric vehicles and battery storage; and the allocation of investment during the transition away from fossil fuels.The IEA has been at the heart of international energy security for 50 years – helping avoid, mitigate and manage energy supply disruptions and crises. As the world changes, so do the challenges around energy security. While risks around oil and natural gas security show no signs of abating, new ones are emerging that could significantly hinder energy transitions and undermine the resilience of energy systems, if not addressed promptly and effectively. This calls for new and enhanced approaches to energy security – fit for today and the decades ahead – to ensure uninterrupted access to affordable energy.",
        "formatted_timestamp":"2024-10-25 09:55:00",
        "source":"IEA"
    }
]