[
    {
        "title":"Massive global growth of renewables to 2030 is set to match entire power capacity of major economies today, moving world closer to tripling goal",
        "subtitle":"With solar leading their rapid deployment, renewables are on course to meet almost half of global electricity demand by the end of this decade, new IEA report says",
        "body":"Due to supportive policies and favourable economics, the world’s renewable power capacity is expected to surge over the rest of this decade, with global additions on course to roughly equal the current power capacity of China, the European Union, India and the United States combined, according to a new IEA report out today.The Renewables 2024 report, the IEA’s flagship annual publication on the sector, finds that the world is set to add more than 5 500 gigawatts (GW) of new renewable energy capacity between 2024 and 2030 – almost three times the increase seen between 2017 and 2023.According to the report, China is set to account for almost 60% of all renewable capacity installed worldwide between now and 2030, based on current market trends and today's policy settings by governments. That would make China home to almost half of the world’s total renewable power capacity by the end of this decade, up from a share of a third in 2010. While China is adding the biggest volumes of renewables, India is growing at the fastest rate among major economies.In terms of technologies, solar PV alone is forecast to account for a massive 80% of the growth in global renewable capacity between now and 2030 – the result of the construction of new large solar power plants as well as an increase in rooftop solar installations by companies and households. And despite ongoing challenges, the wind sector is also poised for a recovery, with the rate of expansion doubling between 2024 and 2030, compared with the period between 2017 and 2023. Already, wind and solar PV are the cheapest options to add new electricity generation in almost every country.As a result of these trends, nearly 70 countries that collectively account for 80% of global renewable power capacity are poised to reach or surpass their current renewable ambitions for 2030. The growth is not fully in line with the goal set by nearly 200 governments at the COP28 climate change conference in December 2023 to triple the world’s renewable capacity this decade – the report forecasts global capacity will reach 2.7 times its 2022 level by 2030. But IEA analysis indicates that fully meeting the tripling target is entirely possible if governments take near-term opportunities for action. This includes outlining bold plans in the next round of Nationally Determined Contributions under the Paris Agreement due next year, and bolstering international cooperation on bringing down high financing costs in emerging and developing economies, which are restraining renewables’ growth in high-potential regions such as Africa and Southeast Asia.“Renewables are moving faster than national governments can set targets for. This is mainly driven not just by efforts to lower emissions or boost energy security – it’s increasingly because renewables today offer the cheapest option to add new power plants in almost all countries around the world,” said IEA Executive Director Fatih Birol. “This report shows that the growth of renewables, especially solar, will transform electricity systems across the globe this decade. Between now and 2030, the world is on course to add more than 5 500 gigawatts of renewable power capacity – roughly equal the current power capacity of China, the European Union, India and the United States combined. By 2030, we expect renewables to be meeting half of global electricity demand.”By the end of this decade, the share of wind and solar PV alone in global electricity generation is set to double to 30%, according to the forecast. However, the report emphasises the need for governments to ramp up their efforts to securely integrate these variable renewable sources into power systems. Recently, rates of curtailment – where renewable electricity generation isn’t put to use – have been increasing substantially, already reaching around 10% in several countries today. To address this, countries should focus on measures such as increasing power system flexibility. Making a concerted push to address policy uncertainties and streamline permitting processes – and to build and modernise 25 million kilometres of electricity grids and reach 1 500 GW of storage capacity by 2030, as highlighted in previous IEA analysis – would enable even larger shares of generation from renewables.Overall, led by the massive growth of renewable electricity, the share of renewables in final energy consumption is forecast to increase to nearly 20% by 2030, up from 13% in 2023. Meanwhile, renewable fuels – the subject of a special chapter in the report – are lagging behind, underscoring the need for dedicated policy support to decarbonise sectors that are hard to electrify.Meeting international climate goals would require not only accelerating the rollout of renewable power, but also significantly speeding up the adoption of sustainable biofuels, biogases, hydrogen and e-fuels, the report notes. Since these fuels remain more expensive than their fossil counterparts, their share in global energy is set to remain below 6% in 2030.The report also looks at the state of manufacturing for renewable technologies. Global solar manufacturing capacity is expected to surpass 1 100 GW by the end of 2024, more than double projected demand. While this supply glut, concentrated in China, has supported a decline in module prices – which have more than halved since early 2023 as a result – it also means that many manufacturers are seeing large financial losses.Given the growing international focus on industrial competitiveness, solar PV manufacturing capacity is forecast to triple in both India and the United States by 2030, helping global diversification. However, producing solar panels in the United States costs three times as much as in China, and in India, it is twice as expensive. According to the report, policymakers should consider how to strike a balance between the additional costs and benefits of local manufacturing, weighing key priorities such as job creation and energy security.",
        "formatted_timestamp":"2024-10-09 07:00:00",
        "source":"IEA"
    }
]