[
    {
        "title":"Much faster progress on energy efficiency is needed to meet global 2030 goal",
        "subtitle":"Doubling global rate of improvement will require countries to accelerate policy implementation, which would improve energy security, reduce energy costs and lower emissions",
        "body":"One year on from the historic global pledge at COP28 to double the rate of energy efficiency improvements by 2030, new analysis from the IEA shows that countries are not yet on track for this goal, requiring stronger action and cooperation to align with their stated ambitions.Energy Efficiency 2024, the IEA’s annual report on energy efficiency developments around the world, finds that global primary energy intensity – a measure of efficiency – is set to improve by around 1% in 2024. This is the same rate as in 2023, and around half of the average rate between 2010 and 2019. At the COP28 climate change conference in Dubai last year, nearly 200 countries agreed to the goal of doubling the rate of progress, which would mean increasing it from 2% in 2022 to 4% by 2030.Boosting energy efficiency is about getting more from everyday technologies and industrial processes for the same amount of energy input, and means more jobs, healthier cities and a range of other benefits. Improving the efficiency of buildings and vehicles, as well as in other areas, is central to clean energy transitions, since it simultaneously improves energy security, lowers energy bills for consumers and reduces greenhouse gas emissions. The new report shows that governments worldwide are making policy progress, with those representing more than 70% of global energy demand implementing new or updated efficiency policies in 2024. The European Union, for example, revised regulations to achieve a zero-emission building stock by 2050; China overhauled appliance standards and strengthened national targets for efficiency; the United States tightened its fuel economy standards for heavy-duty vehicles; and Kenya made its building code mandatory to ensure all new buildings are more efficient. However, to align with global targets, fresh policies need to arrive more quickly around the world, and many existing ones need to be tightened, according to the report.“Energy efficiency is a key pillar of secure, affordable and inclusive energy transitions. The IEA is working closer than ever with governments around the world to ensure that it remains a top policy priority,” said IEA Executive Director Fatih Birol. “Fortunately, the policies and technologies to accelerate efficiency progress are readily available today, and many governments are taking important steps forward. What we hope to see now is faster and stronger policy responses across the globe.”To increase visibility on energy efficiency and support stronger progress towards the global doubling target, the IEA launched a new Energy Efficiency Progress Tracker today alongside the report – extending the analysis of Energy Efficiency 2024 to provide detailed insights via the most up-to-date regional indicators on energy intensity, demand and electrification levels. This complements the Agency’s wider analytical support for governments, such as the IEA Energy Efficiency Policy Toolkits that are published annually.According to the new report, there are important elements of progress worth noting, especially in major emerging economies and in the growing global deployment rates of heat pumps and electric vehicles, which generally use much less energy than the technologies they replace.However, greater efficiency will need substantially more investment. Investment in energy efficient technologies grew by 4% in 2024 – and is on course to reach a record USD 660 billion, according to the report. New IEA analysis reveals that efficient technologies do not necessarily cost more to buy than less efficient ones – and often cost much less over their lifetime, since they are cheaper to run. Best-in-class air conditioners, for example, can save up to 40% in total costs compared with inefficient ones.",
        "formatted_timestamp":"2024-11-07 07:00:00",
        "source":"IEA"
    }
]