[
    {
        "title":"Natural gas demand growth picks up in 2024 amid uncertainties over supply",
        "subtitle":"Producers and consumers need to work together to ensure secure global gas supplies amid mounting geopolitical concerns, according to new IEA report",
        "body":"Global demand for natural gas is increasing at a stronger rate in 2024 than in the previous two years, which were heavily affected by the turmoil of the global energy crisis. At the same time, new gas supplies coming to market in 2024 remain limited due to the relatively slow growth of LNG production while geopolitical tensions continue to fuel price volatility, according to a new IEA review of global gas markets and security.Global gas demand is forecast to rise by more than 2.5% in 2024, with similar growth expected in 2025, according to the latest edition of the IEA’s annual Global Gas Security Review. Fast-growing markets in Asia account for a large amount of the increase while a rebound in Europe’s industrial gas demand is also contributing, even though it remains well below its pre-crisis levels. The new Security Review also includes the IEA’s latest quarterly Gas Market Report analysis.“The growth we’re seeing in global gas demand this year and next reflects the gradual recovery from a global energy crisis that hit markets hard,” said IEA Director of Energy Markets and Security Keisuke Sadamori. “But the balance between demand and supply trends is fragile, with clear risks of future volatility. Producers and consumers must work together closely to navigate these uncertain times while taking into account the need to advance clean energy transitions to ensure a secure and sustainable future.” The report finds that markets remain sensitive to unexpected supply and demand side developments. LNG’s role in the global gas trade has grown since the onset of the global energy crisis, and it is likely to play a crucial part in maintaining the supply-demand balance globally. Constraints across the Panama Canal and the Red Sea continue to impact shipping but have not led to a decline in LNG supply thus far. However, they highlight the potential vulnerabilities of LNG trade in an increasingly interconnected global gas market. The situation may shift in 2025 when LNG supply growth is set to accelerate to near 6% as several large LNG projects come online, mainly in the second half of the year. North America will account for the vast majority of new capacity, while new volumes from Africa and Asia will also contribute. A key uncertainty ahead of the 2024-25 Northern Hemisphere winter is the transit of Russian gas via Ukraine, with existing contracts set to expire at the end of 2024. This could mean an end to all piped gas deliveries to Europe from Russia through Ukraine. In turn, this would require higher LNG imports to Europe in 2025 and consequently lead to a tighter global gas balance than if transit via Ukraine continued. To address some of these challenges, the IEA recommends that flexibility mechanisms along gas and LNG value chains could be enhanced by improving the liquidity of the global LNG market, integrating the Ukrainian gas storage system into the global gas market, and considering potential frameworks for voluntary gas reserve mechanisms.This year’s edition of the Global Gas Security Review contains a special section on system integration of low-emissions gases in the transport sector. This new analysis is part the IEA’s Low-Emissions Gases Work Programme.As well as providing analysis on global gas markets, the IEA is also working with governments around the world to support security of supply. Since its establishment in October 2022, the International Energy Agency’s Task Force on Gas and Clean Fuels Market Monitoring and Supply and Security has provided key market updates and a platform for data and information exchange among members. The Task Force worked closely with the government of Japan ahead of the 13th LNG Producer-Consumer Conference co-organised by the International Energy Agency and Japan’s Ministry of Economy, Trade and Industry.",
        "formatted_timestamp":"2024-10-03 09:00:00",
        "source":"IEA"
    }
]