[
    {
        "title":"New IEA report outlines key steps to build more resilient and decentralised power system in Ukraine",
        "subtitle":"Analysis shows major role for technologies such as solar PV, modular gas turbines and batteries in supporting Ukraine’s near- and long-term energy security",
        "body":"As Ukraine looks to rebuild its energy sector following a recent acceleration in attacks by Russia, pursuing a more decentralised electricity system would help ensure reliable access to power, heating and water for millions of Ukrainian citizens, according to a new IEA report.Empowering Ukraine through a Decentralised Electricity System was published today and launched by an IEA delegation in Ukraine’s capital, Kyiv, with Deputy Energy Minister Roman Andarak and other key Ukrainian power system stakeholders. It finds that without urgent action, Ukraine faces the risk of prolonged power cuts throughout 2025 and even beyond. Following intensified attacks in the spring of 2024, about two‑thirds of the country’s dispatchable power generation capacity was occupied, damaged or destroyed, leading to rolling blackouts as well as unscheduled power outages. With peak demand this winter likely to reach 18.5 gigawatts (GW), creating a supply deficit of as much as 6 GW, these could continue through the coming months.As a result, Ukraine must act now to meet its immediate power needs, while also planning for the years ahead, according to the report. It finds that a more decentralised system – with growing capacities of rooftop solar, wind, batteries and small modular gas turbines – could mitigate the impacts of the ongoing attacks and align Ukraine’s energy system with the government’s long-term goals for energy security and decarbonisation.The analysis follows the publication in September of a special IEA report focused on Ukraine’s energy security and the coming winter. The report released today builds on this work by specifically outlining seven key actions to create a decentralised and modern power system in Ukraine by 2030. These include improving regulatory frameworks, reforming electricity markets and strengthening coordination at the transmission and distribution level. “This winter, Ukraine’s energy system is facing its biggest test to date, compounding the immense suffering of Ukrainian’s citizens despite their great resolve. Though the situation is dire, this report shows important steps that policy makers can take now to meet the country’s immediate power needs while also preparing for the future,” IEA Executive Director Fatih Birol said. “Making Ukraine’s power system less centralised would help protect it from ongoing Russian attacks and boost energy security, resilience and affordability down the line. We look forward to continuing work with our partners in Ukraine on these issues in the months and years to come.”“We thank the IEA for the new report on the state of the Ukrainian energy system and for the recommendations on how to strengthen its resilience and flexibility in the face of devastating Russian attacks, which have significantly intensified in recent months,” said Deputy Minister Andarak. “The development of flexible distributed generation – in particular by installing renewable energy sources, storage, efficient cogeneration, gas turbine and gas piston units – will make our energy sector less vulnerable to Russian attacks. Distributed generation will certainly remain our priority and we hope for support and close cooperation with partners in these areas.”The report finds that what are known as distributed energy resources can play a pivotal role in achieving Ukraine’s 2030 energy goals. Though there are many uncertainties, it could meet these objectives by adding 24 GW of solar, 11 GW of wind and 6 GW of energy storage capacity this decade while maintaining surviving generation assets, based on new IEA modelling.Additionally, this modelling shows that rebuilding Ukraine's power system based on small modular gas turbines and gas engines alone would require nearly $12.8 billion in upfront investment. While adding in more diverse sources of power supply, including variable renewables and batteries, would cost between $15.5 billion and $23 billion upfront, it represents the most cost-effective solution – largely because it would reduce the need for electricity and fossil fuel imports, resulting in a roughly 6% decline in annual costs over time.",
        "formatted_timestamp":"17 December 2024",
        "source":"IEA"
    }
]