[
    {
        "title":"Policy momentum behind critical minerals recycling gathering pace but greater uptake required",
        "subtitle":"First-of-its-kind IEA report shows scaling up critical minerals recycling can deliver major benefits for energy security, diversification and emissions reductions.",
        "body":"A surge in new policies and facilities to support the recycling of critical minerals, the essential raw materials that go into clean energy technologies, could significantly reduce potential strains on supply as countries pursue energy transitions.The report, Recycling of Critical Minerals: strategies to scale up recycling and urban mining, shows that the growth in new mining supply for critical minerals could be brought down by between 25-40% by mid-century by scaling up recycling. In a scenario in which countries around the world deliver on all the announced national climate pledges, recycling reduces new mine development needs by 40% for copper and cobalt, and by 25% for lithium and nickel by 2050, the report finds. These metals are the lifeblood of the rapidly expanding clean energy technologies available today including solar, wind, electric vehicles and batteries among others.Investments in new mines remain essential as supply levels required by mid-century are much higher than today’s production and existing mines face natural declines in output. Based on announced climate pledges, around $600 billion of mining investment is required through 2040, but this amount would be 30% higher without the uptake of recycling.Despite growing policy ambitions, the use of recycled materials has so far failed to keep pace with rising material consumption, with the share of secondary copper and nickel declining. But the IEA’s new report shows that there is vast potential for expanding recycling worldwide, if the right policy incentives are in place, as EVs reach end-of-life and feedstock availability increases rapidly after 2030. The market for recycled battery metals is already growing fast with an 11-fold increase in less than a decade, albeit from a relatively low base.Policy interest in this area is picking up. In the last three years, according to the IEA’s Critical Minerals Policy Tracker, more than 30 new policy measures on recycling have been introduced. And if all existing and announced policies are realised, the market value of critical minerals recycling could reach $200 billion by 2050.Expanding recycling can have positive knock-on effects for energy security by reducing reliance on imports and building up reserves to mitigate against future supply shocks and price volatility. The security benefits can be greater in regions with limited mineral resources and substantial clean energy deployment. Moreover, it reduces the environmental and social impact. On average, recycled critical minerals incur 80% less greenhouse gas emissions than primary materials from mining and help prevent waste of end-use technologies ending up in landfill. “Recycling is vital to tackling the challenges around critical mineral supplies and ensuring long term sustainability,” said IEA Executive Director Fatih Birol. “Investment in new mines and refineries remains crucial but there is ample opportunity for recycling to maximise the resources already at our disposal. As we move into the Age of Electricity, we have to take advantage of this treasure trove of worn batteries and electrical devices that could be revived and reused, but to do so we must develop a mature marketplace for recycling to make it attractive and easily accessible.”The report highlights that battery recycling capacity is expanding rapidly, with 50% year-on-year growth in 2023. China remains the global leader for pretreatment and material recovery and is expected to maintain more than 70% market share in both areas toward 2030. The country, which already has a dominant position on critical minerals refining, recently announced a new state-owned enterprise dedicated to recycling and reusing end-of-life batteries as well as other materials.Recycling capacity is currently outpacing available feedstock, but that picture could change dramatically after 2030, according to the report, as more clean energy technology installations and electric vehicles reach end-of-life. There are major regional differences. China continues to see higher capacity relative to domestic feedstock. In Europe and the United States announced recycling capacity covers only 30% of feedstock by 2040. This is higher than in India, where the coverage in 2040 is just 10%.Some of the policies already in place to support recycling include financial incentives and industry-specific targets for material recovery, collection rates and minimum recycled content. However, many of these strategies are not comprehensive and need to be expanded to other crucial sectors, according to the report. Greater clarity on policies and regulations is also essential to support the uptake of battery recycling with the absence of clear, long-term regulations including export rules for used batteries and EVs creating barriers to investment.While critical mineral recycling can have positive impacts on the expansion of clean energy technologies and their sustainability, they are not free from environmental and social impacts, the report finds. Poorly managed battery recycling may result in pollution, water contamination and other harmful emissions. Moreover, there is significant scope to strengthen existing recycling standards. To address these aspects, the IEA’s report sets out a series of key actions for policymakers to scale up critical mineral recycling, underpinned by detailed long-term policy roadmaps with clear targets and milestones that will offer greater certainty to investors.",
        "formatted_timestamp":"18 November 2024",
        "source":"IEA"
    }
]