[
    {
        "title":"Rising component prices and supply chain pressures are hindering the development of transmission grid infrastructure",
        "subtitle":"Global grid expansion is struggling to keep pace with surging demand for electricity as procurement lead times and costs for essential parts have nearly doubled since 2021",
        "body":"Efforts to expand and modernise electricity transmission grids around the world face mounting challenges as supply chain bottlenecks intensify, according to a new IEA report. Prices and procurement times for essential components like power transformers and cables have almost doubled in four years, creating significant hurdles for grid developers.The report, Building the Future Transmission Grid: Strategies to Navigate Supply Chain Challenges, highlights that developing transmission infrastructure is essential for energy security and reliable electricity delivery. The supply chain challenges facing the sector come as the world moves toward the Age of Electricity, with global power consumption set to increase strongly in the years ahead. This trend results from the growing electrification of industrial activity; rising use of air conditioning, appliances, electric vehicles and heat pumps; and the expansion of data centres to support the rapid development of artificial intelligence.While permitting remains the primary cause of delays in transmission projects, particularly in advanced economies, supply chain issues have emerged as a critical limitation. An IEA survey of industry leaders found that procurement now takes two to three years for cables and up to four years for large power transformers – twice as long as in 2021. Specialised components face even longer delays, with lead times for direct current cables – often used for long-distance transmission – extending beyond five years. The price increases for components are equally concerning. In real terms, cable costs have nearly doubled since 2019 while power transformer prices have increased by around 75%. Competing demand from grid expansion projects that are underway simultaneously across multiple regions is exacerbating the bottlenecks. The increased development of offshore wind power projects has further increased demand for specialised high-voltage subsea cables, putting additional pressure on already strained supply chains.The report shows that manufacturers are responding with plans and investments to increase production capacity, but these expansions will take time to implement, and uncertainty remains regarding future demand levels and the availability of skilled workers. The report finds that around 8 million people worldwide are currently employed in constructing, maintaining and operating grids, and this workforce will need to grow by at least 1.5 million by 2030 to meet projected demand.Supply chain constraints come at a particularly challenging time, with more than 1,600 gigawatts of solar and wind projects in advanced development stages awaiting grid connections. The report notes that while global investment in power transmission grew by 10% in 2023 to reach $140 billion, this figure would need to exceed $200 billion annually by the mid-2030s to meet rising electricity demand.Timely investment in the supply chain requires confidence among manufacturers on the level of future demand for networks and components. To this end, the IEA recommends enhancing the visibility of future infrastructure needs via transparent and credible advance planning, encouraging proactive grid investment, designing effective procurement frameworks, and ensuring a skilled workforce across the sector. Additional recommendations include streamlining permitting processes, optimising the use of existing grid infrastructure through digital technologies, and measures by policymakers to encourage greater diversity and resilience in supply chains.The report emphasises that coordinated efforts across the entire supply chain will be essential to overcome these bottlenecks and enable reliable power system development for the future.",
        "formatted_timestamp":"25 February 2025",
        "source":"IEA"
    }
]