[
    {
        "title":"Southeast Asia’s role in the global energy system is set to grow strongly over next decade",
        "subtitle":"The region’s growing emissions and exposure to fossil fuel volatility are strengthening the case for an accelerated rollout of clean energy technologies, new IEA report shows",
        "body":"Southeast Asia is set to be one of the world’s largest engines of energy demand growth over the next decade as its rapid economic, population and manufacturing expansions drive up consumption, according to a new IEA report, posing challenges for the region’s energy security and efforts to achieve national climate goals. Based on today’s policy settings, Southeast Asia is on course to account for 25% of global energy demand growth between now and 2035, second only to India over the period and more than double the region’s share of growth since 2010. By mid-century, energy demand in Southeast Asia overtakes that of the European Union.Growth is led by the electricity sector. Electricity demand in Southeast Asia is set to surge at an annual rate of 4%, the report projects, with growing use of air conditioning amid more frequent heatwaves a big driver of increased electricity consumption. According to the report, clean energy sources such as wind and solar, alongside modern bioenergy and geothermal, are projected to meet more than a third of the growth in energy demand in the region by 2035. This is a step up compared with the past but not enough to rein in the region’s energy-related carbon dioxide (CO2) emissions, which are set to increase by 35% between now and mid-century. To turn this around, a major push is required to align with the outcomes of the COP28 climate change conference and meet the national goals that have been set in the region, all of which would mean halving today’s emissions by 2050, the report finds. Today, of the 10 member economies of the Association of Southeast Asian Nations (ASEAN), which are among the world’s fastest growing, eight have net zero emissions goals. “Southeast Asia is one of the most economically dynamic regions of the world and is set to account for a quarter of the growth in global energy demand over the next decade as its population, prosperity and industries expand,” said IEA Executive Director Fatih Birol. “Countries in the region have a diverse mix of energy sources including highly competitive renewables. But clean energy technologies are not expanding quickly enough and the continued heavy reliance on fossil fuel imports is leaving countries highly exposed to future risks. Southeast Asia has made great progress on issues such as energy access, clean cooking and developing clean energy manufacturing, but now it must ramp up efforts to deploy those technologies at home. Access to finance and investment for the region’s fast-growing economies will play a pivotal role in strengthening their energy security and delivering on their emissions reduction goals.” Scaling up clean energy investments is crucial for Southeast Asia to reduce emissions, the report highlights. As of today, the region as a whole attracts only 2% of global clean energy investment despite accounting for 6% of global GDP, 5% of global energy demand and being home to 9% of the world’s population. The current level of investment will require a fivefold increase – with $190 billion needed in 2035 – to put the region on a pathway consistent with achieving its announced energy and climate goals. Scaling up clean energy investment needs to be accompanied by strategies to reduce emissions from the region’s relatively young fleet of coal-fired plants, which are less than 15 years old on average.In addition to deploying technologies such as wind and solar, a build out of associated infrastructure is essential to ensure secure and flexible electricity systems. Expanding and modernising the region’s power grids to support greater shares of variable renewable energy will require annual investment in this space to double to nearly $30 billion by 2035, according to the report. This includes regional cooperation initiatives such as the ASEAN Power Grid as well renewables-based microgrids to serve islands and communities in remote areas.The report highlights how the benefits of accelerating clean energy transitions have already been felt across Southeast Asia, with over 85,000 jobs created since 2019, and further potential to expand clean energy technology manufacturing and critical minerals processing across the region. For example, Indonesia, with its vast reserves of nickel, is a major producer of lithium-ion batteries and components.  Viet Nam, Thailand and Malaysia are the largest manufacturers of solar PV systems after China. And Singapore, the world’s largest bunkering port, can play a critical role in efforts to reduce emissions from shipping through fuels such as ammonia and methanol. International cooperation, through organisations such as ASEAN, will be essential to move forward on secure, people-centred clean energy transitions at a time of escalating geopolitical tensions and growing climate risks. The IEA stands ready to support countries in Southeast Asia in their efforts to reach these goals. The opening of the IEA’s new office in Singapore – the first IEA office outside the Agency’s Paris headquarters in its 50-year history – is a concrete example of the IEA’s deepening engagement with countries across Southeast Asia and beyond to enhance energy security and accelerate clean energy transitions.",
        "formatted_timestamp":"2024-10-22 00:01:00",
        "source":"IEA"
    }
]