[
    {
        "title":"Technology breakthroughs are unlocking geothermal energy’s vast potential in countries across the globe",
        "subtitle":"Largely untapped underground energy source can help meet world’s rapidly growing demand for electricity, but cost reductions are needed to drive new generation of projects",
        "body":"With global electricity demand set to grow strongly, new technologies are opening up the massive potential of geothermal energy to provide around-the-clock clean power in almost all countries around the world, according to a new IEA report. The report, The Future of Geothermal Energy, finds that geothermal energy could meet 15% of global electricity demand growth between now and 2050 if project costs continue to decline. This would mean the deployment of as much as 800 gigawatts of geothermal capacity worldwide, delivering annual output equivalent to the current electricity demand of the United States and India combined. Geothermal energy offers abundant, highly flexible and clean electricity supplies that can support variable renewable technologies such as wind and solar while complementing other low-emissions sources like nuclear. Today, geothermal meets about 1% of global electricity demand. However, based on a new first-of-its-kind country-level analysis, conducted in collaboration with Project InnerSpace, the IEA report shows that next-generation geothermal technologies have the technical potential to meet global electricity and heat demand many times over.Importantly, geothermal energy can draw upon the expertise of today’s oil and gas industries by using existing drilling techniques and equipment to go deeper under the earth’s surface to tap into vast low-emissions energy resources. “New technologies are opening new horizons for geothermal energy across the globe, offering the possibility of meeting a significant portion of the world’s rapidly growing demand for electricity securely and cleanly,” said IEA Executive Director Fatih Birol. “What’s more, geothermal is a major opportunity to draw on the technology and expertise of the oil and gas industry. Our analysis shows that the growth of geothermal could generate investment worth $1 trillion by 2035.”Conventional geothermal remains a location-specific, niche technology today with most of the installed capacity in countries that have either have volcanic activity or straddle tectonic fault lines, which make resources easier to access. Current leaders in the space include the United States, Iceland, Indonesia, Türkiye, Kenya and Italy. But new technologies are making the outlook for geothermal truly global, opening up the potential to benefit from it in nearly all countries. The report highlights that more than 100 countries have policies in place for solar PV and onshore wind, but only 30 have such policies for geothermal. Moving geothermal up national energy agendas with specific goals, backed support for innovation and technology development, can go a long way to reducing project risk perception and unlocking new investment. Clear, long-term regulatory visibility for investors will help mitigate risks in early-stage development and provide visibility on investment returns, which in turn will improve the cost competitiveness of geothermal projects. By doing so, the report finds that costs could fall by 80% by 2035 to around $50 per megawatt hour (MWh). This would make geothermal the cheapest source of dispatchable low-emissions electricity on a par with existing hydropower and nuclear installations. At such price levels, geothermal would also be highly competitive with solar PV and wind paired with battery storage. The report finds that the total investment in geothermal could reach $1 trillion by 2035 and $2.5 trillion by 2050. If next-generation geothermal grows strongly in the coming years, employment in the overall geothermal sector could increase sixfold to 1 million jobs by 2030, according to the report.The oil and gas industry can play a key role in making geothermal more competitive. Up to 80% of the investment required in geothermal involves capacity and skills that are transferrable from existing oil and gas operations. The oil and gas industry can also benefit from tapping the potential of geothermal energy. Not only is it an opportunity to develop new business lines in the fast-growing clean energy economy, but it can also serve as a hedge against commercial risks related to projected future declines in oil and gas demand. At a time when the digital economy and artificial intelligence applications are growing strongly, the report highlights geothermal’s potential to help power the increasing number of large data centres that underpin the tech sector. With next-generation geothermal offering a stable and essentially inexhaustible power source, large technology companies are already signing power purchase agreements with new projects.  However, permitting and administrative red-tape are proving a major barrier to geothermal projects, which can take up to a decade to fully commission. The report suggests governments could simplify permitting processes by consolidating and accelerating the administrative steps involved. They could also consider dedicated geothermal permitting regimes separate from minerals mining. Policies and regulations enforcing robust environmental standards are critical for the sustainable development of geothermal projects.",
        "formatted_timestamp":"13 December 2024",
        "source":"IEA"
    }
]